{
  "metadata": {
    "title": "Brideshead Revisited",
    "author": "Evelyn Waugh",
    "edition": "Back Bay Books, 2012",
    "creation_date": "2025-12-10T20:47:27.435270",
    "protocol_version": "4.0",
    "kernel_version": "5.1",
    "chapter_aware": true,
    "structure_alignment_protocol": "v1.1",
    "device_density_optimization": true
  },
  "text_structure": {
    "has_chapters": true,
    "total_chapters_estimate": 15,
    "notes": "Chapter breaks identified during kernel creation"
  },
  "structure_detection": {
    "structure_type": "NEST",
    "total_units": 15,
    "special_elements": [
      "PRO",
      "EPI"
    ],
    "notes": "Nested structure: Prologue + Book One (5 chapters) + Book Two (3 chapters) + Book Three (5 chapters) + Epilogue"
  },
  "chapter_alignment": {
    "exposition": {
      "chapter_range": "1-2",
      "chapters": [
        1,
        2
      ],
      "primary_chapter": 1,
      "percentage": 13
    },
    "rising_action": {
      "chapter_range": "3-10",
      "chapters": [
        3,
        4,
        5,
        6,
        7,
        8,
        9,
        10
      ],
      "primary_chapter": 7,
      "percentage": 53
    },
    "climax": {
      "chapter_range": "11-12",
      "chapters": [
        11,
        12
      ],
      "primary_chapter": 11,
      "percentage": 13
    },
    "falling_action": {
      "chapter_range": "13-14",
      "chapters": [
        13,
        14
      ],
      "primary_chapter": 13,
      "percentage": 13
    },
    "resolution": {
      "chapter_range": "15",
      "chapters": [
        15
      ],
      "primary_chapter": 15,
      "percentage": 7
    }
  },
  "chapter_optimization": {
    "exposition": {
      "chapter_range": "1-2",
      "narrative_primary": 1,
      "optimized_primary": 2,
      "device_density_score": 43.73368146214099,
      "improvement_percent": 16.70950045942085,
      "optimization_applied": true,
      "chapter_text": "Collins had exposed the fallacy of modern aesthetics to me: “… the whole argument from Significant Form stands or falls by volume . If you allow Cézanne to represent a third dimension on his two-dimensional canvas, then you must allow Landseer his gleam of loyalty in the spaniel’s eye”… but it was not until Sebastian, idly turning the page of Clive Bell’s Art, read: “ ‘Does anyone feel the same kind of emotion for a butterfly or a flower that he feels for a cathedral or a picture?’ Yes. I do,” that my eyes were opened. I knew Sebastian by sight long before I met him. That was unavoidable for, from his first week, he was the most conspicuous man of his year by reason of his beauty, which was arresting, and his eccentricities of behavior, which seemed to know no bounds. My first sight of him was in the door of Germer’s, and, on that occasion, I was struck less by his looks than by the fact that he was carrying a large teddy-bear. “That,” said the barber, as I took his chair, “was Lord Sebastian Flyte. A most amusing young gentleman.” “Apparently,” I said coldly. “The Marquis of Marchmain’s second boy. His brother, the Earl of Brideshead, went down last term. Now he was very different, a very quiet gentleman, quite like an old man. What do you suppose Lord Sebastian wanted? A hair brush for his teddy-bear; it had to have very stiff bristles, not , Lord Sebastian said, to brush him with, but to threaten him with a spanking when he was sulky. He bought a very nice one with an ivory back and he’s having ‘Aloysius’ engraved on it—that’s the bear’s name.” The man, who, in his time, had had ample chance to tire of undergraduate fantasy, was plainly captivated. I, however, remained censorious, and subsequent glimpses of him, driving in a hansom cab and dining at the George in false whiskers, did not soften me, although Collins, who was reading Freud, had a number of technical terms to cover everything.Nor, when at last we met, were the circumstances propitious. It was shortly before midnight in early March; I had been entertaining the college intellectuals to mulled claret; the fire was roaring, the air of my room heavy with smoke and spice, and my mind weary with metaphysics. I threw open my windows and from the quad outside came the not uncommon sounds of bibulous laughter and unsteady steps. A voice said: “Hold up”; another, “Come on”; another, “Plenty of time… House… till Tom stops ringing”; and another, clearer than the rest, “D’you know I feel most unaccountably unwell. I must leave you a minute,” and there appeared at my window the face I knew to be Sebastian’s, but not, as I had formerly seen it, alive and alight with gaiety; he looked at me for a moment with unfocused eyes and then, leaning forward well into the room, he was sick. It was not unusual for dinner parties to end in that way; there was in fact a recognized tariff for the scout on such occasions; we were all learning, by trial and error, to carry our wine. There was also a kind of insane and endearing orderliness about Sebastian’s choice, in his extremity, of an open window. But, when all is said, it remained an unpropitious meeting. His friends bore him to the gate and, in a few minutes, his host, an amiable Etonian of my year, returned to apologize. He, too, was tipsy and his explanations were repetitive and, towards the end, tearful. “The wines were too various,” he said: “it was neither the quality nor the quantity that was at fault. It was the mixture. Grasp that and you have the root of the matter. To understand all is to forgive all.” “Yes,” I said, but it was with a sense of grievance that I faced Lunt’s reproaches next morning. “A couple of jugs of mulled claret between the five of you,” Lunt said, “and this had to happen. Couldn’t even get to the window. Those that can’t keep it down are better without it.” “It wasn’t one of my party. It was someone from out of college.” “Well, it’s just as nasty clearing it up, whoever it was.” “There’s five shillings on the sideboard.” “So I saw and thank you, but I’d rather not have the money and not have the mess, any morning.” I took my gown and left him to his task. I still frequented the lecture-room in those days, and it was after eleven when I returned to college. I found my room full of flowers; what looked like, and, in fact, was, the entire day’s stock of a market-stall stood in every conceivable vessel in every part of the room.Lunt was secreting the last of them in brown paper preparatory to taking them home. “Lunt, what is all this?” “The gentleman from last night, sir, he left a note for you.” The note was written in conté crayon on a whole sheet of my choice Whatman H.P. drawing paper: I am very contrite. Aloysius won’t speak to me until he sees I am forgiven, so please come to luncheon today. Sebastian Flyte. It was typical of him, I reflected, to assume I knew where he lived; but, then, I did know. “A most amusing gentleman, I’m sure it’s quite a pleasure to clean up after him. I take it you’re lunching out, sir. I told Mr. Collins and Mr. Partridge so —they wanted to have their commons in here with you.” “Yes, Lunt, lunching out.” That luncheon party—for party it proved to be—was the beginning of a new epoch in my life. I went there uncertainly, for it was foreign ground and there was a tiny, priggish, warning voice in my ear which in the tones of Collins told me it was seemly to hold back. But I was in search of love in those days, and I went full of curiosity and the faint, unrecognized apprehension that here, at last, I should find that low door in the wall, which others, I knew, had found before me, which opened on an enclosed and enchanted garden, which was somewhere, not overlooked by any window, in the heart of that gray city. Sebastian lived at Christ Church, high in Meadow Buildings. He was alone when I came, peeling a plover’s egg taken from the large nest of moss in the center of his table. “I’ve just counted them,” he said. “There were five each and two over, so I’m having the two. I’m unaccountably hungry today. I put myself unreservedly in the hands of Dolbear and Goodall, and feel so drugged that I’ve begun to believe that the whole of yesterday evening was a dream. Please don’t wake me up.” He was entrancing, with that epicene beauty which in extreme youth sings aloud for love and withers at the first cold wind. His room was filled with a strange jumble of objects—a harmonium in a gothic case, an elephant’s-foot waste-paper basket, a dome of wax fruit, two disproportionately large Sèvres vases, framed drawings by Daumier—made all the more incongruous by the austere college furniture and the large luncheon table. His chimneypiece was covered in cards of invitation from London hostesses. “That beast Hobson has put Aloysius next door,” he said. “Perhaps it’s as well, as there wouldn’t have been any plovers’ eggs for him. D’you know,Hobson hates Aloysius. I wish I had a scout like yours. He was sweet to me this morning where some people might have been quite strict.” The party assembled. There were three Etonian freshmen, mild, elegant, detached young men who had all been to a dance in London the night before, and spoke of it as though it had been the funeral of a near but unloved kinsman. Each as he came into the room made first for the plovers’ eggs, then noticed Sebastian and then myself with a polite lack of curiosity which seemed to say: “We should not dream of being so offensive as to suggest that you never met us before.” “The first this year,” they said. “Where do you get them?” “Mummy sends them from Brideshead. They always lay early for her.” When the eggs were gone and we were eating the lobster Newburg, the last guest arrived. “My dear,” he said, “I couldn’t get away before. I was lunching with my p- p-preposterous tutor. He thought it very odd my leaving when I did. I told him I had to change for F-f-footer .” He was tall, slim, rather swarthy, with large saucy eyes. The rest of us wore rough tweeds and brogues. He had on a smooth chocolate-brown suit with loud white stripes, suede shoes, a large bow-tie and he drew off yellow, wash-leather gloves as he came into the room; part Gallic, part Yankee, part, perhaps, Jew; wholly exotic. This, I did not need telling, was Anthony Blanche, the “aesthete” par excellence , a byword of iniquity from Cherwell Edge to Somerville. He had been pointed out to me often in the streets, as he pranced along with his high peacock tread; I had heard his voice in the George challenging the conventions; and now meeting him, under the spell of Sebastian, I found myself enjoying him voraciously. After luncheon he stood on the balcony with a megaphone which had appeared surprisingly among the bric-à-brac of Sebastian’s room, and in languishing tones recited passages from The Waste Land to the sweatered and muffled throng that was on its way to the river. “I, Tiresias, have foresuffered all,” he sobbed to them from the Venetian arches; “Enacted on this same d-divan or b-bed, I who have sat by Thebes below the wall And walked among the l-l-lowest of the dead …. ” And then, stepping lightly into the room, “How I have surprised them! All b-boatmen are Grace Darlings to me.”We sat on sipping Cointreau while the mildest and most detached of the Etonians sang: “Home they brought her warrior dead” to his own accompaniment on the harmonium. It was four o’clock before we broke up. Anthony Blanche was the first to go. He took formal and complimentary leave of each of us in turn. To Sebastian he said: “My dear, I should like to stick you full of barbed arrows like a p-p-pin-cushion,” and to me: “I think it’s perfectly brilliant of Sebastian to have discovered you. Where do you lurk? I shall come down your burrow and ch-chivvy you out like an old st-t-toat.” The others left soon after him. I rose to go with them, but Sebastian said: “Have some more Cointreau,” so I stayed and later he said, “I must go to the Botanical Gardens.” “Why?” “To see the ivy.” It seemed a good enough reason and I went with him. He took my arm as we walked under the walls of Merton. “I’ve never been to the Botanical Gardens,” I said. “Oh, Charles, what a lot you have to learn! There’s a beautiful arch there and more different kinds of ivy than I knew existed. I don’t know where I should be without the Botanical Gardens.” When at length I returned to my rooms and found them exactly as I had left them that morning, I detected a jejune air that had not irked me before. What was wrong? Nothing except the golden daffodils seemed to be real. Was it the screen? I turned it face to the wall. That was better. It was the end of the screen. Lunt never liked it, and after a few days he took it away, to an obscure refuge he had under the stairs, full of mops and buckets. That day was the beginning of my friendship with Sebastian, and thus it came about, that morning in June, that I was lying beside him in the shade of the high elms watching the smoke from his lips drift up into the branches. Presently we drove on and in another hour were hungry. We stopped at an inn, which was half farm also, and ate eggs and bacon, pickled walnuts and cheese, and drank our beer in a sunless parlor where an old clock ticked in the shadows and a cat slept by the empty grate. We drove on and in the early afternoon came to our destination: wrought- iron gates and twin, classical lodges on a village green, an avenue, more gates, open park-land, a turn in the drive; and suddenly a new and secretlandscape opened before us. We were at the head of a valley and below us, half a mile distant, gray and gold amid a screen of boskage, shone the dome and columns of an old house. “Well?” said Sebastian, stopping the car. Beyond the dome lay receding steps of water and round it, guarding and hiding it, stood the soft hills. “Well?” “What a place to live in!” I said. “You must see the garden front and the fountain.” He leaned forward and put the car into gear. “It’s where my family live”; and even then, rapt in the vision, I felt, momentarily, an ominous chill at the words he used—not, “that is my house,” but “it’s where my family live.” “Don’t worry,” he continued, “they’re all away. You won’t have to meet them.” “But I should like to.” “Well, you can’t. They’re in London.” We drove round the front into a side court—“Everything’s shut up. We’d better go in this way”—and entered through the fortress-like, stone-flagged, stone-vaulted passages of the servants’ quarters—“I want you to meet Nanny Hawkins. That’s what we’ve come for”—and climbed uncarpeted, scrubbed elm stairs, followed more passages of wide boards covered in the center by a thin strip of drugget, through passages covered by linoleum, passing the wells of many minor staircases and many rows of crimson and gold fire buckets, up a final staircase, gated at the head. The dome was false, designed to be seen from below like the cupolas of Chambord. Its drum was merely an additional storey full of segmental rooms. Here were the nurseries. Sebastian’s nanny was seated at the open window; the fountain lay before her, the lakes, the temple, and, far away on the last spur, a glittering obelisk; her hands lay open in her lap and, loosely between them, a rosary; she was fast asleep. Long hours of work in her youth, authority in middle life, repose and security in her age, had set their stamp on her lined and serene face. “Well,” she said, waking; “this is a surprise.” Sebastian kissed her. “Who’s this?” she said, looking at me. “I don’t think I know him.” Sebastian introduced us. “You’ve come just the right time. Julia’s here for the day. Such a time they’re all having. It’s dull without them. Just Mrs. Chandler and two of the girls and old Bert. And then they’re all going on holidays and the boiler’s being done out in August and you going to see his Lordship in Italy, and the rest on visits, it’ll be October before we’re settled down again. Still, I suppose Julia must have her enjoyment the same as other young ladies, though whatthey always want to go to London for in the best of the summer and the gardens all out, I never have understood. Father Phipps was here on Thursday and I said exactly the same to him,” she added as though she had thus acquired sacerdotal authority for her opinion. “D’you say Julia’s here?” “Yes, dear, you must have just missed her. It’s the Conservative Women. Her Ladyship was to have done them, but she’s poorly. Julia won’t be long; she’s leaving immediately after her speech, before the tea.” “I’m afraid we may miss her again.” “Don’t do that, dear, it’ll be such a surprise to her seeing you, though she ought to wait for the tea, I told her, it’s what the Conservative Women come for. Now what’s the news? Are you studying hard at your books?” “Not very, I’m afraid, nanny.” “Ah, cricketing all day long I expect, like your brother. He found time to study, too, though. He’s not been here since Christmas, but he’ll be here for the Agricultural, I expect. Did you see this piece about Julia in the paper? She brought it down for me. Not that it’s nearly good enough of her, but what it says is very nice. ‘The lovely daughter whom Lady Marchmain is bringing out this season… witty as well as ornamental… the most popular debutante,’ well that’s no more than the truth, though it was a shame to cut her hair; such a lovely head of hair she had, just like her Ladyship’s. I said to Father Phipps it’s not natural. He said: ‘Nuns do it,’ and I said, ‘Well, surely, Father, you aren’t going to make a nun out of Lady Julia? The very idea!’ ” Sebastian and the old woman talked on. It was a charming room, oddly shaped to conform with the curve of the dome. The walls were papered in a pattern of ribbon and roses. There was a rocking horse in the corner and an oleograph of the Sacred Heart over the mantelpiece; the empty grate was hidden by a bunch of pampas grass and bulrushes; laid out on the top of the chest of drawers and carefully dusted, were the collection of small presents which had been brought home to her at various times by her children, carved shell and lava, stamped leather, painted wood, china, bog-oak, damascened silver, blue-john, alabaster, coral, the souvenirs of many holidays. Presently nanny said: “Ring the bell, dear, and we’ll have some tea. I usually go down to Mrs. Chandler, but we’ll have it up here today. My usual girl has gone to London with the others. The new one is just up from the village. She didn’t know anything at first, but she’s coming along nicely. Ring the bell.” But Sebastian said we had to go. “And miss Julia? She will be upset when she hears. It would have been such a surprise for her.”“Poor nanny,” said Sebastian when we left the nursery. “She does have such a dull life. I’ve a good mind to bring her to Oxford to live with me, only she’d always be trying to send me to church. We must go quickly before my sister gets back.” “Which are you ashamed of, her or me?” “I’m ashamed of myself,” said Sebastian gravely. “I’m not going to have you get mixed up with my family. They’re so madly charming. All my life they’ve been taking things away from me. If they once got hold of you with their charm, they’d make you their friend not mine, and I won’t let them.” “All right,” I said. “I’m perfectly content. But am I not going to be allowed to see any more of the house?” “It’s all shut up. We came to see nanny. On Queen Alexandra’s day it’s all open for a shilling. Well, come and look if you want to….” He led me through a baize door into a dark corridor; I could dimly see a gilt cornice and vaulted plaster above; then, opening a heavy, smooth- swinging, mahogany door, he led me into a darkened hall. Light streamed through the cracks in the shutters. Sebastian unbarred one, and folded it back; the mellow afternoon sun flooded in, over the bare floor, the vast, twin fireplaces of sculptured marble, the coved ceiling frescoed with classic deities and heroes, the gilt mirrors and scagliola pilasters, the islands of sheeted furniture. It was a glimpse only, such as might be had from the top of an omnibus into a lighted ballroom; then Sebastian quickly shut out the sun. “You see,” he said; “it’s like this.” His mood had changed since we had drunk our wine under the elm trees, since we had turned the corner of the drive and he had said: “Well?” “You see, there’s nothing to see. A few pretty things I’d like to show you one day—not now. But there’s the chapel. You must see that. It’s a monument of art nouveau .” The last architect to work at Brideshead had added a colonnade and flanking pavilions. One of these was the chapel. We entered it by the public porch (another door led direct to the house); Sebastian dipped his fingers in the water stoup, crossed himself, and genuflected; I copied him. “Why do you do that?” he asked crossly. “Just good manners.” “Well, you needn’t on my account. You wanted to do sight-seeing; how about this?” The whole interior had been gutted, elaborately refurnished and redecorated in the arts-and-crafts style of the last decade of the nineteenth century. Angels in printed cotton smocks, rambler-roses, flower-spangled meadows, frisking lambs, texts in Celtic script, saints in armor, covered thewalls in an intricate pattern of clear, bright colors. There was a triptych of pale oak, carved so as to give it the peculiar property of seeming to have been molded in Plasticine. The sanctuary lamp and all the metal furniture were of bronze, hand-beaten to the patina of a pock-marked skin; the altar steps had a carpet of grass-green, strewn with white and gold daisies. “Golly,” I said. “It was papa’s wedding present to mama. Now, if you’ve seen enough, we’ll go.” On the drive we passed a closed Rolls-Royce driven by a chauffeur; in the back was a vague, girlish figure who looked round at us through the window. “Julia,” said Sebastian. “We only just got away in time.” We stopped to speak to a man with a bicycle—“That was old Bat,” said Sebastian—and then were away, past the wrought-iron gates, past the lodges, and out on the road heading back to Oxford. “I’m sorry,” said Sebastian after a time. “I’m afraid I wasn’t very nice this afternoon. Brideshead often has that effect on me. But I had to take you to see nanny.” Why? I wondered; but said nothing—Sebastian’s life was governed by a code of such imperatives. “I must have pillar-box red pajamas,” “I have to stay in bed until the sun works round to the windows,” “I’ve absolutely got to drink champagne tonight!”—except, “It had quite the reverse effect on me.” After a long pause he said petulantly, “I don’t keep asking you questions about your family.” “Neither do I about yours.” “But you look inquisitive.” “Well, you’re so mysterious about them.” “I hoped I was mysterious about everything.” “Perhaps I am rather curious about people’s families—you see, it’s not a thing I know about. There is only my father and myself. An aunt kept an eye on me for a time but my father drove her abroad. My mother was killed in the war.” “Oh… how very unusual.” “She went to Serbia with the Red Cross. My father has been rather odd in the head ever since. He just lives alone in London with no friends and footles about collecting things.” Sebastian said, “You don’t know what you’ve been saved. There are lots of us. Look them up in Debrett.” His mood was lightening now. The further we drove from Brideshead, the more he seemed to cast off his uneasiness—the almost furtive restlessness and irritability that had possessed him. The sun was behind us as we drove, so thatwe seemed to be in pursuit of our own shadows. “It’s half past five. We’ll get to Godstow in time for dinner, drink at the Trout, leave Hardcastle’s motor-car, and walk back by the river. Wouldn’t that be best?” That is the full account of my first brief visit to Brideshead; could I have known then that it would one day be remembered with tears by a middle-aged captain of infantry?Two T owards the end of that summer term I received the last visit and Grand Remonstrance of my cousin Jasper. I was just free of the schools, having taken the last paper of History Previous on the afternoon before; Jasper’s subfusc suit and white tie proclaimed him still in the thick of it; he had, too, the exhausted but resentful air of one who fears he has failed to do himself full justice on the subject of Pindar’s Orphism. Duty alone had brought him to my rooms that afternoon at great inconvenience to himself and, as it happened, to me, who, when he caught me in the door, was on my way to make final arrangements about a dinner I was giving that evening. It was one of several parties designed to comfort Hardcastle—one of the tasks that had lately fallen to Sebastian and me since, by leaving his car out, we had got him into grave trouble with the proctors. Jasper would not sit down; this was to be no cozy chat; he stood with his back to the fireplace and, in his own phrase, talked to me ‘like an uncle.’ “… I’ve tried to get in touch with you several times in the last week or two. In fact, I have the impression you are avoiding me. If that is so, Charles, I can’t say I’m surprised. “You may think it none of my business, but I feel a sense of responsibility. You know as well as I do that since your—well, since the war, your father has not been really in touch with things—lives in his own world. I don’t want to sit back and see you making mistakes which a word in season might save you from. “I expected you to make mistakes your first year. We all do. I got in with some thoroughly objectionable O.S.C.U. men who ran a mission to hop- pickers during the long vac. But you, my dear Charles, whether you realize it or not, have gone straight, hook, line and sinker, into the very worst set in the University . You may think that, living in digs, I don’t know what goes on in college; but I hear things. In fact, I hear all too much. I find that I’ve become a figure of mockery on your account at the Dining Club. There’s that chap Sebastian Flyte you seem inseparable from. He may be all right, I don’t know. His brother Brideshead was a very sound fellow. But this friend of yours looks odd to me and he gets himself talked about. Of course, they’re an oddfamily. The Marchmains have lived apart since the war, you know. An extraordinary thing; everyone thought they were a devoted couple. Then he went off to France with his Yeomanry and just never came back. It was as if he’d been killed. She’s a Roman Catholic, so she can’t get a divorce—or won’t , I expect. You can do anything at Rome with money, and they’re enormously rich. Flyte may be all right, but Anthony Blanche —now there’s a man there’s absolutely no excuse for.” “I don’t particularly like him myself,” I said. “Well, he’s always hanging round here, and the stiffer element in college don’t like it. They can’t stand him at the House. He was in Mercury again last night. None of these people you go about with pull any weight in their own colleges, and that’s the real test. They think because they’ve got a lot of money to throw about, they can do anything. “And that’s another thing. I don’t know what allowance my uncle makes you, but I don’t mind betting you’re spending double. All this ,” he said, including in a wide sweep of his hand the evidence of profligacy about him. It was true; my room had cast its austere winter garments, and, by not very slow stages, assumed a richer wardrobe. “Is that paid for?” (the box of a hundred cabinet Partagas on the sideboard) “or those ?” (a dozen frivolous, new books on the table) “or those?” (a Lalique decanter and glasses) “or that peculiarly noisome object?” (a human skull lately purchased from the School of Medicine, which, resting in a bowl of roses, formed, at the moment, the chief decoration of my table. It bore the motto “Et in Arcadia ego” inscribed on its forehead). “Yes,” I said, glad to be clear of one charge. “I had to pay cash for the skull.” “You can’t be doing any work. Not that that matters, particularly if you’re making something of your career elsewhere—but are you? Have you spoken at the Union or at any of the clubs? Are you connected with any of the magazines? Are you even making a position in the O.U.D.S.? And your clothes !” continued my cousin. “When you came up I remember advising you to dress as you would in a country house. Your present get-up seems an unhappy compromise between the correct wear for a theatrical party at Maidenhead and a glee-singing competition in a garden suburb. “And drink—no one minds a man getting tight once or twice a term. In fact, he ought to, on certain occasions. But I hear you’re constantly seen drunk in the middle of the afternoon.” He paused, his duty discharged. Already the perplexities of the examination school were beginning to reassert themselves in his mind. “I’m sorry, Jasper,” I said. “I know it must be embarrassing for you, but Ihappen to like this bad set. I like getting drunk at luncheon, and though I haven’t yet spent quite double my allowance, I undoubtedly shall before the end of term. I usually have a glass of champagne about this time. Will you join me?” So my cousin Jasper despaired and, I learned later, wrote to his father on the subject of my excesses who, in his turn, wrote to my father, who took no action or particular thought in the matter, partly because he had disliked my uncle for nearly sixty years and partly because, as Jasper had said, he lived in his own world now, since my mother’s death. Thus, in broad outline, Jasper sketched the more prominent features of my first year; some detail may be added on the same scale. I had committed myself earlier to spend the Easter vacation with Collins and, though I would have broken my word without compunction, and left my former friend friendless, had Sebastian made a sign, no sign was made; accordingly Collins and I spent several economical and instructive weeks together in Ravenna. A bleak wind blew from the Adriatic among those mighty tombs. In a hotel bedroom designed for a warmer season, I wrote long letters to Sebastian and called daily at the post office for his answers. There were two, each from a different address, neither giving any plain news of himself, for he wrote in a style of remote fantasy—… “ Mummy and two attendant poets have three bad colds in the head, so I have come here. It is the feast of S. Nichodemus of Thyatira, who was martyred by having goatskin nailed to his pate, and is accordingly the patron of bald heads. Tell Collins, who I am sure will be bald before us. There are too many people here, but one, praise heaven! has an ear-trumpet, and that keeps me in good humor. And now I must try to catch a fish. It is too far to send it to you so I will keep the backbone…” —which left me fretful. Collins made notes for a little thesis pointing out the inferiority of the original mosaics to their photographs. Here was planted the seed of what became his life’s harvest. When, many years later, there appeared the first massive volume of his still unfinished work on Byzantine Art, I was touched to find among two pages of polite, preliminary acknowledgments of debt, my own name: “… to Charles Ryder, with the aid of whose all-seeing eyes I first saw the Mausoleum of Galla Placidia and San Vitale…” I sometimes wonder whether, had it not been for Sebastian, I might have trodden the same path as Collins round the cultural water-wheel. My father in his youth sat for All Souls and, in a year of hot competition, failed; other successes and honors came his way later, but that early failure impressed itself on him, and through him on me, so that I came up with an ill-considered sense that there lay the proper and natural goal of the life of reason. I, too,should doubtless have failed, but, having failed, I might perhaps have slipped into a less august academic life elsewhere. It is conceivable, but not, I believe, likely, for the hot spring of anarchy rose from depths where was no solid earth, and burst into the sunlight—a rainbow in its cooling vapors—with a power the rocks could not repress. In the event, that Easter vacation formed a short stretch of level road in the precipitous descent of which Jasper warned me. Descent or ascent? It seems to me that I grew younger daily with each adult habit that I acquired. I had lived a lonely childhood and a boyhood straitened by war and overshadowed by bereavement; to the hard bachelordom of English adolescence, the premature dignity and authority of the school system, I had added a sad and grim strain of my own. Now, that summer term with Sebastian, it seemed as though I was being given a brief spell of what I had never known, a happy childhood, and though its toys were silk shirts and liqueurs and cigars and its naughtiness high in the catalogue of grave sins, there was something of nursery freshness about us that fell little short of the joy of innocence. At the end of the term I took my first schools; it was necessary to pass, if I was to remain at Oxford, and pass I did, after a week in which I forbade Sebastian my rooms and sat up to a late hour, with iced black coffee and charcoal biscuits, cramming myself with the neglected texts. I remember no syllable of them now, but the other, more ancient lore which I acquired that term will be with me in one shape or another to my last hour. “I like this bad set and I like getting drunk at luncheon”; that was enough then. Is more needed now? Looking back, now, after twenty years, there is little I would have left undone or done otherwise. I could match my cousin Jasper’s game-cock maturity with a sturdier fowl. I could tell him that all the wickedness of that time was like the spirit they mix with the pure grape of the Douro, heady stuff full of dark ingredients; it at once enriched and retarded the whole process of adolescence as the spirit checks the fermentation of the wine, renders it undrinkable, so that it must lie in the dark, year in, year out, until it is brought up at last fit for the table. I could tell him, too, that to know and love one other human being is the root of all wisdom. But I felt no need for these sophistries as I sat before my cousin, saw him, freed from his inconclusive struggle with Pindar, in his dark gray suit, his white tie, his scholar’s gown; heard his grave tones and, all the time, savored the gillyflowers in full bloom under my windows. I had my secret and sure defense, like a talisman worn in the bosom, felt for in the moment of danger, found and firmly grasped. So I told him what was not in fact the truth, that I usually had a glass of champagne about that time, andasked him to join me. On the day after Jasper’s Grand Remonstrance I received another, in different terms and from an unexpected source. All the term I had been seeing rather more of Anthony Blanche than my liking for him warranted. I lived now among his friends, but our frequent meetings were more of his choosing than mine, for I held him in considerable awe. In years, he was barely my senior, but he seemed then to be burdened with the experience of the Wandering Jew. He was indeed a nomad of no nationality. An attempt had been made in his childhood to make an Englishman of him; he was two years at Eton; then in the middle of the war he had defied the submarines, rejoined his mother in the Argentine, and a clever and audacious school-boy was added to the valet, the maid, the two chauffeurs, the pekinese and the second husband. Criss-cross about the world he traveled with them, waxing in wickedness like a Hogarthian page boy. When peace came they returned to Europe, to hotels and furnished villas, spas, casinos and bathing beaches. At the age of fifteen, for a wager, he was disguised as a girl and taken to play at the big table in the Jockey Club at Buenos Aires; he dined with Proust and Gide and was on closer terms with Cocteau and Diaghilev; Firbank sent him his novels with fervent inscriptions; he had aroused three irreconcilable feuds in Capri; by his own account he had practiced black art in Cefalù and had been cured of drug-taking in California and of an Oedipus complex in Vienna. At times we all seemed children beside him—at most times, but not always, for there was a bluster and zest in Anthony which the rest of us had shed somewhere in our more leisured adolescence, on the playing field or in the school-room; his vices flourished less in the pursuit of pleasure than in the wish to shock, and in the midst of his polished exhibitions I was often reminded of an urchin I had once seen in Naples, capering derisively, with obscene, unambiguous gestures, before a party of English tourists; as he told the tale of his evening at the gaming table, one could see in the roll of his eye just how he had glanced, covertly, over the dwindling pile of chips at his step- father’s party; while we had been rolling one another in the mud at football and gorging ourselves with crumpets, Anthony had helped oil fading beauties on sub-tropical sands and had sipped his apéritif in smart little bars, so that the savage we had tamed was still rampant in him. He was cruel, too, in thewanton, insect-maiming manner of the very young, and fearless like a little boy, charging, head down, small fists whirling, at the school prefects. He asked me to dinner, and I was a little disconcerted to find that we were to dine alone. “We are going to Thame,” he said. “There is a delightful hotel there, which luckily doesn’t appeal to the Bullingdon. We will drink Rhine wine and imagine ourselves… where? Not on a j-j-jaunt with J-J-Jorrocks, anyway. But first we will have our apéritif.” At the George bar he ordered “Four Alexandra cocktails, please,” ranged them before him with a loud “Yum-yum” which drew every eye, outraged, upon him. “I expect you would prefer sherry, but, my dear Charles, you are not going to have sherry. Isn’t this a delicious concoction? You don’t like it? Then I will drink it for you. One, two, three, four, down the red lane they go. How the students stare!” And he led me out to the waiting motor-car. “I hope we shall find no undergraduates there. I am a little out of sympathy with them for the moment. You heard about their treatment of me on Thursday? It was too naughty. Luckily I was wearing my oldest pajamas and it was an evening of oppressive heat, or I might have been seriously cross.” Anthony had a habit of putting his face near one when he spoke; the sweet and creamy cocktail had tainted his breath. I leaned away from him in the corner of the hired car. “Picture me, my dear, alone and studious. I had just bought a rather forbidding book called Antic Hay, which I knew I must read before going to Garsington on Sunday, because everyone was bound to talk about it, and it’s so banal saying you have not read the book of the moment, if you haven’t. The solution I suppose is not to go to Garsington, but that didn’t occur to me until this moment. So , my dear, I had an omelet and a peach and a bottle of Vichy water and put on my pajamas and settled down to read. I must say my thoughts wandered, but I kept turning the pages and watching the light fade, which in Peckwater, my dear, is quite an experience—as darkness falls the stone seems positively to decay under one’s eyes. I was reminded of some of those leprous façades in the vieux port at Marseille, until suddenly I was disturbed by such a bawling and caterwauling as you never heard, and there, down in the little piazza, I saw a mob of about twenty terrible young men, and do you know what they were chanting? ‘We want Blanche. We want Blanche,’ in a kind of litany. Such a public declaration! Well, I saw it was all up with Mr. Huxley for the evening, and I must say I had reached a point of tedium when any interruption was welcome. I was stirred by the bellows, but, do you know, the louder they shouted, the shyer they seemed? They kept saying ‘Where’s Boy?’ ‘He’s Boy Mulcaster’s friend,’ ‘Boy must bring him down.’ Of course you’ve met Boy? He’s always popping in and out of dearSebastian’s rooms. He’s everything we dagos expect of an English lord. A great parti I can assure you. All the young ladies in London are after him. He’s very hoity-toity with them, I’m told. My dear, he’s scared stiff. A great oaf—that’s Mulcaster—and what’s more, my dear, a cad . He came to Le Touquet at Easter and, in some extraordinary way, I seemed to have asked him to stay. He lost some infinitesimal sum at cards, and as a result expected me to pay for all his treats—well, Mulcaster was in this party; I could see his ungainly form shuffling about below and hear him saying: ‘It’s no good. He’s out. Let’s go back and have a drink?’ So then I put my head out of the window and called to him: ‘Good evening, Mulcaster, old sponge and toady, are you lurking among the hobbledehoys? Have you came to repay me the three hundred francs I lent you for the poor drab you picked up in the Casino? It was a niggardly sum for her trouble, and what a trouble, Mulcaster. Come up and pay me, poor hooligan!’ “That, my dear, seemed to put a little life into them, and up the stairs they came, clattering. About six of them came into my room, the rest stood mouthing outside. My dear, they looked too extraordinary. They had been having one of their ridiculous club dinners, and they were all wearing colored tail-coats—a sort of livery. ‘My dears,’ I said to them, ‘you look like a lot of most disorderly footmen.’ Then one of them, rather a juicy little piece, accused me of unnatural vices. ‘My dear,’ I said, ‘I may be inverted but I am not insatiable. Come back when you are alone .’ Then they began to blaspheme in a very shocking manner, and suddenly I, too, began to be annoyed. ‘Really,’ I thought, ‘when I think of all the hullabaloo there was when I was seventeen, and the Duc de Vincennes (old Armand, of course, not Philippe) challenged me to a duel for an affair of the heart, and very much more than the heart, I assure you, with the duchess (Stefanie, of course, not old Poppy)—now, to submit to impertinence from these pimply, tipsy virgins… ’ Well, I gave up the light, bantering tone and let myself be just a little offensive. “Then they began saying, ‘Get hold of him. Put him in Mercury.’ Now as you know I have two sculptures by Brancusi and several pretty things and I did not want them to start getting rough, so I said, pacifically, ‘Dear sweet clodhoppers, if you knew anything of sexual psychology you would know that nothing could give me keener pleasure than to be manhandled by you meaty boys. It would be an ecstasy of the very naughtiest kind. So if any of you wishes to be my partner in joy come and seize me. If, on the other hand, you simply wish to satisfy some obscure and less easily classified libido and see me bathe, come with me quietly, dear louts, to the fountain.’ “Do you know, they all looked a little foolish at that? I walked down withthem and no one came within a yard of me. Then I got into the fountain and, you know, it was really most refreshing, so I sported there a little and struck some attitudes, until they turned about and walked sulkily home, and I heard Boy Mulcaster saying, ‘Anyway, we did put him in Mercury.’ You know, Charles, that is just what they’ll be saying in thirty years’ time. When they’re all married to scraggy little women like hens and have cretinous porcine sons like themselves getting drunk at the same club dinner in the same colored coats, they’ll still say, when my name is mentioned, ‘We put him in Mercury one night,’ and their barnyard daughters will snigger and think their father was quite a dog in his day, and what a pity he’s grown so dull. Oh, la fatigue du Nord!” It was not, I knew, the first time Anthony had been ducked, but the incident seemed much on his mind, for he reverted to it again at dinner. “Now you can’t imagine an unpleasantness like that happening to Sebastian, can you?” “No,” I said; I could",
      "density_breakdown": {
        "Metaphor": 2.8720626631853783,
        "Simile": 1.9582245430809397,
        "Imagery": 12.402088772845952,
        "Symbolism": 7.5718015665796345,
        "Dialogue": 0.0,
        "Foreshadowing": 3.655352480417754,
        "Juxtaposition": 9.530026109660575,
        "Repetition": 5.744125326370757,
        "TOTAL_DENSITY": 43.73368146214099
      }
    },
    "rising_action": {
      "chapter_range": "3-10",
      "narrative_primary": 7,
      "optimized_primary": 6,
      "device_density_score": 46.21409921671018,
      "improvement_percent": 9.583215449158907,
      "optimization_applied": true,
      "chapter_text": "go to prison. If I just slip away abroad they can’t get me back, can they? That’s what people do when the police are after them. I know mummy will make it seem she has to bear the whole brunt of the business.” “Let’s telephone Julia and get her to meet us somewhere and talk it over.” We met at Gunter’s in Berkeley Square. Julia, like most women then, wore a green hat pulled down to her eyes with a diamond arrow in it; she had a small dog under her arm, three-quarters buried in the fur of her coat. She greeted us with an unusual show of interest. “Well, you are a pair of pickles; I must say you look remarkably well on it. The only time I got tight I was paralyzed all the next day. I do think you might have taken me with you. The ball was positively lethal, and I’ve always longed to go to the Old Hundredth. No one will ever take me. Is it heaven?” “So you know all about that, too?”“Rex telephoned me this morning and told me everything. What were your girl friends like?” “Don’t be prurient,” said Sebastian. “Mine was like a skull.” “Mine was like a consumptive.” “Goodness.” It had clearly raised us in Julia’s estimation that we had been out with women; to her they were the point of interest. “Does mummy know?” “Not about your skulls and consumptives. She knows you were in the clink. I told her. She was divine about it, of course. You know anything Uncle Ned did was always perfect, and he got locked up once for taking a bear into one of Lloyd George’s meetings, so she really feels quite human about the whole thing. She wants you both to lunch with her.” “Oh God!” “The only trouble is the papers and the family. Have you got an awful family, Charles?” “Only a father. He’ll never hear about it.” “Ours are awful. Poor mummy is in for a ghastly time with them. They’ll be writing letters and paying visits of sympathy, and all the time at the back of their minds one half will be saying, ‘That’s what comes of bringing the boy up a Catholic,’ and the other half will say, ‘That’s what comes of sending him to Eton instead of Stonyhurst.’ Poor mummy can’t get it right.” We lunched with Lady Marchmain. She accepted the whole thing with humorous resignation. Her only reproach was: “I can’t think why you went off and stayed with Mr. Mottram. You might have come and told me about it first.” “How am I going to explain it to all the family?” she asked. “They will be so shocked to find that they’re more upset about it than I am. Do you know my sister-in-law, Fanny Rosscommon? She has always thought I brought the children up badly. Now I am beginning to think she must be right.” When we left I said: “She couldn’t have been more charming. What were you so worried about?” “I can’t explain,” said Sebastian miserably. A week later when Sebastian came up for trial he was fined ten pounds. The newspapers reported it with painful prominence, one of them under the ironic headline: “ Marquis’s son unused to wine .” The magistrate said that it was only through the prompt action of the police that he was not up on a gravecharge… “It is purely by good fortune that you do not bear the responsibility of a serious accident…” Mr. Samgrass gave evidence that Sebastian bore an irreproachable character and that a brilliant future at the University was in jeopardy. The papers took hold of this too—“ Model Student’s Career at Stake .” But for Mr. Samgrass’s evidence, said the magistrate, he would have been disposed to give an exemplary sentence; the law was the same for an Oxford undergraduate as for any young hooligan; indeed the better the home the more shameful the offence… It was not only at Bow Street that Mr. Samgrass was of value. At Oxford he showed all the zeal and acumen which were Rex Mottram’s in London. He interviewed the college authorities, the proctors, the Vice-Chancellor; he induced Mgr. Bell to call on the Dean of Christ Church; he arranged for Lady Marchmain to talk to the Chancellor himself; and, as a result of all this, the three of us were gated for the rest of the term. Hardcastle, for no very clear reason, was again deprived of the use of his car, and the affair blew over. The most lasting penalty we suffered was our intimacy with Rex Mottram and Mr. Samgrass, but since Rex’s life was in London in a world of politics and high finance and Mr. Samgrass’s nearer to our own at Oxford, it was from him we suffered the more. For the rest of that term he haunted us. Now that we were “gated” we could not spend our evenings together, and from nine o’clock onwards were alone and at Mr. Samgrass’s mercy. Hardly an evening seemed to pass but he called on one or the other of us. He spoke of “our little escapade” as though he, too, had been in the cells, and had that bond with us…. Once I climbed out of college and Mr. Samgrass found me in Sebastian’s rooms after the gate was shut and that, too, he made into a bond. It did not surprise me, therefore, when I arrived at Brideshead, after Christmas, to find Mr. Samgrass, as though in wait for me, sitting alone before the fire in the room they called the “Tapestry Hall.” “You find me in solitary possession,” he said, and indeed he seemed to possess the hall and the somber scenes of venery that hung round it, to possess the caryatids on either side of the fireplace, to possess me, as he rose to take my hand and greet me like a host: “This morning,” he continued, “we had a lawn meet of the Marchmain Hounds—a deliciously archaic spectacle —and all our young friends are fox-hunting, even Sebastian who, you will not be surprised to hear, looked remarkably elegant in his pink coat. Brideshead was impressive rather than elegant; he is Joint-Master with a local figure of fun named Sir Walter Strickland-Venables. I wish the two of them could be included in these rather humdrum tapestries—they would give a note of fantasy.“Our hostess remained at home; also a convalescent Dominican who has read too much Maritain and too little Hegel; Sir Adrian Porson, of course, and two rather forbidding Magyar cousins—I have tried them in German and in French, but in neither tongue are they diverting. All these have now driven off to visit a neighbor. I have been spending a cozy afternoon before the fire with the incomparable Charlus. Your arrival emboldens me to ring for some tea. How can I prepare you for the party? Alas, it breaks up tomorrow. Lady Julia departs to celebrate the New Year elsewhere, and takes the beau-monde with her. I shall miss the pretty creatures about the house—particularly one Celia; she is the sister of our old companion in adversity, Boy Mulcaster, and wonderfully unlike him. She has a bird-like style of conversation, pecking away at the subject in a way I find most engaging, and a school-monitor style of dress which I can only call ‘saucy.’ I shall miss her, for I do not go tomorrow. Tomorrow I start work in earnest on our hostess’s book—which, believe me, is a treasure-house of period gems; pure authentic 1914.” Tea was brought and, soon after it, Sebastian returned; he had lost the hunt early, he said, and hacked home; the others were not long after him, having been fetched by car at the end of the day; Brideshead was absent; he had business at the kennels and Cordelia had gone with him. The rest filled the hall and were soon eating scrambled eggs and crumpets; and Mr. Samgrass, who had lunched at home and dozed all the afternoon before the fire, ate eggs and crumpets with them. Presently Lady Marchmain’s party returned, and when, before we went upstairs to dress for dinner, she said “Who’s coming to chapel for the Rosary?” and Sebastian and Julia said they must have their baths at once, Mr. Samgrass went with her and the friar. “I wish Mr. Samgrass would go,” said Sebastian, in his bath; “I’m sick of being grateful to him.” In the course of the next fortnight distaste for Mr. Samgrass came to be a little unspoken secret throughout the house; in his presence Sir Adrian Porson’s fine old eyes seemed to search a distant horizon and his lips set in classic pessimism. Only the Hungarian cousins who, mistaking the status of tutor, took him for an unusually privileged upper servant, were unaffected by his presence. Mr. Samgrass, Sir Adrian Porson, the Hungarians, the friar, Brideshead, Sebastian, Cordelia were all who remained of the Christmas party. Religion predominated in the house; not only in its practices—the daily mass and Rosary, morning and evening in the chapel—but in all itsintercourse. “We must make a Catholic of Charles,” Lady Marchmain said, and we had many little talks together during my visits when she delicately steered the subject into a holy quarter. After the first of these Sebastian said: “Has mummy been having one of her ‘little talks’ with you? She’s always doing it. I wish to hell she wouldn’t.” One was never summoned for a little talk, or consciously led to it; it merely happened, when she wished to speak intimately, that one found oneself alone with her, if it was summer, in a secluded walk by the lakes or in a corner of the walled rose-gardens; if it was winter, in her sitting-room on the first floor. This room was all her own; she had taken it for herself and changed it so that, entering, one seemed to be in another house. She had lowered the ceiling and the elaborate cornice which, in one form or another, graced every room was lost to view; the walls, one paneled in brocade, were stripped and washed blue and spotted with innumerable little water-colors of fond association; the air was sweet with the fresh scent of flowers and musty potpourri; her library in soft leather covers, well-read works of poetry and piety, filled a small rosewood bookcase; the chimneypiece was covered with small personal treasures—an ivory Madonna, a plaster St. Joseph, posthumous miniatures of her three soldier brothers. When Sebastian and I lived alone at Brideshead during that brilliant August we had kept out of his mother’s room. Scraps of conversation come back to me with the memory of her room. I remember her saying: “When I was a girl we were comparatively poor, but still much richer than most of the world, and when I married I became very rich. It used to worry me, and I thought it wrong to have so many beautiful things when others had nothing. Now I realize that it is possible for the rich to sin by coveting the privileges of the poor. The poor have always been the favorites of God and his saints, but I believe that it is one of the special achievements of Grace to sanctify the whole of life, riches included. Wealth in pagan Rome was necessarily something cruel; it’s not anymore.” I said something about a camel and the eye of a needle and she rose happily to the point. “But of course ,” she said, “it’s very unexpected for a camel to go through the eye of a needle, but the gospel is simply a catalogue of unexpected things. It’s not to be expected that an ox and an ass should worship at the crib. Animals are always doing the oddest things in the lives of the saints. It’s all part of the poetry, the Alice-in-Wonderland side, of religion.” But I was as untouched by her faith as I was by her charm: or, rather, I was touched by both alike. I had no mind then for anything except Sebastian, and I saw him already as being threatened, though I did not yet know how blackwas the threat. His constant, despairing prayer was to be let alone. By the blue waters and rustling palms of his own mind he was happy and harmless as a Polynesian; only when the big ship dropped anchor beyond the coral reef, and the cutter beached in the lagoon, and, up the slope that had never known the print of a boot, there trod the grim invasion of trader, administrator, missionary, and tourist—only then was it time to disinter the archaic weapons of the tribe and sound the drums in the hills; or, more easily, to turn from the sunlit door and lie alone in the darkness, where the impotent, painted deities paraded the walls in vain, and cough his heart out among the rum bottles. And since Sebastian counted among the intruders his own conscience and all claims of human affection, his days in Arcadia were numbered. For in this, to me, tranquil time Sebastian took fright. I knew him well in that mood of alertness and suspicion, like a deer suddenly lifting his head at the far notes of the hunt; I had seen him grow wary at the thought of his family or his religion, now I found I, too, was suspect. He did not fail in love, but he lost his joy of it, for I was no longer part of his solitude. As my intimacy with his family grew, I became part of the world which he sought to escape; I became one of the bonds which held him. That was the part for which his mother, in all our little talks, was seeking to fit me. Everything was left unsaid. It was only dimly and at rare moments that I suspected what was afoot. Outwardly Mr. Samgrass was the only enemy. For a fortnight Sebastian and I remained at Brideshead, leading our own life. His brother was engaged in sport and estate management; Mr. Samgrass was at work in the library on Lady Marchmain’s book; Sir Adrian Porson demanded most of Lady Marchmain’s time. We saw little of them except in the evenings; there was room under that wide roof for a wide variety of independent lives. After a fortnight Sebastian said: “I can’t stand Mr. Samgrass anymore. Let’s go to London,” so he came to stay with me and now began to use my home in preference to “Marchers.” My father liked him. “I think your friend very amusing,” he said. “Ask him often .” Then, back at Oxford, we took up again the life that seemed to be shrinking in the cold air. The sadness that had been strong in Sebastian the term before gave place to a kind of sullenness even towards me. He was sick at heart somewhere, I did not know how, and I grieved for him, unable to help. When he was gay now it was usually because he was drunk, and when drunk he developed an obsession of “mocking Mr. Samgrass.” He composed a ditty of which the refrain was, “Green arse, Samgrass—Samgrass green arse,”sung to the tune of St. Mary’s chime, and he would thus serenade him, perhaps once a week, under his windows. Mr. Samgrass was distinguished as being the first don to have a private telephone installed in his rooms. Sebastian in his cups used to ring him up and sing him this simple song. And all this Mr. Samgrass took in good part, as it is called, smiling obsequiously when we met, but with growing confidence, as though each outrage in some way strengthened his hold on Sebastian. It was during this term that I began to realize that Sebastian was a drunkard in quite a different sense to myself. I got drunk often, but through an excess of high spirits, in the love of the moment, and the wish to prolong and enhance it; Sebastian drank to escape. As we together grew older and more serious I drank less, he more. I found that sometimes after I had gone back to my college, he sat up late and alone, soaking. A succession of disasters came on him so swiftly and with such unexpected violence that it is hard to say when exactly I recognized that my friend was in deep trouble. I knew it well enough in the Easter vacation. Julia used to say, “Poor Sebastian. It’s something chemical in him.” That was the cant phrase of the time, derived from heaven knows what misconception of popular science. “There’s something chemical between them” was used to explain the over-mastering hate or love of any two people. It was the old concept of determinism in a new form. I do not believe there was anything chemical in my friend. The Easter party at Brideshead was a bitter time, culminating in a small but unforgettably painful incident. Sebastian got very drunk before dinner in his mother’s house, and thus marked the beginning of a new epoch in his melancholy record, another stride in the flight from his family which brought him to ruin. It was at the end of the day when the large Easter party left Brideshead. It was called the Easter party, though in fact it began on the Tuesday of Easter Week, for the Flytes all went into retreat at the guest-house of a monastery from Maundy Thursday until Easter. This year Sebastian had said he would not go, but at the last moment had yielded, and came home in a state of acute depression from which I totally failed to raise him. He had been drinking very hard for a week—only I knew how hard—and drinking in a nervous, surreptitious way, totally unlike his old habit. During the party there was always a grog tray in the library, and Sebastian took to slipping in there at odd moments during the day without saying anything even to me. The house was largely deserted during the day. I was at work painting another panel in the little garden-room in the colonnade. Sebastian complained of a cold, stayed in, and during all that time was never quitesober; he escaped attention by being silent. Now and then I noticed him attract curious glances, but most of the party knew him too slightly to see the change in him, while his own family were occupied, each with their particular guests. When I remonstrated he said, “I can’t stand all these people about,” but it was when they finally left and he had to face his family at close quarters that he broke down. The normal practice was for a cocktail tray to be brought into the drawing- room at six; we mixed our own drinks and the bottles were removed when we went to dress; later, just before dinner, cocktails appeared again, this time handed round by the footmen. Sebastian disappeared after tea; the light had gone and I spent the next hour playing mah-jongg with Cordelia. At six I was alone in the drawing- room, when he returned; he was frowning in a way I knew all too well, and when he spoke I recognized the drunken thickening in his voice. “Haven’t they brought the cocktails yet?” He pulled clumsily on the bell- rope. I said, “Where have you been?” “Up with nanny.” “I don’t believe it. You’ve been drinking somewhere.” “I’ve been reading in my room. My cold’s worse today.” When the tray arrived he slopped gin and vermouth into a tumbler and carried it out of the room with him. I followed him upstairs, where he shut his bedroom door in my face and turned the key. I returned to the drawing-room full of dismay and foreboding. The family assembled. Lady Marchmain said: “What’s become of Sebastian?” “He’s gone to lie down. His cold is worse.” “Oh dear, I hope he isn’t getting ’flu. I thought he had a feverish look once or twice lately. Is there anything he wants?” “No, he particularly asked not to be disturbed.” I wondered whether I ought to speak to Brideshead, but that grim, rock- crystal mask forbade all confidence. Instead, on the way upstairs to dress, I told Julia. “Sebastian’s drunk.” “He can’t be. He didn’t even come for a cocktail.” “He’s been drinking in his room all the afternoon.” “How very peculiar! What a bore he is! Will he be all right for dinner?” “No.” “Well, you must deal with him. It’s no business of mine. Does he often dothis?” “He has lately.” “How very boring.” I tried Sebastian’s door, found it locked, and hoped he was sleeping, but, when I came back from my bath, I found him sitting in the chair before my fire; he was dressed for dinner, all but his shoes, but his tie was awry and his hair on end; he was very red in the face and squinting slightly. He spoke indistinctly. “Charles, what you said was quite true. Not with nanny. Been drinking whisky up here. None in the library now party’s gone. Now party’s gone and only mummy. Feeling rather drunk. Think I’d better have something-on-a-tray up here. Not dinner with mummy.” “Go to bed,” I told him. “I’ll say your cold’s worse.” “Much worse.” I took him to his room which was next to mine and tried to get him to bed, but he sat in front of his dressing table squinnying at himself in the glass, trying to remake his bow-tie. On the writing table by the fire was a half-empty decanter of whisky. I took it up, thinking he would not see, but he spun round from the mirror and said: “You put that down.” “Don’t be an ass, Sebastian. You’ve had enough.” “What the devil’s it got to do with you? You’re only a guest here— my guest. I drink what I want to in my own house.” He would have fought me for it at that moment. “Very well,” I said, putting the decanter back, “only for God’s sake keep out of sight.” “Oh, mind your own business. You came here as my friend; now you’re spying on me for my mother, I know. Well, you can get out, and tell her from me that I’ll choose my friends and she her spies in future.” So I left him and went down to dinner. “I’ve been in to Sebastian,” I said. “His cold has come on rather badly. He’s gone to bed and says he doesn’t want anything.” “Poor Sebastian,” said Lady Marchmain. “He’d better have a glass of hot whisky. I’ll go and have a look at him.” “Don’t mummy, I’ll go,” said Julia rising. “ I’ll go,” said Cordelia, who was dining down that night, for a treat to celebrate the departure of the guests. She was at the door and through it before anyone could stop her. Julia caught my eye and gave a tiny, sad shrug. In a few minutes Cordelia was back, looking grave. “No, he doesn’t seem to want anything,” she said.“How was he?” “Well, I don’t know , but I think he’s very drunk,” she said. “Cordelia.” Suddenly the child began to giggle. “ ‘Marquis’s Son Unused to Wine,’ ” she quoted. “ ‘Model Student’s Career Threatened.’ ” “Charles, is this true?” asked Lady Marchmain. “Yes.” Then dinner was announced, and we went to the dining-room where the subject was not mentioned. When Brideshead and I were left alone he said: “Did you say Sebastian was drunk?” “Yes.” “Extraordinary time to choose. Couldn’t you stop him?” “No.” “No,” said Brideshead, “I don’t suppose you could. I once saw my father drunk, in this room. I wasn’t more than about ten at the time. You can’t stop people if they want to get drunk. My mother couldn’t stop my father, you know.” He spoke in his odd, impersonal way. The more I saw of this family, I reflected, the more singular I found them. “I shall ask my mother to read to us tonight.” It was the custom, I learned later, always to ask Lady Marchmain to read aloud on evenings of family tension. She had a beautiful voice and great humor of expression. That night she read part of The Wisdom of Father Brown . Julia sat with a stool covered with manicure things and carefully revarnished her nails; Cordelia nursed Julia’s pekinese; Brideshead played patience; I sat unoccupied studying the pretty group they made, and mourning my friend upstairs. But the horrors of that evening were not yet over. It was sometimes Lady Marchmain’s practice, when the family were alone, to visit the chapel before going to bed. She had just closed her book and proposed going there when the door opened and Sebastian appeared. He was dressed as I had last seen him, but now instead of being flushed he was deathly pale. “Come to apologize,” he said. “Sebastian, dear, do go back to your room,” said Lady Marchmain. “We can talk about it in the morning.” “Not to you. Come to apologize to Charles. I was bloody to him and he’s my guest. He’s my guest and my only friend and I was bloody to him.” A chill spread over us. I led him back to his room; his family went to theirprayers. I noticed when we got upstairs that the decanter was now empty. “It’s time you were in bed,” I said. Sebastian began to weep. “Why do you take their side against me? I knew you would if I let you meet them. Why do you spy on me?” He said more than I can bear to remember, even at twenty years’ distance. At last I got him to sleep and very sadly went to bed myself. Next morning, he came to my room very early, while the house still slept; he drew the curtains and the sound of it woke me, to find him there fully dressed, smoking, with his back to me, looking out of the windows to where the long dawn-shadows lay across the dew and the first birds were chattering in the budding tree-tops. When I spoke he turned a face which showed no ravages of the evening before, but was fresh and sullen as a disappointed child’s. “Well,” I said. “How do you feel?” “Rather odd. I think perhaps I’m still a little drunk. I’ve just been down to the stables trying to get a car but everything was locked. We’re off.” He drank from the water-bottle by my pillow, threw his cigarette from the window, and lit another with hands which trembled like an old man’s. “Where are you going?” “I don’t know. London, I suppose. Can I come and stay with you?” “Of course.” “Well, get dressed. They can send our luggage on by train.” “We can’t just go like this.” “We can’t stay.” He sat on the window seat looking away from me, out of the window. Presently he said: “There’s smoke coming from some of the chimneys. They must have opened the stables now. Come on.” “I can’t go,” I said. “I must say good-bye to your mother.” “Sweet bulldog.” “Well, I don’t happen to like running away.” “And I couldn’t care less. And I shall go on running away, as far and as fast as I can. You can hatch up any plot you like with my mother; I shan’t come back.” “That’s how you talked last night.” “I know. I’m sorry, Charles. I told you I was still drunk. If it’s any comfort to you, I absolutely detest myself.” “It’s no comfort at all.” “It must be a little, I should have thought. Well, if you won’t come, give my love to nanny.” “You’re really going?”“Of course.” “Shall I see you in London?” “Yes, I’m coming to stay with you.” He left me but I did not sleep again; nearly two hours later a footman came with tea and bread and butter and set my clothes out for a new day. Later that morning I sought Lady Marchmain; the wind had freshened and we stayed indoors; I sat near her before the fire in her room, while she bent over her needlework and the budding creeper rattled on the window panes. “I wish I had not seen him,” she said. “That was cruel. I do not mind the idea of his being drunk. It is a thing all men do when they are young. I am used to the idea of it. My brothers were wild at his age. What hurt last night was that there was nothing happy about him.” “I know,” I said. “I’ve never seen him like that before.” “And last night of all nights… when everyone had gone and there were only ourselves here—you see, Charles, I look on you very much as one of ourselves. Sebastian loves you—when there was no need for him to make an effort to be gay. And he wasn’t gay. I slept very little last night, and all the time I kept coming back to that one thing; he was so unhappy.” It was impossible for me to explain to her what I only half understood myself; even then I felt, “She will learn it soon enough. Perhaps she knows it now.” “It was horrible,” I said. “But please don’t think that’s his usual way.” “Mr. Samgrass told me he was drinking too much all last term.” “Yes, but not like that—never before.” “Then why now? here? with us? All night I have been thinking and praying and wondering what I was to say to him, and now, this morning, he isn’t here at all. That was cruel of him, leaving without a word. I don’t want him to be ashamed—it’s being ashamed that makes it all so wrong of him.” “He’s ashamed of being unhappy,” I said. “Mr. Samgrass says he is noisy and high-spirited. I believe,” she said, with a faint light of humor streaking the clouds, “I believe you and he tease Mr. Samgrass rather. It’s naughty of you. I’m very fond of Mr. Samgrass, and you should be too, after all he’s done for you. But I think perhaps if I were your age and a man, I might be just a little inclined to tease Mr. Samgrass myself. No, I don’t mind that, but last night and this morning are something quite different. You see, it’s all happened before .” “I can only say I’ve seen him drunk often and I’ve been drunk with himoften, but last night was quite new to me.” “Oh, I don’t mean with Sebastian. I mean years ago. I’ve been through it all before with someone else whom I loved. Well, you must know what I mean—with his father. He used to be drunk in just that way. Someone told me he is not like that now. I pray God it’s true and thank God for it with all my heart, if it is. But the running away—he ran away, too, you know. It was as you said just now, he was ashamed of being unhappy. Both of them unhappy, ashamed and running away. It’s too pitiful. The men I grew up with”—and her great eyes moved from the embroidery to the three miniatures in the folding leather case on the chimneypiece—“were not like that. I simply don’t understand it. Do you, Charles?” “Only very little.” “And yet Sebastian is fonder of you than of any of us, you know. You’ve got to help him. I can’t.” I have here compressed into a few sentences what, there, required many. Lady Marchmain was not diffuse, but she took hold of her subject in a feminine, flirtatious way, circling, approaching, retreating, feinting; she hovered over it like a butterfly; she played “grandmother’s steps” with it, getting nearer the real point imperceptibly while one’s back was turned, standing rooted when she was observed. The unhappiness, the running away —these made up her sorrow, and in her own way she exposed the whole of it, before she was done. It was an hour before she had said all she meant to say. Then, as I rose to leave her, she added as though in an afterthought: “I wonder have you seen my brothers’ book? It has just come out.” I told her I had looked through it in Sebastian’s rooms. “I should like you to have a copy. May I give you one? They were three splendid men; Ned was the best of them. He was the last to be killed, and when the telegram came, as I knew it would come, I thought: “Now it’s my son’s turn to do what Ned can never do now.” I was alone then. He was just going to Eton. If you read Ned’s book you’ll understand.” She had a copy lying ready on her bureau. I thought at the time, “She planned this parting before ever I came in. Had she rehearsed all the interview? If things had gone differently would she have put the book back in the drawer?” She wrote her name and mine on the fly leaf, the date and place. “I prayed for you, too, in the night,” she said. I closed the door behind me, shutting out the bondieuserie , the low ceiling, the chintz, the lambskin bindings, the views of Florence, the bowls of hyacinth and potpourri, the petit-point , the intimate feminine, modern world and was back under the coved and coffered roof, the columns and entablatureof the central hall, in the august, masculine atmosphere of a better age. I was no fool; I was old enough to know that an attempt had been made to suborn me and young enough to have found the experience agreeable. I did not see Julia that morning, but just as I was leaving Cordelia ran to the door of the car and said: “Will you be seeing Sebastian? Please give him my special love. Will you remember—my special love?” In the train to London I read the book Lady Marchmain had given me. The frontispiece reproduced the photograph of a young man in Grenadier uniform, and I saw plainly revealed there the origin of that grim mask which, in Brideshead, overlaid the gracious features of his father’s family; this was a man of the woods and caves, a hunter, a judge of the tribal council, the repository of the harsh traditions of a people at war with their environment. There were other illustrations in the book, snapshots of the three brothers on holiday, and in each I traced the same archaic lines; and remembering Lady Marchmain, starry and delicate, I could find no likeness to her in these somber men. She appeared seldom in the book; she was older than the eldest of them by nine years and had married and left home while they were schoolboys; between her and them stood two other sisters; after the birth of the third daughter there had been pilgrimages and pious benefactions in request for a son, for theirs was a wide property and an ancient name; male heirs had come late and, when they came, in a profusion which at the time seemed to promise continuity to the line which, in the tragic event, ended abruptly with them. The family history was typical of the Catholic squires of England; from Elizabeth’s reign till Victoria’s they lived sequestered lives, among their tenantry and kinsmen, sending their sons to school abroad, often marrying there, inter-marrying, if not, with a score of families like themselves, debarred from all preferment, and learning, in those lost generations, lessons which could still be read in the lives of the last three men of the house. Mr. Samgrass’s deft editorship had assembled and arranged a curiously homogeneous little body of writing—poetry, letters, scraps of a journal, an unpublished essay or two, which all exhaled the same high-spirited, serious, chivalrous, other-worldly air and the letters from their contemporaries, written after their deaths, all in varying degrees of articulateness, told the same tale of men who were, in all the full flood of academic and athletic success, of popularity and the promise of great rewards ahead, seen somehow as set apart from their fellows, garlanded victims, devoted to the sacrifice. These menmust die to make a world for Hooper; they were the aborigines, vermin by right of law, to be shot off at leisure so that things might be safe for the traveling salesman, with his polygonal pince-nez, his fat wet hand-shake, his grinning dentures. I wondered, as the train carried me farther and farther from Lady Marchmain, whether perhaps there was not on her, too, the same blaze, marking her and hers for destruction by other ways than war. Did she see a sign in the red center of her cozy grate and hear it in the rattle of creeper on the window-pane, this whisper of doom? Then I reached Paddington and, returning home, found Sebastian there, and the sense of tragedy vanished, for he was gay and free as when I first met him. “Cordelia sent you her special love.” “Did you have a ‘little talk’ with mummy?” “Yes.” “Have you gone over to her side?” The day before I would have said: “There aren’t two sides”; that day I said, “No, I’m with you, ‘Sebastian contra mundum .’ ” And that was all the conversation we had on the subject, then or ever. But the shadows were closing round Sebastian. We returned to Oxford and once again the gillyflowers bloomed under my windows and the chestnut lit the streets and the warm stones strewed their flakes upon the cobble; but it was not as it had been; there was mid-winter in Sebastian’s heart. The weeks went by; we looked for lodgings for the coming term and found them in Merton Street, a secluded, expensive little house near the tennis court. Meeting Mr. Samgrass, whom we had seen less often of late, I told him of our choice. He was standing at the table in Blackwell’s where recent German books were displayed, setting aside a little heap of purchases. “You’re sharing digs with Sebastian?” he said. “So he is coming up next term?” “I suppose so. Why shouldn’t he be?” “I don’t know why; I somehow thought perhaps he wasn’t. I’m always wrong about things like that. I like Merton Street.” He showed me the books he was buying, which, since I knew no German, were not of interest to me. As I left him he said: “Don’t think me interfering, you know, but I shouldn’t make any definite arrangement in Merton Street until you’re sure.” I told Sebastian of this conversation and he said: “Yes, there’s a plot on.Mummy wants me to go and live with Mgr. Bell.” “Why didn’t you tell me about it?” “Because I’m not going to live with Mgr. Bell.” “I still think you might have told me. When did it start?” “Oh, it’s been going on. Mummy’s very clever, you know. She saw she’d failed with you. I expect it was the letter you wrote after reading Uncle Ned’s book.” “I hardly said anything.” “That was it. If you were going to be any help to her, you would have said a lot. Uncle Ned is the test, you know.” But it seemed she had not quite despaired, for a few days later I got a note from her which said: “I shall be passing through Oxford on Tuesday and hope to see you and Sebastian. I would like to see you alone for five minutes before I see him. Is that too much to ask? I will come to your rooms at about twelve.” She came; she admired my rooms…. “My brothers Simon and Ned were here, you know. Ned had rooms on the garden front. I wanted Sebastian to come here, too, but my husband was at Christ Church and, as you know, he took charge of Sebastian’s education”; she admired my drawings… “ everyone loves your paintings in the garden-room. We shall never forgive you if you don’t finish them.” Finally, she came to her point. “I expect you’ve guessed already what I have come to ask. Quite simply, is Sebastian drinking too much this term?” I had guessed; I answered: “If he were, I shouldn’t answer. As it is, I can say, ‘No.’ ” She said: “I believe you. Thank God!” and we went together to luncheon at Christ Church. That night Sebastian had his third disaster and was found by the junior dean at one o’clock, wandering round Tom Quad hopelessly drunk. I had left him morose but completely sober at a few minutes before twelve. In the succeeding hour he had drunk half a bottle of whisky alone. He did not remember much about it when he came to tell me next morning. “Have you been doing that a lot,” I asked, “drinking by yourself after I’ve gone?” “About twice; perhaps four times. It’s only when they start bothering me. I’d be all right if they’d only leave me alone.” “They won’t now,” I said. “I know.” We both knew that this was a crisis. I had no love for Sebastian that morning; he needed it, but I had none to give.“Really,” I said, “if you are going to embark on a solitary bout of drinking every time you see a member of your family, it’s perfectly hopeless.” “Oh, yes,” said Sebastian with great sadness. “I know . It’s hopeless.” But my pride was stung because I had been made to look a liar and I could not respond to his need. “Well, what do you propose to do?” “I shan’t do anything. They’ll do it all.” And I let him go without comfort. Then the machinery began to move again, and I saw it all repeated as it had happened in December; Mr. Samgrass and Mgr. Bell saw the Dean of Christ Church; Brideshead came up for a night; the heavy wheels stirred and the small wheels spun. Everyone was exceedingly sorry for Lady Marchmain, whose brothers’ names stood in letters of gold on the war memorial, whose brothers’ memory was fresh in many breasts. She came to see me and, again, I must reduce to a few words a conversation which took us from Holywell to the Parks, through Mesopotamia, and over the ferry to north Oxford, where she was staying the night with a houseful of nuns who were in some way under her protection. “You must believe,” I said, “that when I told you Sebastian was not drinking, I was telling you the truth, as I knew it.” “I know you wish to be a good friend to him.” “That is not what I mean. I believed what I told you. I still believe it to some extent. I believe he has been drunk two or three times before, not more.” “It’s no good, Charles,” she said. “All you can mean is that you have not as much influence or knowledge of him as I thought. It is no good either of us trying to believe him. I’ve known drunkards before. One of the most terrible things about them is their deceit. Love of truth is the first thing that goes. “After that happy luncheon together. When you left he was so sweet to me, just as he used to be as a little boy, and I agreed to all he wanted. You know I had been doubtful about his sharing rooms with you. I know you’ll understand me when I say that. You know that we are all fond of you apart from your being Sebastian’s friend. We should miss you so much if you ever stopped coming to stay with us. But I want Sebastian to have all sorts of friends, not just one. Mgr. Bell tells me he never mixes with the other Catholics, never goes to the Newman, very rarely goes to mass even. Heaven forbid that he should only know Catholics, but he must know some . It needs a very strong faith to stand entirely alone and Sebastian’s isn’t strong. “But I was so happy at luncheon on Tuesday that I gave up all my objections; I went round with him and saw the rooms you had chosen. They are charming. And we decided on some furniture you could have fromLondon to make them nicer. And then, on the very night after I had seen him! —No Charles, it is not in the Logic of the Thing.” As she said it I thought, “That’s a phrase she’s picked up from one of her intellectual hangers-on.” “Well,” I said, “have you a remedy?” “The college are being extraordinarily kind. They say they will not send him down provided he goes to live with Mgr. Bell. It’s not a thing I could have suggested myself, but it was the Monsignor’s own idea. He specially sent a message to you to say how welcome you would always be. There’s not room for you actually in the Old Palace, but I daresay you wouldn’t want that yourself.” “Lady Marchmain, if you want to make him a drunkard that’s the way to do it. Don’t you see that any idea of his being watched would be fatal?” “Oh, dear, it’s no good trying to explain. Protestants always think Catholic priests are spies.” “I don’t mean that.” I tried to explain but made a poor business of it. “He must feel free.” “But he’s been free, always, up till now, and look at the result.” We had reached the ferry; we had reached a deadlock. With scarcely another word I saw her to the convent, then took the bus back to Carfax. Sebastian was in my rooms waiting for",
      "density_breakdown": {
        "Metaphor": 2.2193211488250655,
        "Simile": 1.566579634464752,
        "Imagery": 8.877284595300262,
        "Symbolism": 9.138381201044387,
        "Dialogue": 0.0,
        "Foreshadowing": 5.87467362924282,
        "Juxtaposition": 10.443864229765014,
        "Repetition": 8.093994778067884,
        "TOTAL_DENSITY": 46.21409921671018
      }
    },
    "climax": {
      "chapter_range": "11-12",
      "narrative_primary": 11,
      "optimized_primary": 11,
      "device_density_score": 48.43342036553525,
      "improvement_percent": 0.0,
      "optimization_applied": false,
      "chapter_text": "itwas one of the largest in the ship, our room was soon painfully crowded; they began to put out their cigarettes in the little pool of ice-water which now surrounded the swan. The purser made a sensation, as sailors like to do, by predicting a storm. “How can you be so beastly?” asked my wife, conveying the flattering suggestion that not only the cabin and the caviar, but the waves, too, were at his command. “Anyway, storms don’t affect a ship like this, do they?” “Might hold us back a bit.” “But it wouldn’t make us sick?” “Depends if you’re a good sailor. I’m always sick in storms, ever since I was a boy.” “I don’t believe it. He’s just being sadistic. Come over here, there’s something I want to show you.” It was the latest photograph of her children. “Charles hasn’t even seen Caroline yet. Isn’t it thrilling for him?” There were no friends of mine there, but I knew about a third of the party, and talked away civilly enough. An elderly woman said to me, “So you’re Charles. I feel I know you through and through, Celia’s talked so much about you.” “Through and through,” I thought. “Through and through is a long way, madam. Can you indeed see into those dark places where my own eyes seek in vain to guide me? Can you tell me, dear Mrs. Stuyvesant Oglander—if I am correct in thinking that is how I heard my wife speak of you—why it is that at this moment, while I talk to you, here, about my forthcoming exhibition, I am thinking all the time only of when Julia will come? Why can I talk like this to you, but not to her? Why have I already set her apart from humankind, and myself with her? What is going on in those secret places of my spirit with which you make so free? What is cooking, Mrs. Stuyvesant Oglander?” Still Julia did not come, and the noise of twenty people in that tiny room, which was so large that no one hired it, was the noise of a multitude. Then I saw a curious thing. There was a little red-headed man whom no one seemed to know, a dowdy fellow quite unlike the general run of my wife’s guests; he had been standing by the caviar for twenty minutes eating as fast as a rabbit. Now he wiped his mouth with his handkerchief and, on the impulse apparently, leaned forward and dabbed the beak of the swan, removing the drop of water that had been swelling there and would soon have fallen. Then he looked round furtively to see if he had been observed, caught my eye, and giggled nervously. “Been wanting to do that for a long time,” he said. “Bet you don’t knowhow many drops to the minute. I do, I counted.” “I’ve no idea.” “Guess. Tanner if you’re wrong; half a dollar if you’re right. That’s fair.” “Three,” I said. “Coo, you’re a sharp one. Been counting ’em yourself.” But he showed no inclination to pay this debt. Instead he said: “How d’you figure this out. I’m an Englishman born and bred, but this is my first time on the Atlantic.” “You flew out perhaps?” “No, nor over it.” “Then I presume you went round the world and came across the Pacific.” “You are a sharp one and no mistake. I’ve made quite a bit getting into arguments over that one.” “What was your route?” I asked, wishing to be agreeable. “Ah, that’d be telling. Well, I must skedaddle. So long.” “Charles,” said my wife, “this is Mr. Kramm, of Interastral Films.” “So you are Mr. Charles Ryder,” said Mr. Kramm. “Yes.” “Well, well, well,” he paused. I waited. “The purser here says we’re heading for dirty weather. What d’you know about that?” “Far less than the purser.” “Pardon me, Mr. Ryder, I don’t quite get you.” “I mean I know less than the purser.” “Is that so? Well, well, well. I’ve enjoyed our talk very much. I hope that it will be the first of many.” An Englishwoman said: “Oh, that swan! Six weeks in America has given me an absolute phobia of ice. Do tell me, how did it feel meeting Celia again after two years? I know I should feel indecently bridal. But Celia’s never quite got the orange blossom out of her hair, has she?” Another woman said: “Isn’t it heaven saying good-bye and knowing we shall meet again in half an hour and go on meeting every half-hour for days?” Our guests began to go, and each on leaving informed me of something my wife had promised to bring me to in the near future; it was the theme of the evening that we should all be seeing a lot of each other, that we had formed one of those molecular systems that physicists can illustrate. At last the swan was wheeled out, too, and I said to my wife, “Julia never came.” “No, she telephoned. I couldn’t hear what she said, there was such a noise going on—something about a dress. Quite lucky really, there wasn’t room for a cat. It was a lovely party, wasn’t it? Did you hate it very much? You behaved beautifully and looked so distinguished. Who was your red-haired chum?”“No chum of mine.” “How very peculiar! Did you say anything to Mr. Kramm about working in Hollywood?” “Of course not.” “Oh, Charles, you are a worry to me. It’s not enough just to stand about looking distinguished and a martyr for Art. Let’s go to dinner. We’re at the Captain’s table. I don’t suppose he’ll dine down tonight, but it’s polite to be fairly punctual.” By the time that we reached the table the rest of the party had arranged themselves. On either side of the Captain’s empty chair sat Julia and Mrs. Stuyvesant Oglander; besides them there was an English diplomat and his wife, Senator Stuyvesant Oglander, and an American clergyman at present totally isolated between two pairs of empty chairs. This clergyman later described himself—redundantly it seemed—as an Episcopalian Bishop. Husbands and wives sat together here. My wife was confronted with a quick decision, and although the steward attempted to direct us otherwise, sat so that she had the senator and I the Bishop. Julia gave us both a little dismal signal of sympathy. “I’m miserable about the party,” she said, “my beastly maid totally disappeared with every dress I have. She only turned up half an hour ago. She’d been playing ping-pong.” “I’ve been telling the Senator what he missed,” said Mrs. Stuyvesant Oglander. “Wherever Celia is, you’ll find she knows all the significant people.” “On my right,” said the Bishop, “a significant couple are expected. They take all their meals in their cabin except when they have been informed in advance that the Captain will be present.” We were a gruesome circle; even my wife’s high social spirit faltered. At moments I heard bits of her conversation. “… an extraordinary little red-haired man. Captain Foulenough in person.” “But I understood you to say, Lady Celia, that you were unacquainted with him.” “I meant he was like Captain Foulenough.” “I begin to comprehend. He impersonated this friend of yours in order to come to your party.” “No, no. Captain Foulenough is simply a comic character.” “There seems to have been nothing very amusing about this other man. Your friend is a comedian?” “No, no. Captain Foulenough is an imaginary character in an English paper. You know, like your ‘Popeye.’ ”The senator laid down knife and fork. “To recapitulate: an imposter came to your party and you admitted him because of a fancied resemblance to a fictitious character in a cartoon.” “Yes, I suppose that was it really.” The senator looked at his wife as much as to say: “Significant people, huh!” I heard Julia across the table trying to trace, for the benefit of the diplomat, the marriage-connections of her Hungarian and Italian cousins. The diamonds flashed in her hair and on her fingers, but her hands were nervously rolling little balls of crumb, and her starry head drooped in despair. The Bishop told me of the goodwill mission on which he was traveling to Barcelona… “a very, very valuable work of clearance has been performed, Mr. Ryder. The time has now come to rebuild on broader foundations. I have made it my aim to reconcile the so-called Anarchists and the so-called Communists, and with that in view I and my committee have digested all the available documentation of the subject. Our conclusion, Mr. Ryder, is unanimous. There is no fundamental diversity between the two ideologies. It is a matter of personalities, Mr. Ryder, and what personalities have put asunder personalities can unite…” On the other side I heard: “And may I make so bold as to ask what institutions sponsored your husband’s expedition?” The diplomat’s wife bravely engaged the Bishop across the gulf that separated them. “And what language will you speak when you get to Barcelona?” “The language of Reason and Brotherhood, madam,” and, turning back to me, “The speech of the coming century is in thoughts not in words. Do you not agree, Mr. Ryder?” “Yes,” I said. “Yes.” “What are words?” said the Bishop. “What indeed?” “Mere conventional symbols, Mr. Ryder, and this is an age rightly skeptical of conventional symbols.” My mind reeled; after the parrot-house fever of my wife’s party, and unplumbed emotions of the afternoon, after all the exertions of my wife’s pleasures in New York, after the months of solitude in the steaming, green shadows of the jungle, this was too much. I felt like Lear on the heath, like the Duchess of Malfi bayed by madmen. I summoned cataracts and hurricanoes, and as if by conjury the call was immediately answered. For some time now, though whether it was a mere trick of the nerves I did not then know, I had felt a recurrent and persistently growing motion—aheave and shudder of the large dining-room as of the breast of a man in deep sleep. Now my wife turned to me and said: “Either I am a little drunk or it’s getting rough,” and, even as she spoke we found ourselves leaning sideways in our chairs; there was a crash and tinkle of falling cutlery by the wall, and on our table the wine glasses all together toppled and rolled over, while each of us steadied the plates and forks and looked at the other with expressions that varied between frank horror in the diplomat’s wife and relief in Julia. The gale which, unheard, unseen, unfelt, in our enclosed and insulated world had, for an hour, been mounting over us, had now veered and fallen full on our bows. Silence followed the crash, then a high, nervous babble of laughter. Stewards laid napkins on the pools of spilt wine. We tried to resume the conversation, but all were waiting, as the little ginger man had watched the drop swell and fall from the swan’s beak, for the next great blow; it came, heavier than the last. “This is where I say good night to you all,” said the diplomat’s wife, rising. Her husband led her to their cabin. The dining-room was emptying fast. Soon only Julia, my wife, and I were left at the table, and, telepathically, Julia said, “Like King Lear.” “Only each of us is all three of them.” “What can you mean?” asked my wife. “Lear, Kent, Fool.” “Oh, dear, it’s like that agonizing Foulenough conversation over again. Don’t try and explain.” “I doubt if I could,” I said. Another climb, another vast drop. The stewards were at work making things fast, shutting things up, hustling away unstable ornaments. “Well, we’ve finished dinner and set a fine example of British phlegm,” said my wife. “Let’s go and see what’s on.” Once, on our way to the lounge, we had all three to cling to a pillar; when we got there we found it almost deserted; the band played but no one danced; the tables were set for tombola but no one bought a card, and the ship’s officer, who made a speciality of calling the numbers with all the patter of the lower deck—“sweet sixteen and never been kissed—key of the door, twenty- one—clickety-click, sixty-six”—was idly talking to his colleagues; there were a score of scattered novel readers, a few games of bridge, some brandy drinking in the smoking-room, but all our guests of two hours before had disappeared. The three of us sat for a little by the empty dance floor; my wife was fullof schemes by which, without impoliteness, we could move to another table in the dining-room. “It’s crazy to go to the restaurant,” she said, “and pay extra for exactly the same dinner. Only film people go there, anyway. I don’t see why we should be made to.” Presently she said: “It’s making my head ache and I’m tired, anyway. I’m going to bed.” Julia went with her. I walked round the ship, on one of the covered decks where the wind howled and the spray leaped up from the darkness and smashed white and brown against the glass screen; men were posted to keep the passengers off the open decks. Then I, too, went below. In my dressing-room everything breakable had been stowed away, the door to the cabin was hooked open, and my wife called plaintively from within. “I feel terrible. I didn’t know a ship of this size could pitch like this,” she said, and her eyes were full of consternation and resentment, like those of a woman who, at the end of her time, at length realizes that however luxurious the nursing home, and however well paid the doctor, her labor is inevitable; and the lift and fall of the ship came regularly as the pains of childbirth. I slept next door; or, rather, I lay there between dreaming and waking. In a narrow bunk, on a hard mattress, there might have been rest, but here the beds were broad and buoyant; I collected what cushions I could find and tried to wedge myself firm, but through the night I turned with each swing and twist of the ship—she was rolling now as well as pitching—and my head rang with the creak and thud. Once, an hour before dawn, my wife appeared like a ghost in the doorway, supporting herself with either hand on the jambs, saying: “Are you awake? Can’t you do something? Can’t you get something from the doctor?” I rang for the night steward, who had a draught ready prepared, which comforted her a little. And all night between dreaming and waking I thought of Julia; in my brief dreams she took a hundred fantastic and terrible and obscene forms, but in my waking thoughts she returned with her sad, starry head just as I had seen her at dinner. After first light I slept for an hour or two, then awoke clear-headed, with a joyous sense of anticipation. The wind had dropped a little, the steward told me, but was still blowing hard and there was a very heavy swell; “which there’s nothing worse than aheavy swell,” he said, “for the enjoyment of the passengers. There’s not many breakfasts wanted this morning.” I looked in at my wife, found her sleeping, and closed the door between us; then I ate salmon kedgeree and cold Bradenham ham and telephoned for a barber to come and shave me. “There’s a lot of stuff in the sitting-room for the lady,” said the steward; “shall I leave it for the time?” I went to see. There was a second delivery of cellophane parcels from the shops on board, some ordered by radio from friends in New York whose secretaries had failed to remind them of our departure in time, some by our guests as they left the cocktail party. It was no day for flower vases; I told him to leave them on the floor and then, struck by the thought, removed the card from Mr. Kramm’s roses and sent them with my love to Julia. She telephoned while I was being shaved. “What a deplorable thing to do, Charles! How unlike you!” “Don’t you like them?” “What can I do with roses on a day like this?” “Smell them.” There was a pause and a rustle of unpacking. “They’ve absolutely no smell at all.” “What have you had for breakfast?” “Muscat grapes and cantaloupe.” “When shall I see you?” “Before lunch. I’m busy till then with a masseuse.” “A masseuse?” “Yes, isn’t it peculiar? I’ve never had one before, except once when I hurt my shoulder hunting. What is it about being on a boat that makes everyone behave like a film star?” “I don’t.” “How about these very embarrassing roses?” The barber did his work with extraordinary dexterity—indeed, with agility, for he stood like a swordsman in a ballet sometimes on the point of one foot, sometimes on the other, lightly flicking the lather off his blade, and swooping back to my chin as the ship righted herself; I should not have dared use a safety razor on myself. The telephone rang again. It was my wife. “How are you, Charles?” “Tired.” “Aren’t you coming to see me?”“I came once. I’ll be in again.” I brought her the flowers from the sitting-room; they completed the atmosphere of a maternity ward which she had managed to create in the cabin; the stewardess had the air of a midwife, standing by the bed, a pillar of starched linen and composure. My wife turned her head on the pillow and smiled wanly; she stretched out a bare arm and caressed with the tips of her fingers the cellophane and silk ribbons of the largest bouquet. “How sweet people are,” she said faintly, as though the gale were a private misfortune of her own for which the world in its love was condoling with her. “I take it you’re not getting up.” “Oh no, Mrs. Clark is being so sweet”; she was always quick to get servants’ names. “Don’t bother. Come in sometimes and tell me what’s going on.” “Now, now, dear,” said the stewardess, “the less we are disturbed today the better.” My wife seemed to make a sacred, female rite even of seasickness. Julia’s cabin, I knew, was somewhere below ours. I waited for her by the lift on the main deck; when she came we walked once round the promenade; I held the rail; she took my other arm. It was hard going; through the streaming glass we saw a distorted world of gray sky and black water. When the ship rolled heavily I swung her round so that she could hold the rail with her other hand; the howl of the wind was subdued, but the whole ship creaked with strain. We made the circuit once, then Julia said: “It’s no good. That woman beat hell out of me, and I feel limp, anyway. Let’s sit down.” The great bronze doors of the lounge had torn away from their hooks and were swinging free with the roll of the ship; regularly and, it seemed, irresistibly, first one, then the other, opened and shut; they paused at the completion of each half circle, began to move slowly and finished fast with a resounding clash. There was no real risk in passing them, except of slipping and being caught by that swift, final blow; there was ample time to walk through unhurried but there was something forbidding in the sight of that great weight of uncontrolled metal, flapping to and fro, which might have made a timid man flinch or skip through too quickly; I rejoiced to feel Julia’s hand perfectly steady on my arm and know, as I walked beside her, that she was wholly undismayed. “Bravo,” said a man sitting nearby. “I confess I went round the other way. I didn’t like the look of those doors somehow. They’ve been trying to fix them all the morning.” There were few people about that day, and that few seemed bound together by a camaraderie of reciprocal esteem; they did nothing except sit ratherglumly in their armchairs, drink occasionally, and exchange congratulations on not being seasick. “You’re the first lady I’ve seen,” said the man. “I’m very lucky.” “ We are very lucky,” he said, with a movement which began as a bow and ended as a lurch forward to his knees, as the blotting-paper floor dipped steeply between us. The roll carried us away from him, clinging together but still on our feet, and we quickly sat where our dance led us, on the further side, in isolation; a web of life-lines had been stretched across the lounge, and we seemed like boxers, roped into the ring. The steward approached. “Your usual, sir? Whisky and tepid water, I think. And for the lady? Might I suggest a nip of champagne?” “D’you know, the awful thing is I would like champagne very much,” said Julia. “What a life of pleasure—roses, half an hour with a female pugilist, and now champagne!” “I wish you wouldn’t go on about the roses. It wasn’t my idea in the first place. Someone sent them to Celia.” “Oh, that’s quite different. It lets you out completely. But it makes my massage worse.” “I was shaved in bed.” “I’m glad about the roses,” said Julia. “Frankly, they were a shock. They made me think we were starting the day on the wrong foot.” I knew what she meant, and in that moment felt as though I had shaken off some of the dust and grit of ten dry years; then and always, however she spoke to me, in half sentences, single words, stock phrases of contemporary jargon, in scarcely perceptible movements of eyes or lips or hands, however inexpressible her thought, however quick and far it had glanced from the matter in hand, however deep it had plunged, as it often did, straight from the surface to the depths, I knew; even that day when I still stood on the extreme verge of love, I knew what she meant. We drank our wine and soon our new friend came lurching towards us down the life-line. “Mind if I join you? Nothing like a bit of rough weather for bringing people together. This is my tenth crossing, and I’ve never seen anything like it. I can see you are an experienced sailor, young lady.” “No. As a matter of fact, I’ve never been at sea before except coming to New York and, of course, crossing the Channel. I don’t feel sick, thank God, but I feel tired. I thought at first it was only the massage, but I’m coming to the conclusion it’s the ship.” “My wife’s in a terrible way. She’s an experienced sailor. Only shows,doesn’t it?” He joined us at luncheon, and I did not mind his being there; he had clearly taken a fancy to Julia, and he thought we were man and wife; this misconception and his gallantry seemed in some way to bring her and me closer together. “Saw you two last night at the Captain’s table,” he said, “with all the nobs.” “Very dull nobs.” “If you ask me, nobs always are. When you get a storm like this you find out what people are really made of.” “You have a predilection for good sailors?” “Well, put like that I don’t know that I do—what I mean is, it makes for getting together.” “Yes.” “Take us for example. But for this we might never have met. I’ve had some very romantic encounters at sea in my time. If the lady will excuse me, I’d like to tell you about a little adventure I had in the Gulf of Lions when I was younger than I am now.” We were both weary; lack of sleep, the incessant din, and the strain every movement required, wore us down. We spent that afternoon apart in our cabins. I slept and when I awoke the sea was as high as ever, inky clouds swept over us, and the glass streamed still with water, but I had grown used to the storm in my sleep, had made its rhythm mine, had become part of it, so that I arose strongly and confidently and found Julia already up and in the same temper. “What d’you think?” she said. “That man’s giving a little ‘get-together party’ tonight in the smoking-room for all the good sailors. He asked me to bring my husband.” “Are we going?” “Of course… I wonder if I ought to feel like the lady our friend met on the way to Barcelona. I don’t, Charles, not a bit.” There were eighteen people at the “get-together party”; we had nothing in common except immunity from seasickness. We drank champagne, and presently our host said: “Tell you what, I’ve got a roulette wheel. Trouble is we can’t go to my cabin on account of the wife, and we aren’t allowed to play in public.” So the party adjourned to my sitting-room and we played for low stakes until late into the night, when Julia left and our host had drunk too much wine to be surprised that she and I were not in the same quarters. When all but he had gone, he fell asleep in his chair, and I left him there. It was the last I saw of him, for later—so the steward told me when he came from returning theroulette things to the man’s cabin—he broke his thigh, falling in the corridor, and was taken to the ship’s hospital. All next day Julia and I spent together without interruption; talking, scarcely moving, held in our chairs by the swell of the sea. After luncheon the last hardy passengers went to rest and we were alone as though the place had been cleared for us, as though tact on a titanic scale had sent everyone tip- toeing out to leave us to one another. The bronze doors of the lounge had been fixed, but not before two seamen had been badly injured. They had tried various devices, lashing with ropes and, later, when these failed, with steel hawsers, but there was nothing to which they could be made fast; finally, they drove wooden wedges under them, catching them in the brief moment of repose when they were full open, and these held firm. When, before dinner, she went to her cabin to get ready (no one dressed that night) and I came with her, uninvited, unopposed, expected, and behind closed doors took her in my arms and first kissed her, there was no alteration from the mood of the afternoon. Later, turning it over in my mind, as I turned in my bed with the rise and fall of the ship, through the long, lonely, drowsy night, I recalled the courtships of the past, dead, ten years; how, knotting my tie before setting out, putting the gardenia in my buttonhole, I would plan my evening and think at such and such a time, at such and such an opportunity, I shall cross the start-line and open my attack for better or worse; “this phase of the battle has gone on long enough,” I would think; “a decision must be reached.” With Julia there were no phases, no start-line, no tactics at all. But later that night when she went to bed and I followed her to her door, she stopped me. “No, Charles, not yet. Perhaps never. I don’t know. I don’t know if I want love.” Then something, some surviving ghost from those dead ten years—for one cannot die, even for a little, without some loss—made me say, “Love? I’m not asking for love.” “Oh yes, Charles, you are,” she said, and putting up her hand gently stroked my cheek; then shut her door. And I reeled back, first on one wall, then on the other, of the long, softly lighted, empty corridor; for the storm, it appeared, had the form of a ring; all day we had been sailing through its still center; now we were once more in the full fury of the wind—and that night was to be rougher than the one before. Ten hours of talking: what had we to say? Plain fact mostly, the record of our two lives, so long widely separate, now being knit to one. Through all that storm-tossed night I rehearsed what she had told me; she was no longer the alternate succubus and starry vision of the night before; she had given all that was transferable of her past into my keeping. She told me, as I have already retold, of her courtship and marriage; she told me, as though fondly turning the pages of an old nursery-book, of her childhood, and I lived long, sunny days with her in the meadows, with Nanny Hawkins on her camp stool and Cordelia asleep in the pram, slept quiet nights under the dome with the religious pictures fading round the cot as the nightlight burned low and the embers settled in the grate. She told me of her life with Rex and of the secret, vicious, disastrous escapade that had taken her to New York. She, too, had had her dead years. She told me of her long struggle with Rex as to whether she should have a child; at first she wanted one, but learned after a year that an operation was needed to make it possible; by that time Rex and she were out of love, but he still wanted his child, and when at last she consented, it was born dead. “Rex has never been unkind to me intentionally,” she said. “It’s just that he isn’t a real person at all; he’s just a few faculties of a man highly developed; the rest simply isn’t there. He couldn’t imagine why it hurt me to find two months after we came back to London from our honeymoon, that he was still keeping up with Brenda Champion.” “I was glad when I found Celia was unfaithful,” I said. “I felt it was all right for me to dislike her.” “Is she? Do you? I’m glad. I don’t like her either. Why did you marry her?” “Physical attraction. Ambition. Everyone agrees she’s the ideal wife for a painter. Loneliness, missing Sebastian.” “You loved him, didn’t you?” “Oh yes. He was the forerunner.” Julia understood. The ship creaked and shuddered, rose and fell. My wife called to me from the next room: “Charles, are you there?” “Yes.” “I’ve been asleep such a long while. What time is it?” “Half past three.” “It’s no better, is it?” “Worse.” “I feel a little better, though. D’you think they’d bring me some tea or something if I rang the bell?”I got her some tea and biscuits from the night steward. “Did you have an amusing evening?” “Everyone’s seasick.” “Poor Charles. It was going to have been such a lovely trip, too. It may be better tomorrow.” I turned out the light and shut the door between us. Waking and dreaming, through the strain and creak and heave of the long night, firm on my back with my arms and legs spread wide to check the roll, and my eyes open to the darkness, I lay thinking of Julia. “… We thought papa might come back to England after mummy died, or that he might marry again, but he lives just as he did. Rex and I often go to see him now. I’ve grown fond of him…. Sebastian’s disappeared completely…. Cordelia’s in Spain with an ambulance…. Bridey leads his own extraordinary life. He wanted to shut Brideshead after mummy died, but papa wouldn’t have it for some reason, so Rex and I live there now, and Bridey has two rooms up in the dome, next to Nanny Hawkins, part of the old nurseries. He’s like a character from Chekhov. One meets him sometimes coming out of the library or on the stairs—I never know when he’s at home—and now and then he suddenly comes in to dinner like a ghost quite unexpectedly. “… Oh, Rex’s parties! Politics and money. They can’t do anything except for money; if they walk round the lake they have to make bets about how many swans they see… sitting up till two, amusing Rex’s girls, hearing them gossip, rattling away endlessly on the backgammon board while the men play cards and smoke cigars. The cigar smoke. I can smell it in my hair when I wake up in the morning; it’s in my clothes when I dress at night. Do I smell of it now? D’you think that woman who rubbed me, felt it in my skin? “… At first I used to stay away with Rex in his friends’ houses. He doesn’t make me anymore. He was ashamed of me when he found I didn’t cut the kind of figure he wanted, ashamed of himself for having been taken in. I wasn’t at all the article he’d bargained for. He can’t see the point of me, but whenever he’s made up his mind there isn’t a point and he’s begun to feel comfortable, he gets a surprise—some man, or even woman, he respects, takes a fancy to me and he suddenly sees that there is a whole world of things we understand and he doesn’t… he was upset when I went away. He’ll be delighted to have me back. I was faithful to him until this last thing came along. There’s nothing like a good upbringing. Do you know last year, when I thought I was going to have a child, I’d decided to have it brought up a Catholic? I hadn’t thought about religion before; I haven’t since; but just at that time, when I was waiting for the birth, I thought, ‘That’s one thing I can give her. It doesn’t seem to have done me much good, but my child shall haveit.’ It was odd, wanting to give something one had lost oneself. Then, in the end, I couldn’t even give that: I couldn’t even give her life. I never saw her; I was too ill to know what was going on, and afterwards, for a long time, until now, I didn’t want to speak about her—she was a daughter, so Rex didn’t so much mind her being dead. “I’ve been punished a little for marrying Rex. You see, I can’t get all that sort of thing out of my mind, quite—Death, Judgment, Heaven, Hell, Nanny Hawkins, and the catechism. It becomes part of oneself, if they give it one early enough. And yet I wanted my child to have it… now I suppose I shall be punished for what I’ve just done. Perhaps that is why you and I are here together like this… part of a plan.” That was almost the last thing she said to me—“part of a plan”—before we went below and I left her at the cabin door. Next day the wind had again dropped, and again we were wallowing in the swell. The talk was less of seasickness now than of broken bones; people had been thrown about in the night, and there had been many nasty accidents on bathroom floors. That day, because we had talked so much the day before and because what we had to say needed few words, we spoke little. We had books; Julia found a game she liked. When after long silences we spoke, our thoughts, we found, had kept pace together side by side. Once I said, “You are standing guard over your sadness.” “It’s all I have earned. You said yesterday. My wages.” “An I.O.U. from life. A promise to pay on demand.” Rain ceased at midday; at evening the clouds dispersed and the sun, astern of us, suddenly broke into the lounge where we sat, putting all the lights to shame. “Sunset,” said Julia, “the end of our day.” She rose and, though the roll and pitch of the ship seemed unabated, led me up to the boat-deck. She put her arm through mine and her hand into mine, in my great-coat pocket. The deck was dry and empty, swept only by the wind of the ship’s speed. As we made our halting, laborious way forward, away from the flying smuts of the smoke stack, we were alternately jostled together, then strained, nearly sundered, arms and fingers interlocked as I held the rail and Julia clung to me, thrust together again, drawn apart; then, in a plunge deeper than the rest, I found myself flung across her, pressing her against the rail, warding myself off her with the arms that held her prisoner on either side,and as the ship paused at the end of its drop as though gathering strength for the ascent, we stood thus embraced, in the open, cheek against cheek, her hair blowing across my eyes; the dark horizon of tumbling water, flashing now with gold, stood still above us, then came sweeping down till I was staring through Julia’s dark hair into a wide and golden sky, and she was thrown forward on my heart, held up by my hands on the rail, her face still pressed to mine. In that minute, with her lips to my ear and her breath warm in the salt wind, Julia said, though I had not spoken, “Yes, now,” and as the ship righted herself and for the moment ran into calmer waters, Julia led me below. It was no time for the sweets of luxury; they would come, in their season, with the swallow and the lime flowers. Now on the rough water there was a formality to be observed, no more. It was as though a deed of conveyance of her narrow loins had been drawn and sealed. I was making my first entry as the freeholder of a property I would enjoy and develop at leisure. We dined that night high up in the ship, in the restaurant, and saw through the bow windows the stars come out and sweep across the sky as once, I remembered, I had seen them sweep above the towers and gables of Oxford. The stewards promised that tomorrow night the band would play again and the place be full. We had better book now, they said, if we wanted a good table. “Oh dear,” said Julia, “where can we hide in fair weather, we orphans of the storm?” I could not leave her that night, but early next morning, as once again I made my way back along the corridor, I found I could walk without difficulty; the ship rode easily on a smooth sea, and I knew that our solitude was broken. My wife called joyously from her cabin: “Charles, Charles, I feel so well. What do you think I am having for breakfast?” I went to see. She was eating a beef steak. “I’ve fixed up for a visit to the hairdresser—do you know they couldn’t take me till four o’clock this afternoon, they’re so busy suddenly? So I shan’t appear till the evening, but lots of people are coming in to see us this morning, and I’ve asked Miles and Janet to lunch with us in our sitting-room. I’m afraid I’ve been a worthless wife to you the last two days. What have you been up to?” “One gay evening,” I said, “we played roulette till two o’clock, next door in the sitting-room, and our host passed out.”“Goodness. It sounds very disreputable. Have you been behaving, Charles? You haven’t been picking up sirens?” “There was scarcely a woman about. I spent most of the time with Julia.” “Oh, good. I always wanted to bring you together. She’s one of my friends I knew you’d like. I expect you were a godsend to her. She’s had rather a gloomy time lately. I don’t expect she mentioned it, but…” my wife proceeded to relate a current version of Julia’s journey to New York. “I’ll ask her to cocktails this morning,” she concluded. Julia came among the others, and it was happiness enough, now merely to be near her. “I hear you’ve been looking after my husband for me,” my wife said. “Yes, we’ve become very matey. He and I and a man whose name we don’t know.” “Mr. Kramm, what have you done to your arm?” “It was the bathroom floor,” said Mr. Kramm, and explained at length how he had fallen. That night the Captain dined at his table and the circle was complete, for claimants came to the chairs on the Bishop’s right, two Japanese who expressed deep interest in his projects for world-brotherhood. The Captain was full of chaff at Julia’s endurance in the storm, offering to engage her as a seaman; years of sea-going had given him jokes for every occasion. My wife, fresh from the beauty parlor, was unmarked by her three days of distress, and in the eyes of many seemed to outshine Julia, whose sadness had gone and been replaced by an incommunicable content and tranquility; incommunicable save to me; she and I, separated by the crowd, sat alone together close enwrapped, as we had lain in each other’s arms the night before. There was a gala spirit in the ship that night. Though it meant rising at dawn to pack, everyone was determined that for this one night he would enjoy the luxury the storm had denied him. There was no solitude. Every corner of the ship was thronged; dance music and high, excited chatter, stewards darting everywhere with trays of glasses, the voice of the officer in charge of tombola—“Kelly’s eye—number one; legs, eleven; and we’ll Shake the Bag”—Mrs. Stuyvesant Oglander in a paper cap, Mr. Kramm and his bandages, the two Japanese decorously throwing paper streamers and hissing like geese. I did not speak to Julia, alone, all that evening. We met for a minute next day on the starboard side of the ship while everyone else crowded to port to see the officials come aboard and to gaze at the green coastline of Devon.“What are your plans?” “London for a bit,” she said. “Celia’s going straight home. She wants to see the children.” “You, too?” “No.” “In London then.” “Charles, the little red-haired man—Foulenough. Did you see? Two plain clothes police have taken him off.” “I missed it. There was such a crowd on that side of the ship.” “I found out the trains and sent a telegram. We shall be home by dinner. The children will be asleep. Perhaps we might wake Johnjohn up, just for once.” “You go down,” I said. “I shall have to stay in London.” “Oh, but Charles, you must come. You haven’t seen Caroline.” “Will she change much in a week or two?” “Darling, she changes every day.” “Then what’s the point of seeing her now? I’m sorry, my dear, but I must get the pictures unpacked and see how they’ve traveled. I must fix up for the exhibition right away.” “Must you?” she said, but I knew that her resistance ended when I appealed to the mysteries of my trade. “It’s very disappointing. Besides, I don’t know if Andrew and Cynthia will be out of the flat. They took it till the end of the month.” “I can go to a hotel.” “But that’s so grim. I can’t bear you to be alone your first night home. I’ll stay and go down tomorrow.” “You mustn’t disappoint the children.” “No.” Her children, my art, the two mysteries of our trades. “Will you come for the week-end?” “If I can.” “All British passports to the smoking-room, please,” said a steward. “I’ve arranged with that sweet Foreign Office man at our table to get us off early with him,” said my wife.Two I t was my wife’s idea to hold the private view on Friday. “We are out to catch the critics this time,” she said. “It’s high time they began to take you seriously, and they know it. This is their chance. If you open on Monday, they’ll most of them have just come up from the country, and they’ll dash off a few paragraphs before dinner—I’m only worrying about the weeklies of course. If we give them the week-end to think about it, we shall have them in an urbane Sunday-in-the-country mood. They’ll settle down after a good luncheon, tuck up their cuffs, and turn out a nice, leisurely full-length essay, which they’ll reprint later in a nice little book. Nothing less will do this time.” She was up and down from the Old Rectory several times during the month of preparation, revising the list of invitations and helping with the hanging. On the morning of the private view I telephoned to Julia and said: “I’m sick of the pictures already and never want to see them again, but I suppose I shall have to put in an appearance.” “D’you want me to come?” “I’d much rather you didn’t.” “Celia sent a card with “Bring everyone” written across it in green ink. When do we meet?” “In the train. You might pick up my luggage.” “If you’ll have it packed soon I’ll pick you up, too, and drop you at the gallery. I’ve got a fitting next door at twelve.” When I reached the gallery my wife was standing looking through the window to the street. Behind her half a dozen unknown picture-lovers were moving from canvas to canvas, catalogue in hand; they were people who had once bought a wood-cut and were consequently on the gallery’s list of patrons. “No one has come yet,” said my wife. “I’ve been here since ten and it’s been very dull. Whose car was that you came in?” “Julia’s.” “Julia’s? Why didn’t you bring her in? Oddly enough, I’ve just",
      "density_breakdown": {
        "Metaphor": 3.7859007832898173,
        "Simile": 3.3942558746736293,
        "Imagery": 11.488250652741513,
        "Symbolism": 7.5718015665796345,
        "Dialogue": 0.0,
        "Foreshadowing": 5.613577023498694,
        "Juxtaposition": 11.618798955613578,
        "Repetition": 4.960835509138381,
        "TOTAL_DENSITY": 48.43342036553525
      }
    },
    "falling_action": {
      "chapter_range": "13-14",
      "narrative_primary": 13,
      "optimized_primary": 14,
      "device_density_score": 46.08355091383812,
      "improvement_percent": 8.936393965767337,
      "optimization_applied": true,
      "chapter_text": "on the painful occasion of the removal of his master’s luggage when it was decided not to return from the war; then Plender had been valet, as, officially, he still was, but he had in the past years introduced a kind of suffragan, a Swiss body-servant, to attend to the wardrobe and also, when occasion arose, lend a hand with less dignified tasks about the house, and had in effect become major-domo of that fluctuating and mobile household; sometimes he even referred to himself on the telephone as “the secretary.” There was an acre of thin ice between him and Wilcox. Fortunately the two men took a liking to one another, and the thing was solved in a series of three-cornered discussions with Cordelia. Plender and Wilcox became joint grooms of the chambers, like “Blues” and Life Guards with equal precedence, Plender having as his particular province his Lordship’s own apartments and Wilcox a sphere of influence in the public rooms; the senior footman was given a black coat and promoted butler, the nondescript Swiss, on arrival, was to have plain clothes and full valet’s status; there was a general increase in wages to meet the new dignities, and all were content. Julia and I, who had left Brideshead a month before, thinking we should not return, moved back for the reception. When the day came, Cordelia went to the station and we remained to greet him at home. It was a bleak and gusty day. Cottages and lodges were decorated; plans for a bonfire that night and forthe village silver band to play on the terrace, were put down, but the house flag, that had not flown for twenty-five years, was hoisted over the pediment, and flapped sharply against the leaden sky. Whatever harsh voices might be bawling into the microphones of central Europe, and whatever lathes spinning in the armament factories, the return of Lord Marchmain was a matter of first importance in his own neighborhood. He was due at three o’clock. Julia and I waited in the drawing-room until Wilcox, who had arranged with the stationmaster to be kept informed, announced “the train is signaled,” and a minute later, “the train is in; his Lordship is on the way.” Then we went to the front portico and waited there with the upper servants. Soon the Rolls appeared at the turn in the drive, followed at some distance by the two vans. It drew up; first Cordelia got out, then Cara; there was a pause, a rug was handed to the chauffeur, a stick to the footman; then a leg was cautiously thrust forward. Plender was by now at the car door; another servant—the Swiss valet—had emerged from a van; together they lifted Lord Marchmain out and set him on his feet; he felt for his stick, grasped it, and stood for a minute collecting his strength for the few low steps which led to the front door. Julia gave a little sigh of surprise and touched my hand. We had seen him nine months ago at Monte Carlo, when he had been an upright and stately figure, little changed from when I first met him in Venice. Now he was an old man. Plender had told us his master had been unwell lately: he had not prepared us for this. Lord Marchmain stood bowed and shrunken, weighed down by his great- coat, a white muffler fluttering untidily at his throat, a cloth cap pulled low on his forehead, his face white and lined, his nose colored by the cold; the tears which gathered in his eyes came not from emotion but from the east wind; he breathed heavily. Cara tucked in the end of his muffler and whispered something to him. He raised a gloved hand—a schoolboy’s glove of gray wool—and made a small, weary gesture of greeting to the group at the door; then, very slowly, with his eyes on the ground before him, he made his way into the house. They took off his coat and cap and muffler and the kind of leather jerkin which he wore under them; thus stripped he seemed more than ever wasted but more elegant; he had cast the shabbiness of extreme fatigue. Cara straightened his tie; he wiped his eyes with a bandanna handkerchief and shuffled with his stick to the hall fire. There was a little heraldic chair by the chimney-piece, one of a set which stood against the walls, a little, inhospitable, flat-seated thing, a mere excuse for the elaborate armorial painting on its back, on which, perhaps, no one, noteven a weary footman, had ever sat since it was made; there Lord Marchmain sat and wiped his eyes. “It’s the cold,” he said. “I’d forgotten how cold it is in England. Quite bowled me over.” “Can I get you anything, my lord?” “Nothing, thank you. Cara, where are those confounded pills?” “Alex, the doctor said not more than three times a day.” “Damn the doctor. I feel quite bowled over.” Cara produced a blue bottle from her bag and Lord Marchmain took a pill. Whatever was in it, seemed to revive him. He remained seated, his long legs stuck out before him, his cane between them, his chin on its ivory handle, but he began to take notice of us all, to greet us and to give orders. “I’m afraid I’m not at all the thing today; the journey’s taken it out of me. Ought to have waited a night at Dover. Wilcox, what rooms have you prepared for me?” “Your old ones, my Lord.” “Won’t do; not till I’m fit again. Too many stairs; must be on the ground floor. Plender, get a bed made up for me downstairs.” Plender and Wilcox exchanged an anxious glance. “Very good, my Lord. Which room shall we put it in?” Lord Marchmain thought for a moment. “The Chinese drawing-room; and, Wilcox, the ‘Queen’s bed.’ ” “The Chinese drawing-room, my lord, the ‘Queen’s bed’?” “Yes, yes. I may be spending some time there in the next few weeks.” The Chinese drawing-room was one I had never seen used; in fact one could not normally go further into it than a small roped area round the door, where sight-seers were corralled on the days the house was open to the public; it was a splendid, uninhabitable museum of Chippendale carving and porcelain and lacquer and painted hangings; the Queen’s bed, too, was an exhibition piece, a vast velvet tent like the baldachino at St. Peter’s. Had Lord Marchmain planned this lying-in-state for himself, I wondered, before he left the sunshine of Italy? Had he thought of it during the scudding rain of his long, fretful journey? Had it come to him at that moment, an awakened memory of childhood, a dream in the nursery—“When I’m grown up I’ll sleep in the Queen’s bed in the Chinese drawing-room”—the apotheosis of adult grandeur? Few things, certainly, could have caused more stir in the house. What had been foreseen as a day of formality became one of fierce exertion; housemaids began making a fire, removing covers, unfolding linen; men in aprons, never normally seen, shifted furniture; the estate carpenters werecollected to dismantle the bed. It came down the main staircase in pieces, at intervals during the afternoon; huge sections of Rococo, velvet-covered cornice; the twisted, gilt and velvet columns which formed its posts; beams of unpolished wood, made not to be seen, which performed invisible, structural functions below the draperies; plumes of dyed feathers, which sprang from gold-mounted ostrich eggs and crowned the canopy; finally, the mattresses with four toiling men to each. Lord Marchmain seemed to derive comfort from the consequences of his whim; he sat by the fire watching the bustle, while we stood in a half circle—Cara, Cordelia, Julia, and I—and talked to him. Color came back to his cheeks and light to his eyes. “Brideshead and his wife dined with me in Rome,” he said. “Since we are all members of the family”—and his eye moved ironically from Cara to me—“I can speak without reserve. I found her deplorable. Her former consort, I understand, was a seafaring man and, presumably, the less exacting, but how my son, at the ripe age of thirty-eight, with, unless things have changed very much, a very free choice among the women of England, can have settled on—I suppose I must call her so— Beryl …” He left the sentence eloquently unfinished. Lord Marchmain showed no inclination to move, so presently we drew up chairs—the little, heraldic chairs, for everything else in the hall was ponderous—and sat round him. “I daresay I shall not be really fit again until summer comes,” he said. “I look to you four to amuse me.” There seemed little we could do at the moment to lighten the rather somber mood; he, indeed, was the most cheerful of us. “Tell me,” he said, “the circumstances of Brideshead’s courtship.” We told him what we knew. “Match-boxes,” he said. “Match-boxes. I think she’s past child-bearing.” Tea was brought us at the hall fireplace. “In Italy,” he said, “no one believes there will be a war. They think it will all be ‘arranged.’ I suppose, Julia, you no longer have access to political information? Cara, here, is fortunately a British subject by marriage. It is not a thing she customarily mentions, but it may prove valuable. She is legally Mrs. Hicks, are you not, my dear? We know little of Hicks, but we shall be grateful to him, none the less, if it comes to war. And you,” he said, turning the attack to me, “you will no doubt become an official artist?” “No. As a matter of fact I am negotiating now for a commission in the Special Reserve.” “Oh, but you should be an artist. I had one with my squadron during the last war, for weeks—until we went up to the line.”This waspishness was new. I had always been aware of a frame of malevolence under his urbanity; now it protruded like his own sharp bones through the sunken skin. It was dark before the bed was finished; we went to see it, Lord Marchmain stepping quite briskly now through the intervening rooms. “I congratulate you. It really looks remarkably well. Wilcox, I seem to remember a silver basin and ewer—they stood in a room we called ‘the Cardinal’s dressing-room,’ I think—suppose we had them here on the console. Then if you will send Plender and Gaston to me, the luggage can wait till tomorrow—simply the dressing case and what I need for the night. Plender will know. If you will leave me with Plender and Gaston, I will go to bed. We will meet later; you will dine here and keep me amused.” We turned to go; as I was at the door he called me back. “It looks very well, does it not?” “Very well.” “You might paint it, eh—and call it the Death Bed ?” “Yes,” said Cara, “he has come home to die.” “But when he first arrived he was talking so confidently of recovery.” “That was because he was so ill. When he is himself, he knows he is dying and accepts it. His sickness is up and down; one day, sometimes for several days on end, he is strong and lively and then he is ready for death, then he is down and afraid. I do not know how it will be when he is more and more down. That must come in good time. The doctors in Rome gave him less than a year. There is someone coming from London, I think tomorrow, who will tell us more.” “What is it?” “His heart; some long word at the heart. He is dying of a long word.” That evening Lord Marchmain was in good spirits; the room had a Hogarthian aspect, with the dinner-table set for the four of us by the grotesque, chinoiserie chimney-piece, and the old man propped among his pillows, sipping champagne, tasting, praising, and failing to eat, the succession of dishes which had been prepared for his homecoming. Wilcox had brought out for the occasion the gold plate, which I had not before seen in use; that, the gilt mirrors, and the lacquer and the drapery of the great bed and Julia’s mandarin coat gave the scene an air of pantomime, of Aladdin’s cave. Just at the end, when the time came for us to go, his spirits flagged. “I shall not sleep,” he said. “Who is going to sit with me? Cara, carissima,you are fatigued. Cordelia, will you watch for an hour in this Gethsemane?” Next morning I asked her how the night had passed. “He went to sleep almost at once. I came in to see him at two to make up the fire; the lights were on, but he was asleep again. He must have woken up and turned them on; he had to get out of bed to do that. I think perhaps he is afraid of the dark.” It was natural, with her hospital experience, that Cordelia should take charge of her father. When the doctors came that day they gave their instructions to her, instinctively. “Until he gets worse,” she said, “I and the valet can look after him. We don’t want nurses in the house before they are needed.” At this stage the doctors had nothing to recommend except to keep him comfortable and administer certain drugs when his attacks came on. “How long will it be?” “Lady Cordelia, there are men walking about in hearty old age whom their doctors gave a week to live. I have learned one thing in medicine; never prophesy.” These two men had made a long journey to tell her this; the local doctor was there to accept the same advice in technical phrases. That night Lord Marchmain reverted to the topic of his new daughter-in- law; it had never been long out of his mind, finding expression in various sly hints throughout the day; now he lay back in his pillows and talked of her at length. “I have never been much moved by family piety until now,” he said, “but I am frankly appalled at the prospect of—of Beryl taking what was once my mother’s place in this house. Why should that uncouth pair sit here childless while the place crumbles about their ears? I will not disguise from you that I have taken a dislike to Beryl. “Perhaps it was unfortunate that we met in Rome. Anywhere else might have been more sympathetic. And yet, if one comes to consider it, where could I have met her without repugnance? We dined at Ranieri’s; it is a quiet little restaurant I have frequented for years—no doubt you know it. Beryl seemed to fill the place. I, of course, was host, though to hear Beryl press my son with food, you might have thought otherwise. Brideshead was always a greedy boy; a wife who has his best interests at heart should seek to restrain him. However, that is a matter of small importance. “She had no doubt heard of me as a man of irregular life. I can only describe her manner to me as roguish. A naughty old man, that’s what she thought I was. I suppose she had met naughty old admirals and knew how they should be humored…. I could not attempt to reproduce her conversation.I will give you one example. “They had been to an audience at the Vatican that morning; a blessing for their marriage—I did not follow attentively—something of the kind had happened before, I gathered, some previous husband, some previous Pope. She described, rather vivaciously, how on this earlier occasion she had gone with a whole body of newly married couples, mostly Italians of all ranks, some of the simpler girls in their wedding dresses, and how each had appraised the other, the bridegrooms looking the brides over, comparing their own with one another’s, and so forth. Then she said, ‘This time, of course, we were in private, but do you know, Lord Marchmain, I felt as though it was I who was leading in the bride.’ “It was said with great indelicacy. I have not yet quite fathomed her meaning. Was she making a play on my son’s name, or was she, do you think, referring to his undoubted virginity? I fancy the latter. Anyway, it was with pleasantries of that kind that we passed the evening. “I don’t think she would be quite in her proper element here, do you? Who shall I leave it to? The entail ended with me, you know. Sebastian, alas, is out of the question. Who wants it? Quis ? Would you like it, Cara? No, of course you would not. Cordelia? I think I shall leave it to Julia and Charles.” “Of course not, papa, it’s Bridey’s.” “And… Beryl’s? I will have Gregson down one day soon and go over the matter. It is time I brought my will up to date; it is full of anomalies and anachronisms…. I have rather a fancy for the idea of installing Julia here; so beautiful this evening, my dear; so beautiful always; much, much more suitable.” Shortly after this he sent to London for his solicitor, but, on the day he came, Lord Marchmain was suffering from an attack and would not see him. “Plenty of time,” he said, between painful gasps for breath, “another day, when I am stronger,” but the choice of his heir was constantly in his mind, and he referred often to the time when Julia and I should be married and in possession. “Do you think he really means to leave it to us?” I asked Julia. “Yes, I think he does.” “But it’s monstrous for Bridey.” “Is it? I don’t think he cares much for the place. I do, you know. He and Beryl would be much more content in some little house somewhere.” “You mean to accept it?” “Certainly. It’s papa’s to leave as he likes. I think you and I could be very happy here.” It opened a prospect; the prospect one gained at the turn of the avenue, as Ihad first seen it with Sebastian, of the secluded valley, the lakes falling away one below the other, the old house in the foreground, the rest of the world abandoned and forgotten; a world of its own of peace and love and beauty; a soldier’s dream in a foreign bivouac; such a prospect perhaps as a high pinnacle of the temple afforded after the hungry days in the desert and the jackal-haunted nights. Need I reproach myself if sometimes I was taken by the vision? The weeks of illness wore on and the life of the house kept pace with the faltering strength of the sick man. There were days when Lord Marchmain was dressed, when he stood at the window or moved on his valet’s arm from fire to fire through the rooms of the ground floor, when visitors came and went—neighbors and people from the estate, men of business from London— parcels of new books were opened and discussed, a piano was moved into the Chinese drawing-room; once at the end of February, on a single, unexpected day of brilliant sunshine, he called for a car and got as far as the hall, had on his fur coat, and reached the front door. Then suddenly he lost interest in the drive, said ‘Not now. Later. One day in the summer,” took his man’s arm again and was led back to his chair. Once he had the humor of changing his room and gave detailed orders for a move to the Painted Parlor; the chinoiserie, he said, disturbed his rest—he kept the lights full on at night— but again lost heart, countermanded everything, and kept his room. On other days the house was hushed as he sat high in bed, propped by his pillows, with laboring breath; even then he wanted to have us round him; night or day he could not bear to be alone; when he could not speak his eyes followed us, and if anyone left the room he would look distressed, and Cara, sitting often for hours at a time by his side against the pillows with an arm in his, would say, “It’s all right, Alex, she’s coming back.” Brideshead and his wife returned from their honeymoon and stayed a few nights; it was one of the bad times, and Lord Marchmain refused to have them near him. It was Beryl’s first visit, and she would have been unnatural if she had shown no curiosity about what had nearly been, and now again promised soon to be, her home. Beryl was natural enough, and surveyed the place fairly thoroughly in the days she was there. In the strange disorder caused by Lord Marchmain’s illness, it must have seemed capable of much improvement; she referred once or twice to the way in which establishments of similar size had been managed at various Government Houses she had visited. Brideshead took her visiting among the tenants by day, and in the evenings, she talked to me of painting, or to Cordelia of hospitals, or to Julia of clothes, with cheerful assurance. The shadow of betrayal, the knowledge of how precarious were their just expectations, was all one-sided. I was not easy with them; but thatwas no new thing to Brideshead; in the little circle of shyness in which he was used to move, my guilt passed unseen. Eventually it became clear that Lord Marchmain did not intend to see more of them. Brideshead was admitted alone for a minute’s leave-taking; then they left. “There’s nothing we can do here,” said Brideshead, “and it’s very distressing for Beryl. We’ll come back if things get worse.” The bad spells became longer and more frequent; a nurse was engaged. “I never saw such a room,” she said, “nothing like it anywhere; no conveniences of any sort.” She tried to have her patient moved upstairs, where there was running water, a dressing-room for herself, a “sensible” narrow bed she could “get round”—what she was used to—but Lord Marchmain would not budge. Soon, as days and nights became indistinguishable to him, a second nurse was installed; the specialists came again from London; they recommended a new and rather daring treatment, but his body seemed weary of all drugs and did not respond. Presently there were no good spells, merely brief fluctuations in the speed of his decline. Brideshead was called. It was the Easter holidays and Beryl was busy with her children. He came alone, and having stood silently for some minutes beside his father, who sat silently looking at him, he left the room and, joining the rest of us, who were in the library, said, “Papa must see a priest.” It was not the first time the topic had come up. In the early days, when Lord Marchmain first arrived, the parish priest—since the chapel was shut there was a new church and presbytery in Melstead—had come to call as a matter of politeness. Cordelia had put him off with apologies and excuses, but when he was gone she said: “Not yet. Papa doesn’t want him yet.” Julia, Cara, and I were there at the time; we each had something to say, began to speak, and thought better of it. It was never mentioned between the four of us, but Julia, alone with me, said, “Charles, I see great Church trouble ahead.” “Can’t they even let him die in peace?” “They mean something so different by ‘peace.’ ” “It would be an outrage. No one could have made it clearer, all his life, what he thought of religion. They’ll come now, when his mind’s wandering and he hasn’t the strength to resist, and claim him as a death-bed penitent. I’ve had a certain respect for their Church up till now. If they do a thing like that I shall know that everything stupid people say about them is quite true— that it’s all superstition and trickery.” Julia said nothing. “Don’t you agree?” Still Julia said nothing. “Don’t you agree?” “I don’t know, Charles. I simply don’t know.”And, though none of us spoke of it, I felt the question ever present, growing through all the weeks of Lord Marchmain’s illness; I saw it when Cordelia drove off early in the mornings to mass; I saw it as Cara took to going with her; this little cloud, the size of a man’s hand, that was going to swell into a storm among us. Now Brideshead, in his heavy, ruthless way, planted the problem down before us. “Oh, Bridey, do you think he would?” asked Cordelia. “I shall see that he does,” said Brideshead. “I shall take Father Mackay in to him tomorrow.” Still the clouds gathered and did not break; none of us spoke. Cara and Cordelia went back to the sickroom; Brideshead looked for a book, found one, and left us. “Julia,” I said, “how can we stop this tomfoolery?” She did not answer for some time; then: “Why should we?” “You know as well as I do. It’s just—just an unseemly incident.” “Who am I to object to unseemly incidents?” she asked sadly. “Anyway, what harm can it do? Let’s ask the doctor.” We asked the doctor, who said: “It’s hard to say. It might alarm him of course; on the other hand, I have known cases where it has had a wonderfully soothing effect on a patient; I’ve even known it act as a positive stimulant. It certainly is usually a great comfort to the relations. Really I think it’s a thing for Lord Brideshead to decide. Mind you, there is no need for immediate anxiety. Lord Marchmain is very weak today; tomorrow he may be quite strong again. Is it not usual to wait a little?” “Well, he wasn’t much help,” I said to Julia, when we left him. “Help? I really can’t quite see why you’ve taken it so much to heart that my father shall not have the last sacraments.” “It’s such a lot of witchcraft and hypocrisy.” “Is it? Anyway, it’s been going on for nearly two thousand years. I don’t know why you should suddenly get in a rage now.” Her voice rose; she was swift to anger of late months. “For Christ’s sake, write to The Times; get up and make a speech in Hyde Park; start a ‘No Popery’ riot, but don’t bore me about it. What’s it got to do with you or me whether my father sees his parish priest?” I knew these fierce moods of Julia’s, such as had overtaken her at the fountain in moonlight, and dimly surmised their origin; I knew they could not be assuaged by words. Nor could I have spoken, for the answer to her question was still unformed; the sense that the fate of more souls than one was at issue; that the snow was beginning to shift on the high slopes.Brideshead and I breakfasted together next morning with the night-nurse, who had just come off duty. “He’s much brighter today,” she said. “He slept very nicely for nearly three hours. When Gaston came to shave him he was quite chatty.” “Good,” said Brideshead. “Cordelia went to mass. She’s driving Father Mackay back here to breakfast.” I had met Father Mackay several times; he was a stocky, middle-aged, genial Glasgow-Irishman who, when we met, was apt to ask me such questions as, “Would you say now, Mr. Ryder, that the painter Titian was more truly artistic than the painter Raphael?” and, more disconcertingly still, to remember my answers: “To revert, Mr. Ryder, to what you said when last I had the pleasure to meet you, would it be right now to say that the painter Titian…” usually ending with some such reflection as: “Ah, it’s a grand resource for a man to have the talent you have, Mr. Ryder, and the time to indulge it.” Cordelia could imitate him. This morning he made a hearty breakfast, glanced at the headlines of the paper, and then said with professional briskness: “And now, Lord Brideshead, would the poor soul be ready to see me, do you think?” Brideshead led him out; Cordelia followed, and I was left alone among the breakfast things. In less than a minute I heard the voices of all three outside the door. “… can only apologize.” “… poor soul. Mark you, it was seeing a strange face; depend upon it, it was that—an unexpected stranger. I well understand it.” “… Father, I am sorry… bringing you all this way…” “Don’t think about it at all, Lady Cordelia. Why, I’ve had bottles thrown at me in the Gorbals…. Give him time. I’ve known worse cases make beautiful deaths. Pray for him…. I’ll come again… and now if you’ll excuse me I’ll just pay a little visit to Mrs. Hawkins. Yes, indeed, I know the way well.” Then Cordelia and Brideshead came into the room. “I gather the visit was not a success.” “It was not. Cordelia, will you drive Father Mackay home when he comes down from nanny? I’m going to telephone to Beryl and see when she needs me home.” “Bridey, it was horrible. What are we to do?” “We’ve done everything we can at the moment.” He left the room. Cordelia’s face was grave; she took a piece of bacon from the dish, dipped it in mustard and ate it. “Damn Bridey,” she said, “I knew it wouldn’t work.”“What happened?” “Would you like to know? We walked in there in a line; Cara was reading the paper aloud to papa. Bridey said, “I’ve brought Father Mackay to see you”; papa said, “Father Mackay, I am afraid you have been brought here under a misapprehension. I am not in extremis, and I have not been a practicing member of your Church for twenty-five years. Brideshead, show Father Mackay the way out.” Then we all turned about and walked away, and I heard Cara start reading the paper again, and that, Charles, was that.” I carried the news to Julia, who lay with her bed-table amid a litter of newspapers and envelopes. “Mumbo-jumbo is off,” I said. “The witch-doctor has gone.” “Poor papa.” “It’s great sucks to Bridey.” I felt triumphant. I had been right, everyone else had been wrong, truth had prevailed; the threat that I had felt hanging over Julia and me ever since that evening at the fountain, had been averted, perhaps dispelled for ever; and there was also—I can now confess it—another unexpressed, inexpressible, indecent little victory that I was furtively celebrating. I guessed that that morning’s business had put Brideshead some considerable way further from his rightful inheritance. In that I was correct; a man was sent for from the solicitors in London; in a day or two he came and it was known throughout the house that Lord Marchmain had made a new will. But I was wrong in thinking that the religious controversy was quashed; it flamed up again after dinner on Brideshead’s last evening. “… What papa said was, ‘I am not in extremis, I have not been a practicing member of the Church for twenty-five years.’ ” “Not ‘ the Church,’ ‘your Church.’ ” “I don’t see the difference.” “There’s every difference.” “Bridey, it’s quite plain what he meant.” “I presume he meant what he said. He meant that he had not been accustomed regularly to receive the sacraments, and since he was not at the moment dying, he did not mean to change his ways— yet.” “That’s simply a quibble.” “Why do people always think that one is quibbling when one tries to be precise? His plain meaning was that he did not want to see a priest that day, but that he would when he was ‘ in extremis. ’ ” “I wish someone would explain to me,” I said, “quite what the significance of these sacraments is. Do you mean that if he dies alone he goes to hell, andthat if a priest puts oil on him—” “Oh, it’s not the oil,” said Cordelia, “that’s to heal him.” “Odder still—well, whatever it is the priest does—that he then goes to heaven. Is that what you believe?” Cara then interposed: “I think my nurse told me, someone did anyway, that if the priest got there before the body was cold it was all right. That’s so, isn’t it?” The others turned on her. “No, Cara, it’s not.” “Of course not.” “You’ve got it all wrong, Cara.” “Well, I remember when Alphonse de Grenet died, Madame de Grenet had a priest hidden outside the door—he couldn’t bear the sight of a priest—and brought him in before the body was cold; she told me herself, and they had a full Requiem for him, and I went to it.” “Having a Requiem doesn’t mean you go to heaven necessarily.” “Madame de Grenet thought it did.” “Well, she was wrong.” “Do any of you Catholics know what good you think this priest can do?” I asked. “Do you simply want to arrange it so that your father can have Christian burial? Do you want to keep him out of hell? I only want to be told.” Brideshead told me at some length, and when he had finished Cara slightly marred the unity of the Catholic front by saying in simple wonder, “I never heard that before.” “Let’s get this clear,” I said; “he has to make an act of will; he has to be contrite and wish to be reconciled; is that right? But only God knows whether he has really made an act of will; the priest can’t tell; and if there isn’t a priest there, and he makes the act of will alone, that’s as good as if there were a priest. And it’s quite possible that the will may still be working when a man is too weak to make any outward sign of it; is that right? He may be lying, as though for dead, and willing all the time, and being reconciled, and God understands that; is that right?” “More or less,” said Brideshead. “Well, for heaven’s sake,” I said, “what is the priest for?” There was a pause in which Julia sighed and Brideshead drew breath as though to start further subdividing the propositions. In the silence Cara said, “All I know is that I shall take very good care to have a priest.” “Bless you,” said Cordelia, “I believe that’s the best answer.” And we let the argument drop, each for different reasons, thinking it hadbeen inconclusive. Later Julia said: “I wish you wouldn’t start these religious arguments.” “I didn’t start it.” “You don’t convince anyone else and you don’t really convince yourself.” “I only want to know what these people believe. They say it’s all based on logic.” “If you’d let Bridey finish, he would have made it all quite logical.” “There were four of you,” I said. “Cara didn’t know the first thing it was about, and may or may not have believed it; you knew a bit and didn’t believe a word; Cordelia knew about as much and believed it madly; only poor Bridey knew and believed, and I thought he made a pretty poor show when it came to explaining. And people go round saying, ‘At least Catholics know what they believe.’ We had a fair cross-section tonight—” “Oh, Charles, don’t rant. I shall begin to think you’re getting doubts yourself.” The weeks passed and still Lord Marchmain lived on. In June my divorce was made absolute and my former wife married for the second time. Julia would be free in September. The nearer our marriage got, the more wistfully, I noticed, Julia spoke of it; war was growing nearer, too—we neither of us doubted that—but Julia’s tender, remote, it sometimes seemed, desperate longing did not come from any uncertainty outside herself; it suddenly darkened, too, into brief accesses of hate when she seemed to throw herself against the restraints of her love for me like a caged animal against the bars. I was summoned to the War Office, interviewed, and put on a list in case of emergency; Cordelia also, on another list; lists were becoming part of our lives once more, as they had been at school. Everything was being got ready for the coming “Emergency.” No one in that dark office spoke the word “war”; it was taboo; we should be called for if there was “an emergency”— not in case of strife, an act of human will; nothing so clear and simple as wrath or retribution; an emergency; something coming out of the waters, a monster with sightless face and thrashing tail thrown up from the depths. Lord Marchmain took little interest in events outside his own room; we took him the papers daily and made the attempt to read to him, but he turned his head on the pillows and with his eyes followed the intricate patterns about him. “Shall I go on?” “Please do if it’s not boring you.” But he was not listening; occasionally at a familiar name he would whisper: “Irwin… I knew him—a mediocre fellow”; occasionally some remote comment: “Czechsmake good coachmen; nothing else”; but his mind was far from world affairs; it was there, on the spot, turned in on himself; he had no strength for any other war than his own solitary struggle to keep alive. I said to the doctor, who was with us daily: “He’s got a wonderful will to live, hasn’t he?” “Would you put it like that? I should say a great fear of death.” “Is there a difference?” “Oh dear, yes. He doesn’t derive any strength from his fear, you know. It’s wearing him out.” Next to death, perhaps because they are like death, he feared darkness and loneliness. He liked to have us in his room and the lights burnt all night among the gilt figures; he did not wish us to speak much, but he talked himself, so quietly that we often could not hear him; he talked, I think, because his was the only voice he could trust, when it assured him that he was still alive; what he said was not for us, nor for any ears but his own. “Better today. Better today. I can see now, in the corner of the fireplace, where the mandarin is holding his gold bell and the crooked tree is in flower below his feet, where yesterday I was confused and took the little tower for another man. Soon I shall see the bridge and the three storks and know where the path leads over the hill. “Better tomorrow. We live long in our family and marry late. Seventy- three is no great age. Aunt Julia, my father’s aunt, lived to be eighty-eight, born and died here, never married, saw the fire on beacon hill for the battle of Trafalgar, always called it ‘the New House’; that was the name they had for it in the nursery and in the fields when unlettered men had long memories. You can see where the old house stood near the village church; they call the field ‘Castle Hill,’ Horlick’s field where the ground’s uneven and half of it is waste, nettle, and brier in hollows too deep for plowing. They dug to the foundations to carry the stone for the new house; the house that was a century old when Aunt Julia was born. Those were our roots in the waste hollows of Castle Hill, in the brier and nettle; among the tombs in the old church and the chantry where no clerk sings. “Aunt Julia knew the tombs, cross-legged knight and doubleted earl, marquis like a Roman senator, limestone, alabaster, and Italian marble; tapped the escutcheons with her ebony cane, made the casque ring over old Sir Roger. We were knights then, barons since Agincourt, the larger honors came with the Georges. They came the last and they’ll go the first; the barony goes on. When all of you are dead Julia’s son will be called by the name his fathers bore before the fat days; the days of wool shearing and the wide corn lands, the days of growth and building, when the marshes were drained and thewaste land brought under the plow, when one built the house, his son added the dome, his son spread the wings and dammed the river. Aunt Julia watched them build the fountain; it was old before it came here, weathered two hundred years by the suns of Naples, brought by man-o’-war in the days of Nelson. Soon the fountain will be dry till the rain fills it, setting the fallen leaves afloat in the basin; and over the lakes the reeds will spread and close. Better today. “Better today. I have lived carefully, sheltered myself from the cold winds, eaten moderately of what was in season, drunk fine claret, slept in my own sheets; I shall live long. I was fifty when they dismounted us and sent us into the line; old men stay at the base, the orders said, but Walter Venables, my commanding officer, my nearest neighbor, said: “You’re as fit as the youngest of them, Alex.” So I was; so I am now, if I could only breathe. “No air; no wind stirring under the velvet canopy. When the summer comes,” said Lord Marchmain, oblivious of the deep corn and swelling fruit and the surfeited bees who slowly sought their hives in the heavy afternoon sunlight outside his windows, “when the summer comes, I shall leave my bed and sit in the open air and breathe more easily. “Who would have thought that all these little gold men, gentlemen in their own country, could live so long without breathing? Like toads in the coal, down a deep mine, untroubled. God take it, why have they dug a hole for me? Must a man stifle to death in his own cellars? Plender, Gaston, open the windows.” “The windows are all wide open, my lord.” A cylinder of oxygen was placed beside his bed, with a long tube, a face- piece, and a little stop-cock he could work himself. Often he said: “It’s empty; look nurse, there’s nothing comes out.” “No, Lord Marchmain, it’s quite full; the bubble here in the glass bulb shows that; it’s at full pressure; listen, don’t you hear it hiss? Try and breathe slowly, Lord Marchmain; quite gently, then you get the benefit.” “Free as air; that’s what they say—‘free as air.’ Now they bring me my air in an iron barrel.” Once he said: “Cordelia, what became of the chapel?” “They locked it up, papa, when mummy died.” “It was hers, I gave it to her. We’ve always been builders in our family. I built it for her; in the shade of the pavilion; rebuilt with the old stones behind the old walls; it was the last of the new house to come, the first to go. There used to be a chaplain until the war. Do you remember him?” “I was too young.” “Then I went away—left her in the chapel praying. It was hers. It was theplace for her. I never came back to disturb her prayers. They said we were fighting for freedom; I had my own victory. Was it a crime?” “I think it was, papa.” “Crying to heaven for vengeance? Is that why they’ve locked me in this cave, do you think, with a black tube of air and the little yellow men along the walls, who live without breathing? Do you think that, child? But the wind will come soon, tomorrow perhaps, and we’ll breathe again. The ill wind that will blow me good. Better tomorrow.” Thus, till mid-July, Lord Marchmain lay dying, wearing himself down in the struggle to live. Then, since there was no reason to expect an immediate change, Cordelia went to London to see her women’s organization about the coming “emergency.” That day Lord Marchmain became suddenly worse. He lay silent and quite still, breathing laboriously; only his open eyes, which sometimes moved about the room, gave any sign of consciousness. “Is this the end?” Julia asked. “It is impossible to say,” the doctor answered; “when he does die it will probably be like this. He may recover from the present attack. The only thing is not to disturb him. The least shock will be fatal.” “I’m going for Father Mackay,” she said. I was not surprised. I had seen it in her mind all the summer. When she had gone I said to the doctor, “We must stop this nonsense.” He said: “My business is with the body. It’s not my business to argue whether people are better alive or dead, or what happens to them after death. I only try to keep them alive.” “And you said just now any shock would kill him. What could be worse for a man who fears death, as he does, than to have a priest brought to him—a priest he turned out when he had the strength?” “I think it may kill him.” “Then will you forbid it?” “I’ve no authority to forbid anything. I can only give my opinion.” “Cara, what do you think?” “I don’t want him made unhappy. That is all there is to hope for now; that he’ll die without knowing it. But I should like the priest there, all the same.” “Will you try and persuade Julia to keep him away—until the end? After that he can do no harm.” “I will ask her to leave Alex happy, yes.” In half an hour Julia was back with Father Mackay. We all met in the library. “I’ve telegraphed for Bridey and Cordelia,” I said. “I hope you agree that nothing must be done",
      "density_breakdown": {
        "Metaphor": 2.741514360313316,
        "Simile": 2.0887728459530024,
        "Imagery": 7.9634464751958225,
        "Symbolism": 7.832898172323759,
        "Dialogue": 0.0,
        "Foreshadowing": 11.74934725848564,
        "Juxtaposition": 7.702349869451697,
        "Repetition": 6.005221932114883,
        "TOTAL_DENSITY": 46.08355091383812
      }
    },
    "resolution": {
      "chapter_range": "15",
      "narrative_primary": 15,
      "optimized_primary": 15,
      "device_density_score": 45.822454308093995,
      "improvement_percent": 0.0,
      "optimization_applied": false,
      "chapter_text": "till they arrive.”“I wish they were here,” said Julia. “You can’t take the responsibility alone,” I said; “everyone else is against you. Doctor Grant, tell her what you said to me just now.” “I said that the shock of seeing a priest might well kill him; without that he may survive this attack. As his medical man I must protest against anything being done to disturb him.” “Cara?” “Julia, dear, I know you are thinking for the best, but, you know, Alex was not a religious man. He scoffed always. We mustn’t take advantage of him, now he’s weak, to comfort our own consciences. If Father Mackay comes to him when he is unconscious, then he can be buried in the proper way, can he not, Father?” “I’ll go and see how he is,” said the doctor, leaving us. “Father Mackay,” I said. “You know how Lord Marchmain greeted you last time you came; do you think it possible he can have changed now?” “Thank God, by his grace it is possible.” “Perhaps,” said Cara, “you could slip in while he is sleeping, say the words of absolution over him; he would never know.” “I have seen so many men and women die,” said the priest; “I never knew them sorry to have me there at the end.” “But they were Catholics; Lord Marchmain has never been one except in name—at any rate, not for years. He was a scoffer, Cara said so.” “Christ came to call, not the righteous, but sinners to repentance.” The doctor returned. “There’s no change,” he said. “Now doctor,” said the priest, “how would I be a shock to anyone?” He turned his bland, innocent, matter-of-fact face first on the doctor, then upon the rest of us. “Do you know what I want to do? It is something so small, no show about it. I don’t wear special clothes, you know. I go just as I am. He knows the look of me now. There’s nothing alarming. I just want to ask him if he is sorry for his sins. I want him to make some little sign of assent; I want him, anyway, not to refuse me; then I want to give him God’s pardon. Then, though that’s not essential, I want to anoint him. It is nothing, a touch of the fingers, just some oil from this little box, look, it is nothing to hurt him.” “Oh, Julia,” said Cara, “what are we to say? Let me speak to him.” She went to the Chinese drawing-room; we waited in silence; there was a wall of fire between Julia and me. Presently Cara returned. “I don’t think he heard,” she said. “I thought I knew how to put it to him. I said: ‘Alex, you remember the priest from Melstead. You were very naughty when he came to see you. You hurt his feelings very much. Now he’s here again. I want you to see him just for my sake, to make friends.’ But he didn’tanswer. If he’s unconscious, it couldn’t make him unhappy to see the priest, could it, doctor?” Julia, who had been standing still and silent, suddenly moved. “Thank you for your advice, doctor,” she said. “I take full responsibility for whatever happens. Father Mackay, will you please come and see my father now,” and without looking at me, led him to the door. We all followed. Lord Marchmain was lying as I had seen him that morning, but his eyes were now shut; his hands lay, palm upwards, above the bed-clothes; the nurse had her fingers on the pulse of one of them. “Come in,” she said brightly, “you won’t disturb him now.” “D’you mean… ?” “No, no, but he’s past noticing anything.” She held the oxygen apparatus to his face and the hiss of escaping gas was the only sound at the bedside. The priest bent over Lord Marchmain and blessed him. Julia and Cara knelt at the foot of the bed. The doctor, the nurse, and I stood behind them. “Now,” said the priest, “I know you are sorry for all the sins of your life, aren’t you? Make a sign, if you can. You’re sorry, aren’t you?” But there was no sign. “Try and remember your sins; tell God you are sorry. I am going to give you absolution. While I am giving it, tell God you are sorry you have offended him.” He began to speak in Latin. I recognized the words “ego te absolvo in nomine Patris…” and saw the priest make the sign of the cross. Then I knelt, too, and prayed: “O God, if there is a God, forgive him his sins, if there is such a thing as sin,” and the man on the bed opened his eyes and gave a sigh, the sort of sigh I had imagined people made at the moment of death, but his eyes moved so that we knew there was still life in him. I suddenly felt the longing for a sign, if only of courtesy, if only for the sake of the woman I loved, who knelt in front of me, praying, I knew, for a sign. It seemed so small a thing that was asked, the bare acknowledgment of a present, a nod in the crowd. I prayed more simply; “God forgive him his sins” and “Please God, make him accept your forgiveness.” So small a thing to ask. The priest took the little silver box from his pocket and spoke again in Latin, touching the dying man with an oily wad; he finished what he had to do, put away the box and gave the final blessing. Suddenly Lord Marchmain moved his hand to his forehead; I thought he had felt the touch of the chrism and was wiping it away. “O God,” I prayed, “don’t let him do that.” But there was no need for fear; the hand moved slowly down his breast, then to his shoulder, and Lord Marchmain made the sign of the cross. Then I knew that the sign I had asked for was not a little thing, not a passing nod ofrecognition, and a phrase came back to me from my childhood of the veil of the temple being rent from top to bottom. It was over; we stood up; the nurse went back to the oxygen cylinder; the doctor bent over his patient. Julia whispered to me: “Will you see Father Mackay out? I’m staying here for a little.” Outside the door Father Mackay became the simple, genial man I had known before. “Well, now, and that was a beautiful thing to see. I’ve known it happen that way again and again. The devil resists to the last moment and then the Grace of God is too much for him. You’re not a Catholic I think, Mr. Ryder, but at least you’ll be glad for the ladies to have the comfort of it.” As we were waiting for the chauffeur, it occurred to me that Father Mackay should be paid for his services. I asked him awkwardly. “Why, don’t think about it, Mr. Ryder. It was a pleasure,” he said, “but anything you care to give is useful in a parish like mine.” I found I had three pounds in my note- case and gave them to him. “Why, indeed, that’s more than generous. God bless you, Mr. Ryder. I’ll call again, but I don’t think the poor soul has long for this world.” Julia remained in the Chinese drawing-room until, at five o’clock that evening, her father died, proving both sides right in the dispute, priest and doctor. Thus I come to the broken sentences which were the last words spoken between Julia and me, the last memories. When her father died Julia remained some minutes with his body; the nurse came to the next room to announce the news and I had a glimpse of her through the open door, kneeling at the foot of the bed, and of Cara sitting by her. Presently the two women came out together, and Julia said to me: “Not now; I’m just taking Cara up to her room; later.” While she was still upstairs Brideshead and Cordelia arrived from London; when at last we met alone it was by stealth, like young lovers. Julia said: “Here in the shadow, in the corner of the stair—a minute to say good-bye.” “So long to say so little.” “You knew?” “Since this morning; since before this morning; all this year.” “I didn’t know till today. Oh, my dear, if you could only understand. Then I could bear to part, or bear it better. I should say my heart was breaking, if I believed in broken hearts. I can’t marry you, Charles; I can’t be with you everagain.” “I know.” “How can you know?” “What will you do?” “Just go on—alone. How can I tell what I shall do? You know the whole of me. You know I’m not one for a life of mourning. I’ve always been bad. Probably I shall be bad again, punished again. But the worse I am, the more I need God. I can’t shut myself out from his mercy. That is what it would mean; starting a life with you, without him. One can only hope to see one step ahead. But I saw today there was one thing unforgivable—like things in the schoolroom, so bad they were unpunishable, that only mummy could deal with—the bad thing I was on the point of doing, that I’m not quite bad enough to do; to set up a rival good to God’s. Why should I be allowed to understand that, and not you, Charles? It may be because of mummy, nanny, Cordelia, Sebastian—perhaps Bridey and Mrs. Muspratt—keeping my name in their prayers; or it may be a private bargain between me and God, that if I give up this one thing I want so much, however bad I am, he won’t quite despair of me in the end. “Now we shall both be alone, and I shall have no way of making you understand.” “I don’t want to make it easier for you,” I said; “I hope your heart may break; but I do understand.” The avalanche was down, the hillside swept bare behind it; the last echoes died on the white slopes; the new mound glittered and lay still in the silent valley.Epilogue Brideshead Revisited T he worst place we’ve struck yet,” said the commanding officer; “no facilities, no amenities, and Brigade sitting right on top of us. There’s one pub in Flyte St. Mary with capacity for about twenty—that, of course, will be out of bounds for officers; there’s a Naafi in the camp area. I hope to run transport once a week to Melstead Carbury. Marchmain is ten miles away and damn-all when you get there. It will therefore be the first concern of company officers to organize recreation for their men. M.O., I want you to take a look at the lakes to see if they’re fit for bathing.” Very good, sir.” “Brigade expects us to clean up the house for them. I should have thought some of those half-shaven scrimshankers I see lounging round Headquarters might have saved us the trouble; however…. Ryder, you will find a fatigue party of fifty and report to the Quartering Commandant at the house at 1045 hours; he’ll show you what we’re taking over.” “Very good, sir.” “Our predecessors do not seem to have been very enterprising. The valley has great potentialities for an assault course and a mortar range. Weapon- training officer, make a recce this morning and get something laid on before Brigade arrives.” “Very good, sir.” “I’m going out myself with the adjutant to recce training areas. Anyone happen to know this district?” I said nothing. “That’s all then, get cracking.” “Wonderful old place in its way,” said the Quartering Commandant; “pity to knock it about too much.” He was an old, retired, re-appointed lieutenant-colonel from some miles away. We met in the space before the main doors, where I had my half- company fallen-in, waiting for orders. “Come in. I’ll soon show you over. It’s a great warren of a place, but we’ve only requisitioned the ground floor and half a dozen bedrooms. Everything else upstairs is still private property,mostly cram-full of furniture; you never saw such stuff, priceless some of it. “There’s a caretaker and a couple of old servants live at the top—they won’t be any trouble to you—and a blitzed R.C. padre whom Lady Julia gave a home to—jittery old bird, but no trouble. He’s opened the chapel; that’s in bounds for the troops; surprising lot use it, too. “The place belongs to Lady Julia Flyte, as she calls herself now. She was married to Mottram, the Minister of what-ever-it-is. She’s abroad in some woman’s service, and I try to keep an eye on things for her. Queer thing the old marquis leaving everything to her—rough on the boys. “Now this is where the last lot put the clerks; plenty of room, anyway. I’ve had the walls and fireplaces boarded up you see—valuable old work underneath. Hullo, someone seems to have been making a beast of himself here; destructive beggars, soldiers are! Lucky we spotted it, or it would have been charged to you chaps. “This is another good-sized room, used to be full of tapestry. I’d advise you to use this for conferences.” “I’m only here to clean up, sir. Someone from Brigade will allot the rooms.” “Oh, well, you’ve got an easy job. Very decent fellows the last lot. They shouldn’t have done that to the fireplace though. How did they manage it? Looks solid enough. I wonder if it can be mended? “I expect the brigadier will take this for his office; the last did. It’s got a lot of painting that can’t be moved, done on the walls. As you see, I’ve covered it up as best I can, but soldiers get through anything—as the brigadier’s done in the corner. There was another painted room, outside under pillars—modern work but, if you ask me, the prettiest in the place; it was the signal office and they made absolute hay of it; rather a shame. “This eyesore is what they used as the mess; that’s why I didn’t cover it up; not that it would matter much if it did get damaged; always reminds me of one of the costlier knocking-shops, you know—‘ Maison Japonaise ’… and this was the ante-room…” It did not take us long to make our tour of the echoing rooms. Then we went outside on the terrace. “Those are the other ranks’ latrines and wash-house; can’t think why they built them just there; it was done before I took the job over. All this used to be cut off from the front. We laid the road through the trees joining it up with the main drive; unsightly but very practical; awful lot of transport comes in and out; cuts the place up, too. Look where one careless devil went smack through the box-hedge and carried away all that balustrade; did it with a three-ton lorry, too; you’d think he had a Churchill tank at least.“That fountain is rather a tender spot with our landlady; the young officers used to lark about in it on guest nights and it was looking a bit the worse for wear, so I wired it in and turned the water off. Looks a bit untidy now; all the drivers throw their cigarette-ends and the remains of the sandwiches there, and you can’t get to it to clean it up, since I put the wire round it. Florid great thing, isn’t it?… “Well, if you’ve seen everything I’ll push off. Good day to you.” His driver threw a cigarette into the dry basin of the fountain; saluted and opened the door of the car. I saluted and the Quartering Commandant drove away through the new, metaled gap in the lime trees. “Hooper,” I said, when I had seen my men started, “do you think I can safely leave you in charge of the work-party for half an hour?” “I was just wondering where we could scrounge some tea.” “For Christ’s sake,” I said, “they’ve only just begun work.” “They’re awfully browned off.” “Keep them at it.” “Rightyoh.” I did not spend long in the desolate ground-floor rooms, but went upstairs and wandered down the familiar corridors, trying doors that were locked, opening doors into rooms piled to the ceiling with furniture. At length I met an old housemaid carrying a cup of tea. “Why,” she said, “isn’t it Mr. Ryder?” “It is. I was wondering when I should meet someone I know.” “Mrs. Hawkins is up in her old room. I was just taking her some tea.” “I’ll take it for you,” I said, and passed through the baize doors, up the uncarpeted stairs, to the nursery. Nanny Hawkins did not recognize me until I spoke, and my arrival threw her into some confusion; it was not until I had been sitting some time by her fireside that she recovered her old calm. She, who had changed so little in all the years I knew her, had lately become greatly aged. The changes of the last years had come too late in her life to be accepted and understood; her sight was failing, she told me, and she could see only the coarsest needlework. Her speech, sharpened by years of gentle conversation, had reverted now to the soft, peasant tones of its origin. “… only myself here and the two girls and poor Father Membling who was blown up, not a roof to his head nor a stick of furniture till Julia took him in with the kind heart she’s got, and his nerves something shocking… Lady Brideshead, too, Marchmain it is now, who I ought by rights to call her Ladyship now, but it doesn’t come natural, it was the same with her. First, when Julia and Cordelia left to the war, she came here with the two boys and then the military turned them out, so they went to London, nor they hadn’tbeen in their house not a month, and Bridey away with the yeomanry the same as his poor Lordship, when they were blown up too, everything gone, all the furniture she brought here and kept in the coach-house. Then she had another house outside London, and the military took that, too, and there she is now, when I last heard, in a hotel at the seaside, which isn’t the same as your own home, is it? It doesn’t seem right. “… Did you listen to Mr. Mottram last night? Very nasty he was about Hitler. I said to the girl Effie who does for me: ‘If Hitler was listening, and if he understands English, which I doubt, he must feel very small.’ Who would have thought of Mr. Mottram doing so well? And so many of his friends, too, that used to stay here? I said to Mr. Wilcox, who comes to see me regular on the ’bus from Melstead twice a month, which is very good of him and I appreciate it, I said: ‘We were entertaining angels unawares,’ because Mr. Wilcox never liked Mr. Mottram’s friends, which I never saw, but used to hear about from all of you, nor Julia didn’t like them, but they’ve done very well, haven’t they?” At last I asked her: “Have you heard from Julia?” “From Cordelia, only last week, and they’re together still as they have been all the time, and Julia sent me love at the bottom of the page. They’re both very well, though they couldn’t say where, but Father Membling said, reading between the lines, it was Palestine, which is where Bridey’s yeomanry is, so that’s very nice for them all. Cordelia said they were looking forward to coming home after the war, which I am sure we all are, though whether I live to see it, is another story.” I stayed with her for half an hour, and left promising to return often. When I reached the hall I found no sign of work and Hooper looking guilty. “They had to go off to draw the bed-straw. I didn’t know till Sergeant Block told me. I don’t know whether they’re coming back.” “Don’t know? What orders did you give?” “Well, I told Sergeant Block to bring them back if he thought it was worthwhile; I mean if there was time before dinner.” It was nearly twelve. “You’ve been hotted again, Hooper. That straw was to be drawn any time before six tonight.” “Oh Lor; sorry, Ryder. Sergeant Block—” “It’s my own fault for going away…. Fall in the same party immediately after dinner, bring them back here and keep them here till the job’s done.” “Rightyoh. I say, did you say you knew this place before?” “Yes, very well. It belongs to friends of mine,” and as I said the words they sounded as odd in my ears as Sebastian’s had done, when, instead of saying, “It is my home,” he said, “It is where my family live.”“It doesn’t seem to make any sense—one family in a place this size. What’s the use of it?” “Well, I suppose Brigade are finding it useful.” “But that’s not what it was built for, is it?” “No,” I said, “not what it was built for. Perhaps that’s one of the pleasures of building, like having a son, wondering how he’ll grow up. I don’t know; I never built anything, and I forfeited the right to watch my son grow up. I’m homeless, childless, middle-aged, love-less, Hooper.” He looked to see if I was being funny, decided that I was, and laughed. “Now go back to camp, keep out of the C.O.’s way, if he’s back from his recce, and don’t let on to anyone that we’ve made a nonsense of the morning.” “Okey, Ryder.” There was one part of the house I had not yet visited, and I went there now. The chapel showed no ill-effects of its long neglect; the art-nouveau paint was as fresh and bright as ever; the art-nouveau lamp burned once more before the altar. I said a prayer, an ancient, newly-learned form of words, and left, turning towards the camp; and as I walked back, and the cook-house bugle sounded ahead of me, I thought: “The builders did not know the uses to which their work would descend; they made a new house with the stones of the old castle; year by year, generation after generation, they enriched and extended it; year by year the great harvest of timber in the park grew to ripeness; until, in sudden frost, came the age of Hooper; the place was desolate and the work all brought to nothing; Quomodo sedet sola civitas. Vanity of vanities, all is vanity. “And yet,” I thought, stepping out more briskly towards the camp, where the bugles after a pause had taken up the second call and were sounding “Pick-em-up, pick-em-up, hot potatoes,” “and yet that is not the last word; it is not even an apt word; it is a dead word from ten years back. “Something quite remote from anything the builders intended, has come out of their work, and out of the fierce little human tragedy in which I played; something none of us thought about at the time; a small red flame—a beaten- copper lamp of deplorable design relit before the beaten-copper doors of a tabernacle; the flame which the old knights saw from their tombs, which they saw put out; that flame burns again for other soldiers, far from home, farther, in heart, than Acre or Jerusalem. It could not have been lit but for the builders and the tragedians, and there I found it this morning, burning anew among the old stones.” I quickened my pace and reached the hut which served us for our ante- room. “You’re looking unusually cheerful today,” said the second-in-command.Reading Group Guide Brideshead Revisited The Sacred and Profane Memories of Captain Charles Ryder by EVELYN WAUGHEvelyn Waugh wrote Brideshead Revisited while on leave from the British army during World War II. Following is a selection of letters he wrote to his literary agent, A. D. Peters, and close friend Nancy Mitford about the writing and publication of the book.To A. D. Peters February 8, 1944 Easton Court Hotel, Chagford, Devon Dear Peter, Could you please tell me the new address of Mr. McLachlan the typist? I am busy on the novel, have done over 10,000 words and, if the military do not disturb me, should finish it by the middle of May. It would have a small public at any time. I should not think six Americans will understand it. Would it be prudent to warn Gatfield 1 to expect a manuscript for his Christmas publication? He would then be able to reserve some paper. I am concerned with the quality rather than the quantity of Gatfield’s work. I take it that the regulations only prescribe how big the margins shall be and how small the print? They do not categorically enforce bad typography? And is there any paper of better quality than others? Would Littlebrown 2 care to produce an edition deluxe or at least de propriete? I should like this book to be in decent form because it is very good. Failing all else can Gatfield get handmade paper for twenty copies or so at my expense? My salutes to Henrie. I am in better shape than when I last saw her and you. Yours Ever, Evelyn Would it interest you to see the first 2 chapters in their first typed version or will you wait until it is finished? You might be able to guess how many yanks and Bevin-boys 3 will be able to understand it. To A. D. Peters April 3, 1944 Easton Court Hotel, Chagford, Devon Dear Pete, My Magnum Opus is turning into a jeroboam. I have written 62,000 words of which I enclose half. The rest is typing. A problem vexes me on which I should value your advice: The original scheme of the book was three sections, of which two are complete. The total length will be about 90,000 words. I now find that what I have written could be profitably enlarged and what I have to write could be an entire book. The leisure at my disposal is limited. Should I be well advised to expand what I have written to 70,000 words and publish it as Vol. I, leaving the second for next year? Supposing that by next year paper is again abundant we could publish a single volume of 120,000 words incorporating the first volume which would have had the limited circulation of the time. Expansion would be an artistic benefit. Evelyn Please retain MS for time being. It is a first draft requiring much alteration even if there is no expansion. To A. D. Peters [Received May 20, 1944] Easton Court Hotel, Chagford, Devon Dear Pete, Many thanks for your congratulations. Both well; no nanny. 4 How about “Sacred and Profane” on the cover; “The Sacred and Profane Memories of Capt. Charles Ryder” on the title page? Yes, Lady Marchmain is an enigma. I hoped the last conversation with Cordelia gave a theological clue. The whole thing is steeped in theology, but I begin to agree that theologians won’t recognize it. Duck into hare shall stop. 5 I wish I could dine, but I am glad of the reason for not being able to. I am steaming ahead with the novel. It is becoming painfully erotic. Yours, Evelyn To A. D. Peters September 30, 1944 “M” Military Mission C.M.F. [Topusko, Croatia] Dear Peter, … Littlebrown must on no account change the title of BR without submitting the alternative for my approval. I think it most unlikely I shall agree. He can call it “A Household of Faith” if he likes. I am writing to Gatfield by this post asking for a set of galley proofs by air mail so that I can revise the first half. The changes may be extensive. … Randolph 6 does not want to write his war memoirs but will come and see you when he gets home to discuss doing business with you. You may find him offensive. Most people do. I seldom. Time passes very slowly in this backwater. 7 Yours, Evelyn To Nancy Mitford January 7, 1945 37 Military Mission Dubrovnik, Croatia Dearest Nancy, Yes, I know what you mean; he is dim, 8 but then he is telling the story and it is not his story. It is all right for Benvenuto Cellini 9 to be undim, but he is telling his own story and no one else’s. I think the crucial question is: does Julia’s love for him seem real or is he so dim that it falls flat; if the latter, the book fails plainly. He was a bad painter. Well he was as bad at painting as Osbert [Sitwell] is at writing; for Christ’s sake don’t repeat that comparison to anyone . Lady Marchmain, 10 no I am not on her side; but God is, who suffers fools gladly; and the book is about God. Does that answer it? Bad about the clip. 11 Too late for the first edition and there are no second editions these days. I knew I should have submitted it to you for criticism. The definitive (ha ha) edition is substantially different from the first, so if you really feel disposed to re-read it, as you say, wait a month or two for that. A lovely parcel of books from you. Connolly’s Grave. 12 What he writes about Christianity is such twaddle—real twaddle—no sense or interest, that it shakes me. And he seems ashamed of that part of himself—as a soft, skeptical old good liver. I am shocked by Grave . But I have read only five or six pages. My father was a better classical scholar than Connolly, but he did not trot out his recondite quotations in at all that way. I think Connolly has lived too much with communist young ladies. He must spend more time at Whites. 13 So today is Orthodox Christmas and I was asked to tea by the military at 3pm. One never knows what one will get in this country. Today we were seated at tables, without a greeting from our hosts, and given (a) green chartreuse, (b) tea and ham sandwiches, (c) cakes and cherry brandy and cigarettes, (d) two patriotic speeches. Then it seemed reasonable to think the party was over, but no, in came cold mutton and red wine. It is unsettling at my age.50 copies of Brideshead Revisited went out, 40 of them to close friends of yours. Do please keep your ear to the ground and report what they say. For the first time since 1928, I am eager about a book. Love, Evelyn To Nancy Mitford February 4, 1945 37 Military Mission Dubrovnik, Croatia Darling Nancy, Well those were two splendid letters. What a bob’s worth—theology, belles-lettres, biography—the whole of the Everyman Library. First, Belles-lettres . How delighted I am to hear you are writing a Great English Classic too. What a subject! 14 Tell your publisher at once or there will not be paper for months after it is written. The first person singular is a most treacherous form of narration, I found. It is so fatally easy in some ways, one can go on and on almost effortlessly and then one comes up against something which “I” cannot possibly say, which must be said. I believe you will manage it more skillfully than I did. I pant for the proofs. Theology . There is no doubt that God does like dunces, repugnant as it is. 15 I think it is like the lower classes—everyone loves the simple gaffer until he starts telling us what he heard on The Brains Trust the evening before. We are all very lower class to God and our cleverness and second-hand scholarship bore him hideously. I don’t like your defense of Windsor and Mrs. S. 16 It is certainly true that people often feel qualms of conscience about illicit love only when they are beginning to get bored; also that self restraint usually takes the form of not falling in love but rather falling and then having a dramatic renunciation. But it must be nonsense to say people never give up sleeping together for “abstract” principles. Anyhow why “abstract”? Is the crown of England or the love of God abstract? Of course with Julia Flyte the fact that the war was coming and she saw her life coming to an end anyhow, made a difference. Biography or Medicine . Croatia is thrilled about Lennox-Boyd’s elephantiasis. 17 Army signals busy supplying Randolph with clinical details. I think it may have some connection with Guiness’ zoo advertising. 18 Now Simon. 19 I can’t make out from your description— stark, is the word—whether he was blown up by V2 or struck down inhis prime like Lord Randolph. 20 If you put it in a book no one would think it at all “convincing.” Heaven help us when you atheists get full control as in Germany and go round the sick rooms murdering the sick and infirm. I should be an early victim. My blood pressure is giving me trouble again. Drama . Diane Abdy writes to me that her life is “re-orientated.” What does she mean? Criticism . It is interesting how all the English think my G.E.C. 21 Rom-ish propaganda. You never hear them speak of Henry Yorke 22 as writing atheist propaganda. Penelope Betjeman has written me a long letter treating the story purely as a controversial tract. Katharine Asquith on the other hand writes, “When will you stop writing novels and try your hand at a book?” Pansy Lamb says I give an entirely false view of debutante life in the early ’20s. It is heaven for me hearing all these criticisms. Autobiography . My life continues very easy, comfortable, irresponsible, safe. I know the stones of Ragusa well and can tell what is genuine Italian and what is Slav imitation. Most of my day is spent dealing with pathetic people of confused nationality seeking to escape the horrors of liberation. I was called on by a man who looked just like Professor Joad who introduced himself, “I am the poet Kosov.” He gave me the English translation of a play of his called, literally, “Passion’s Furnace.”… Mr. Kosov stayed to luncheon and left very tipsy quoting Rimbaud in German. We had a sad little festival yesterday when the partisans made the people observe St. Blaise’s Day with all of its ceremonies—no tourists, no peasants in from the villages, the inhabitants too weak from hunger to stand and too scared of the secret police to sneeze. Why cannot you send Prod here to help civilian relief. 23 He would be very welcome to yours truly. Bless him you never mention him now. The Savile Club I suppose. Thank you very much for Love on the Supertax which arrived today. I haven’t opened it yet but look forward to doing so. All love, EvelynQuestions and topics for discussion 1. Some consider Brideshead Revisited to be a novel about love, some think it is about family, and others the waning powers of British aristocracy. Evelyn Waugh considered it to be a book about religion. Do you think it is only one of these things, or could it be about all of them? 2. In his letter to A. D. Peters, Waugh wrote, “I hoped the last conversation with Cordelia gave a theological clue.” What does Cordelia say that reveals Waugh’s true intentions? 3. In 1944, Henry Wallace, then vice president of the United States, declared that the twentieth century was “the century of the common man.” This statement caused much discussion in England, and because of it Waugh’s portrayal of Hooper, the representative “common man” in Brideshead Revisited, attracted controversy from the book’s critics. Do you find the portrayal of Captain Hooper offensive? Is the class issue still relevant today, or is it particular to the time in which the book was published? 4. When we first meet Sebastian, he carries a teddy bear with him wherever he goes. Why does he carry the teddy? To what degree is Sebastian still a boy when we meet him? How much of this behavior is affected and how much is genuine? 5. How much of Charles’s identity is influenced by his relationship with the Flyte family? 6. Though they were all raised in the same household, each Flyte child has a different relationship with Catholicism. How would you define the differing feelings that Bridey, Julia, Sebastian, and Cordelia haveabout their religion? 7. What draws Charles to Sebastian? And what draws Sebastian to Charles? Several times Charles refers to Sebastian as “the forerunner” to his love for Julia. What do you think he means? 8. Infidelity is treated casually by those in Charles and Julia’s social circle. When the two decide they love each other and want to marry, their relationship becomes much more controversial. Is marriage an act of love in the world of Brideshead Revisited ? 9. When Bridey tells Julia she is “living in sin,” it has a great effect on her. Do you think she had never thought of this before? Is it the first time Charles becomes aware of how greatly their “sins” sit on her? 10. The final impediment to Charles and Julia’s marriage is that in the eyes of the Catholic Church, he is still married to Celia—despite their state-issued divorce. Waugh faced a similar situation in his own life when he decided to marry his second wife, and subsequently pursued an annulment from his first wife (despite their being legally divorced). Why do you think he chose not to make this a part of Charles and Julia’s love story? 11. There are three significant deaths in Julia’s life—her mother’s, her father’s, and that of her stillborn child with Rex. How do these deaths effect her decisions in life? 12. Charles is not a writer by profession, but as Julia points out he sees everything “second-hand” as if they were in a play. Is this his personality, or a way of explaining his role of narrator?Suggested reading Curious to find out more about Evelyn Waugh? Here are some titles worth investigating. A Little Learning: An Autobiography, Evelyn Waugh When the Going Was Good, Evelyn Waugh Waugh Abroad: The Collected Travel Writing, Evelyn Waugh The Letters of Evelyn Waugh, edited by Mark Amory The Diaries of Evelyn Waugh, edited by Michael Davie The Letters of Nancy Mitford and Evelyn Waugh, edited by Charlotte Mosley The Letters of Evelyn Waugh and Diana Cooper, edited by Artemis Cooper Evelyn Waugh: The Early Years, 1903–1939, Martin Stannard Evelyn Waugh: The Later Years, 1939–1966, Martin Stannard Evelyn Waugh: A Biography, Selina Hastings Evelyn Waugh: A Biography, Christopher Sykes The Life of Evelyn Waugh: A Critical Biography, Douglas Patey Will This Do? An Autobiography, Auberon Waugh Fathers and Sons: The Autobiography of a Family, Alexander WaughAbout the Author Evelyn Waugh (1903–1966) was born in Hampstead, England, into a family of publishers and writers. He was educated at Lancing and Hertford College, Oxford, where he majored in journalism and modern history. Waugh’s first book, Rossetti: His Life and Works, was published in 1928. Soon afterward his first novel, Decline and Fall, appeared and his career was sensationally launched. “In fifteen novels of cunning construction and lapidary eloquence,” Time summarized later, “Evelyn Waugh developed a wickedly hilarious yet fundamentally religious assault on a century that, in his opinion, had ripped up the nourishing taproot of tradition and let wither all the dear things of the world.” Apart from his novels, Waugh also wrote several acclaimed travel books, two additional biographies, and an autobiography, A Little Learning . His short fiction is collected in The Complete Stories .Books by Evelyn Waugh Novels Decline and Fall Vile Bodies Black Mischief A Handful of Dust Scoop Put Out More Flags Brideshead Revisited The Loved One Helena Men at Arms Officers and Gentlemen The Ordeal of Gilbert Pinfold Unconditional Surrender (also published as The End of the Battle ) Sword of Honor (omnibus) Stories Mr. Loveday’s Little Outing, and Other Sad Stories Tactical Exercise Basil Seal Rides Again Charles Ryder’s Schooldays The Complete Stories Biography Rossetti Edmund Campion Msgr. Ronald Knox Autobiography/Diaries/Letters A Little Learning The Diaries of Evelyn Waugh The Letters of Evelyn WaughTravel/Journalism A Bachelor Abroad They Were Still Dancing Ninety-Two Days Waugh in Abyssinia Mexico: An Object Lesson When the Going Was Good A Tourist in Africa A Little Order The Essays, Articles and Reviews of Evelyn WaughThank you for buying this e-book, published by Hachette Digital. To receive special offers, bonus content, and news about our latest e-books and apps, sign up for our newsletter. Sign Up Or visit us at hachettebookgroup.com/newsletters1 Joint managing director of Chapman and Hall, Waugh’s publisher.2 Little, Brown and Company, Waugh’s American publisher.3 British slang at the time, referring to men conscripted to work in coal mines during World War II.4 Waugh’s wife, Laura, had just given birth to their daughter Harriet.5 This is a correction Peters had pointed out in the manuscript—a meal of duck had been turned into rabbit and Peters thought it should be changed back to duck.6 Randolph Churchill, son of Winston.7 He was serving a military mission (under Randolph’s command) in Croatia.8 Nancy had written to Waugh in her previous letter that her only criticism of Charles was that he seemed “a tiny bit dim.”9 Italian Mannerist artist from the sixteenth century who wrote a famous autobiography.10 Nancy had also queried him as to whether or not he sided with Lady Marchmain.11 She pointed out that diamond clips were not invented until the 1930s and Julia would have worn a diamond arrow in her cloche instead.12 Cyril Connolly, a mutual friend, published The Unquiet Grave in 1944.13 A London gentlemen’s club that Waugh and his friends frequented.14 Nancy had written that she had started a work in a similar vein, written in first person, inspired by her family. The Pursuit of Love was published in 1945.15 Nancy wrote to Evelyn, “I quite see how the person who tells is dim but then would Julia and her brother and her sister all be in love with him if he was? Well love is like that and one can never tell. What I can’t understand is about God…. The God I believe in simply hates fools more than anything.”16 The Duke of Windsor and Wallis Simpson.17 In a previous letter she had recounted how a mutual friend, Alan Lennox- Boyd, had accidentally been infected with elephantiasis by a doctor who was supposed to be giving him a vaccine. Unfortunately, he developed symptoms during a House of Lords committee meeting and had to be rushed out via ambulance.18 An ad for Guinness beer showed an elephant using its trunk to delicately remove a glass of Guinness from its keeper’s hand.19 Simon Elwes had an attack of thrombosis that deprived him the use of his right side. He was married to Gloria Rodd, Nancy’s sister-in-law at the time.20 Winston Churchill’s father, Randolph Churchill, died at age forty-six.21 Great English Classic22 Novelist, wrote under the pseudonym of Henry Green.23 Peter Rodd, Nancy’s husband at the time. He was working for the United Nations Relief and Rehabilitation Administration. Waugh openly admits Rodd is the inspiration for the character Basil Seal, who appears in Black Mischief and Put Out More Flags .Contents Welcome Dedication Preface Prologue: Brideshead Revisited Book One: Et in Arcadia Ego 1. I meet Sebastian Flyte—and Anthony Blanche—I visit Brideshead for the first time 2. My cousin Jasper’s Grand Remonstrance—a warning against charm— Sunday morning in Oxford 3. My father at home—Lady Julia Flyte 4. Sebastian at home—Lord Marchmain abroad 5. Autumn in Oxford—dinner with Rex Mottram and supper with Boy Mulcaster—Mr. Samgrass—Lady Marchmain at home—Sebastian contra mundum Book Two: Brideshead Deserted 1. Samgrass revealed—I take leave of Brideshead—Rex revealed 2. Julia and Rex 3. Mulcaster and I in defense of our country—Sebastian abroad—I take leave of Marchmain House Book Three: A Twitch upon the Thread 1. Orphans of the storm 2. Private view—Rex Mottram at home 3. The fountain 4. Sebastian contra mundum 5. Lord Marchmain at home—death in the Chinese drawing-room—the purpose revealedEpilogue: Brideshead Revisited Reading Group Guide Letters Questions and topics for discussion Suggested reading About the Author Books by Evelyn Waugh Newsletters CopyrightCopyright The characters and events in this book are fictitious. Any similarity to real persons, living or dead, is coincidental and not intended by the author. Copyright © 1944, 1945 by Evelyn Waugh Copyright renewed © 1972, 1973 by Laura Waugh Reading group guide copyright © 2012 by the Estate of Evelyn Waugh and Little, Brown and Company Author photograph © Hulton-Deutsch Collection / CORBIS Cover design by Keith Hayes. Cover illustration by Jon Contino Cover copyright © 2012 by Hachette Book Group, Inc. All rights reserved. In accordance with the U.S. Copyright Act of 1976, the scanning, uploading, and electronic sharing of any part of this book without the permission of the publisher constitute unlawful piracy and theft of the author’s intellectual property. If you would like to use material from the book (other than for review purposes), prior written permission must be obtained by contacting the publisher at permissions@hbgusa.com. Thank you for your support of the author’s rights. Little, Brown and Company Hachette Book Group 237 Park Avenue, New York, NY 10017 littlebrown.com twitter.com/littlebrown First e-book edition: December 2012 AUTHOR’S NOTE I am not I: thou art not he or she they are not they E.W. ISBN 978-0-316-21653-1",
      "density_breakdown": {
        "Metaphor": 1.6971279373368147,
        "Simile": 1.0443864229765012,
        "Imagery": 6.005221932114883,
        "Symbolism": 15.013054830287206,
        "Dialogue": 0.0,
        "Foreshadowing": 6.5274151436031325,
        "Juxtaposition": 9.399477806788513,
        "Repetition": 6.135770234986945,
        "TOTAL_DENSITY": 45.822454308093995
      }
    }
  },
  "narrative_position_mapping": {
    "exposition": {
      "chapter_range": "1-2",
      "narrative_primary": 1,
      "optimized_primary": 2,
      "device_density_score": 43.73368146214099,
      "optimization_applied": true,
      "pages": ""
    },
    "rising_action": {
      "chapter_range": "3-10",
      "narrative_primary": 7,
      "optimized_primary": 6,
      "device_density_score": 46.21409921671018,
      "optimization_applied": true,
      "pages": ""
    },
    "climax": {
      "chapter_range": "11-12",
      "narrative_primary": 11,
      "optimized_primary": 11,
      "device_density_score": 48.43342036553525,
      "optimization_applied": false,
      "pages": ""
    },
    "falling_action": {
      "chapter_range": "13-14",
      "narrative_primary": 13,
      "optimized_primary": 14,
      "device_density_score": 46.08355091383812,
      "optimization_applied": true,
      "pages": ""
    },
    "resolution": {
      "chapter_range": "15",
      "narrative_primary": 15,
      "optimized_primary": 15,
      "device_density_score": 45.822454308093995,
      "optimization_applied": false,
      "pages": ""
    }
  },
  "macro_variables": {
    "narrative": {
      "voice": {
        "pov": "FP",
        "pov_description": "First-person narration by Charles Ryder throughout",
        "focalization": "INT",
        "focalization_description": "Limited to Charles's perspective and memories",
        "reliability": "REL",
        "temporal_distance": "RETRO",
        "mode_dominance": "BAL",
        "free_indirect": "SOME",
        "stream_consciousness": "NONE",
        "character_revelation": "MIX",
        "narrative_intrusion": "SOME",
        "voice_consistency": "CONS"
      },
      "structure": {
        "chronology": "LIN",
        "framing": "SIMPLE",
        "plot_architecture": "MONO",
        "plot_architecture_description": "Single plot following Charles's relationship with the Flyte family",
        "pacing": "SLOW",
        "temporal_span": "EXTENDED",
        "beginning_type": "AB_OVO",
        "ending_type": "CLOSED",
        "scene_summary_ratio": "SCENE",
        "chapter_structure": "TRAD",
        "causation": "STRONG"
      }
    },
    "rhetoric": {
      "voice": {
        "tone": "Elegiac, nostalgic, melancholic with religious undertones",
        "register": "FORM",
        "stance": "SUBJ",
        "ethos": "STRONG",
        "pathos": "STRONG",
        "logos": "MOD",
        "irony": "SIT",
        "figurative_density": "MOD"
      },
      "structure": {
        "alignment_type": "TRANS",
        "narrative_rhetoric_relationship": "TIGHT",
        "primary_mechanism": "THEME",
        "device_density": "MOD",
        "device_distribution": "EVEN",
        "mediation_strategy": "ACCUMULATION"
      }
    },
    "device_mediation": {
      "summary": "Devices accumulate to transform reader understanding from secular aesthetic appreciation to recognition of divine grace operating through human relationships and loss"
    }
  },
  "alignment_pattern": {
    "pattern_name": "Elegiac Retrospection",
    "core_dynamic": "First-person limited retrospective narration combines with subjective elegiac stance to transform personal memory into universal meditation on loss and faith.",
    "reader_effect": "Creates intimate yet distanced contemplation where readers experience both the immediacy of remembered emotion and the wisdom of temporal remove.",
    "device_priorities": [
      "Symbolism",
      "Imagery",
      "Juxtaposition",
      "Foreshadowing",
      "Repetition",
      "Motif",
      "Metaphor",
      "Flashback"
    ]
  },
  "micro_devices": [
    {
      "name": "First-Person Narration",
      "anchor_phrase": "but it was not until Sebastian",
      "location_percent": 5,
      "scene": "Opening reflection on aesthetic education through Sebastian",
      "effect": "Establishes retrospective voice that transforms personal memory into universal meditation on discovery and loss",
      "assigned_section": "exposition",
      "chapter": 2,
      "chapter_range": "1-2",
      "pedagogical_tier": 5
    },
    {
      "name": "Foreshadowing",
      "anchor_phrase": "I was in search of love",
      "location_percent": 25,
      "scene": "Charles approaching Sebastian's luncheon invitation",
      "effect": "Hints at the profound relationship to come while maintaining elegiac tone of something precious that will be lost",
      "assigned_section": "exposition",
      "chapter": 2,
      "chapter_range": "1-2",
      "pedagogical_tier": 3
    },
    {
      "name": "Symbolism",
      "anchor_phrase": "low door in the wall",
      "location_percent": 25,
      "scene": "Charles's expectation before meeting Sebastian",
      "effect": "The garden door symbolizes entry into an enchanted but temporary world, reinforcing the elegiac pattern of beauty discovered and lost",
      "assigned_section": "exposition",
      "chapter": 2,
      "chapter_range": "1-2",
      "pedagogical_tier": 3
    },
    {
      "name": "Imagery",
      "anchor_phrase": "epicene beauty which in extreme youth",
      "location_percent": 30,
      "scene": "First intimate view of Sebastian at lunch",
      "effect": "Vivid sensory description creates luminous memory while 'withers at the first cold wind' prefigures loss",
      "assigned_section": "exposition",
      "chapter": 2,
      "chapter_range": "1-2",
      "pedagogical_tier": 1
    },
    {
      "name": "Juxtaposition",
      "anchor_phrase": "it's where my family live",
      "location_percent": 60,
      "scene": "Sebastian's detached reference to Brideshead",
      "effect": "Contrasts Sebastian's emotional distance with the house's grandeur, suggesting family tensions that will drive the narrative's elegiac trajectory",
      "assigned_section": "exposition",
      "chapter": 2,
      "chapter_range": "1-2",
      "pedagogical_tier": 3
    },
    {
      "name": "Repetition",
      "anchor_phrase": "I like this bad set",
      "location_percent": 85,
      "scene": "Charles's defiant response to Jasper's criticism",
      "effect": "Repeated phrase emphasizes the narrator's commitment to choices that retrospective wisdom reveals as both formative and tragic",
      "assigned_section": "exposition",
      "chapter": 2,
      "chapter_range": "1-2",
      "pedagogical_tier": 2
    },
    {
      "name": "Motif",
      "anchor_phrase": "middle-aged captain of infantry",
      "location_percent": 95,
      "scene": "Final retrospective reference in chapter",
      "effect": "Military identity represents the war-torn present looking back at innocent past, anchoring the elegiac pattern of loss and remembrance",
      "assigned_section": "exposition",
      "chapter": 2,
      "chapter_range": "1-2",
      "pedagogical_tier": 3
    },
    {
      "name": "Metaphor",
      "anchor_phrase": "By the blue waters and rustling palms of his own mind",
      "location_percent": 45,
      "scene": "Charles reflects on Sebastian's mental state and need for solitude",
      "effect": "Transforms Sebastian's psyche into an Edenic paradise, establishing the elegiac tone of innocence about to be lost and positioning Charles as elegiac observer of Sebastian's destruction",
      "assigned_section": "rising_action",
      "chapter": 6,
      "chapter_range": "3-10",
      "pedagogical_tier": 1
    },
    {
      "name": "Foreshadowing",
      "anchor_phrase": "his days in Arcadia were numbered",
      "location_percent": 48,
      "scene": "Charles contemplates Sebastian's psychological state",
      "effect": "Creates retrospective knowledge of inevitable loss, allowing the narrator to transform personal memory into universal meditation on the destruction of innocence",
      "assigned_section": "rising_action",
      "chapter": 6,
      "chapter_range": "3-10",
      "pedagogical_tier": 3
    },
    {
      "name": "Symbolism",
      "anchor_phrase": "the archaic weapons of the tribe and sound the drums",
      "location_percent": 46,
      "scene": "Extended metaphor of Sebastian as threatened Polynesian",
      "effect": "Sebastian's drinking becomes symbol of civilization's corruption of the noble savage, elevating personal tragedy to universal commentary on cultural destruction",
      "assigned_section": "rising_action",
      "chapter": 6,
      "chapter_range": "3-10",
      "pedagogical_tier": 3
    },
    {
      "name": "Juxtaposition",
      "anchor_phrase": "the august, masculine atmosphere of a better age",
      "location_percent": 85,
      "scene": "Charles contrasts Lady Marchmain's feminine room with the main hall",
      "effect": "Contrasts intimate modern world with grand classical architecture, reinforcing elegiac stance toward lost grandeur and positioning narrator as witness to historical decline",
      "assigned_section": "rising_action",
      "chapter": 6,
      "chapter_range": "3-10",
      "pedagogical_tier": 3
    },
    {
      "name": "Imagery",
      "anchor_phrase": "the low ceiling, the chintz, the lambskin bindings",
      "location_percent": 84,
      "scene": "Description of Lady Marchmain's private sitting room",
      "effect": "Sensory details create vivid contrast between intimate domesticity and grand architecture, supporting the elegiac meditation on different worlds and values",
      "assigned_section": "rising_action",
      "chapter": 6,
      "chapter_range": "3-10",
      "pedagogical_tier": 1
    },
    {
      "name": "First-Person Narration",
      "anchor_phrase": "I was no fool; I was old enough to know",
      "location_percent": 86,
      "scene": "Charles reflects on Lady Marchmain's attempt to influence him",
      "effect": "Retrospective voice combines personal memory with mature judgment, transforming individual experience into universal meditation on manipulation and loss of innocence",
      "assigned_section": "rising_action",
      "chapter": 6,
      "chapter_range": "3-10",
      "pedagogical_tier": 5
    },
    {
      "name": "Repetition",
      "anchor_phrase": "the same blaze, marking her and hers for destruction",
      "location_percent": 90,
      "scene": "Charles reflects on the family's fate after reading about the brothers",
      "effect": "Echoes earlier imagery of doom and sacrifice, creating elegiac pattern that transforms personal observation into universal meditation on aristocratic decline",
      "assigned_section": "rising_action",
      "chapter": 6,
      "chapter_range": "3-10",
      "pedagogical_tier": 2
    },
    {
      "name": "Dramatic Irony",
      "anchor_phrase": "Sebastian contra mundum",
      "location_percent": 92,
      "scene": "Charles declares loyalty to Sebastian against the world",
      "effect": "Reader knows from retrospective narration that this alliance will fail, creating elegiac tension between youthful loyalty and inevitable loss that serves the pattern of memory transformed into universal meditation",
      "assigned_section": "rising_action",
      "chapter": 6,
      "chapter_range": "3-10",
      "pedagogical_tier": 4
    },
    {
      "name": "Symbolism",
      "anchor_phrase": "little pool of ice-water which now surrounded the swan",
      "location_percent": 5,
      "scene": "Opening cocktail party where guests put out cigarettes in melted ice around decorative swan",
      "effect": "The swan surrounded by ash-contaminated water symbolizes corrupted beauty and elegiac loss, establishing the retrospective narrator's meditation on the decay of elegance",
      "assigned_section": "climax",
      "chapter": 11,
      "chapter_range": "11-12",
      "pedagogical_tier": 3
    },
    {
      "name": "First-Person Narration",
      "anchor_phrase": "Through and through is a long way, madam",
      "location_percent": 10,
      "scene": "Charles's internal monologue while conversing with elderly woman at party",
      "effect": "Limited retrospective narration reveals the narrator's subjective interiority, transforming surface social interaction into deeper meditation on unknowable self",
      "assigned_section": "climax",
      "chapter": 11,
      "chapter_range": "11-12",
      "pedagogical_tier": 5
    },
    {
      "name": "Foreshadowing",
      "anchor_phrase": "I had already set her apart from humankind",
      "location_percent": 12,
      "scene": "Charles's internal reflection about Julia before she arrives at the party",
      "effect": "Anticipates the transformative love that will define the climactic relationship, preparing elegiac meditation on what will be lost",
      "assigned_section": "climax",
      "chapter": 11,
      "chapter_range": "11-12",
      "pedagogical_tier": 3
    },
    {
      "name": "Imagery",
      "anchor_phrase": "felt like Lear on the heath, like the Duchess",
      "location_percent": 40,
      "scene": "Charles overwhelmed by dinner conversation and storm beginning",
      "effect": "Literary imagery elevates personal experience to universal tragic scope, supporting elegiac transformation of memory into broader meditation on loss",
      "assigned_section": "climax",
      "chapter": 11,
      "chapter_range": "11-12",
      "pedagogical_tier": 1
    },
    {
      "name": "Juxtaposition",
      "anchor_phrase": "parrot-house fever of my wife's party, and unplumbed emotions",
      "location_percent": 38,
      "scene": "Charles contrasting social superficiality with deep feeling for Julia",
      "effect": "Contrasts hollow social performance with authentic emotion, supporting retrospective narrator's elegiac distinction between surface and depth",
      "assigned_section": "climax",
      "chapter": 11,
      "chapter_range": "11-12",
      "pedagogical_tier": 3
    },
    {
      "name": "Repetition",
      "anchor_phrase": "perhaps never. I don't know. I don't know if",
      "location_percent": 85,
      "scene": "Julia's hesitation about love outside her cabin door",
      "effect": "Repeated uncertainty emphasizes the fragility of the climactic moment, enhancing elegiac quality of retrospective meditation on what was almost lost",
      "assigned_section": "climax",
      "chapter": 11,
      "chapter_range": "11-12",
      "pedagogical_tier": 2
    },
    {
      "name": "Internal Monologue",
      "anchor_phrase": "Ten hours of talking: what had we to say?",
      "location_percent": 90,
      "scene": "Charles reflecting on his long conversation with Julia during the storm",
      "effect": "Retrospective consciousness processes memory into elegiac meditation, transforming personal experience into universal reflection on human connection",
      "assigned_section": "climax",
      "chapter": 11,
      "chapter_range": "11-12",
      "pedagogical_tier": 5
    },
    {
      "name": "Motif",
      "anchor_phrase": "part of a plan",
      "location_percent": 95,
      "scene": "Julia's final words about their relationship being divinely orchestrated",
      "effect": "Religious motif introduces faith element that will dominate the elegiac retrospection, preparing meditation on loss and transcendence",
      "assigned_section": "climax",
      "chapter": 11,
      "chapter_range": "11-12",
      "pedagogical_tier": 3
    },
    {
      "name": "Symbolism",
      "anchor_phrase": "You might paint it, eh—and call it the Death Bed",
      "location_percent": 25,
      "scene": "Lord Marchmain examining his elaborate Chinese drawing-room bed setup",
      "effect": "The ornate Queen's bed becomes a symbol of aristocratic decline and mortality, transforming personal death into universal meditation on the passing of an era",
      "assigned_section": "falling_action",
      "chapter": 14,
      "chapter_range": "13-14",
      "pedagogical_tier": 3
    },
    {
      "name": "Foreshadowing",
      "anchor_phrase": "he has come home to die",
      "location_percent": 28,
      "scene": "Cara's frank assessment of Lord Marchmain's condition after his arrival",
      "effect": "Explicitly previews the chapter's central tragic arc while establishing the elegiac tone that transforms individual death into broader cultural loss",
      "assigned_section": "falling_action",
      "chapter": 14,
      "chapter_range": "13-14",
      "pedagogical_tier": 3
    },
    {
      "name": "Imagery",
      "anchor_phrase": "the little yellow men along the walls, who live without breathing",
      "location_percent": 85,
      "scene": "Lord Marchmain's delirious observations about the Chinese room decorations",
      "effect": "Vivid sensory details of the ornate room merge with dying man's perceptions, creating elegiac imagery that elevates personal suffering to artistic meditation",
      "assigned_section": "falling_action",
      "chapter": 14,
      "chapter_range": "13-14",
      "pedagogical_tier": 1
    },
    {
      "name": "Juxtaposition",
      "anchor_phrase": "Better today. Better today",
      "location_percent": 80,
      "scene": "Lord Marchmain's repetitive self-reassurance contrasted with his obvious decline",
      "effect": "Places desperate hope against visible reality, creating elegiac tension between subjective experience and objective truth that defines the retrospective stance",
      "assigned_section": "falling_action",
      "chapter": 14,
      "chapter_range": "13-14",
      "pedagogical_tier": 3
    },
    {
      "name": "Motif",
      "anchor_phrase": "the snow was beginning to shift on the high slopes",
      "location_percent": 70,
      "scene": "Charles's internal reflection on the religious controversy building around Lord Marchmain",
      "effect": "Recurring metaphor of impending avalanche/collapse transforms personal religious conflict into universal pattern of faith and loss",
      "assigned_section": "falling_action",
      "chapter": 14,
      "chapter_range": "13-14",
      "pedagogical_tier": 3
    },
    {
      "name": "First-Person Narration",
      "anchor_phrase": "I felt triumphant. I had been right",
      "location_percent": 75,
      "scene": "Charles's reaction to the failed priest visit",
      "effect": "Subjective retrospective voice reveals narrator's past blindness and present understanding, enabling elegiac transformation of personal memory into universal meditation",
      "assigned_section": "falling_action",
      "chapter": 14,
      "chapter_range": "13-14",
      "pedagogical_tier": 5
    },
    {
      "name": "Dramatic Irony",
      "anchor_phrase": "I was wrong in thinking that the religious controversy was quashed",
      "location_percent": 76,
      "scene": "Charles's premature celebration after the priest is turned away",
      "effect": "Retrospective narrator's knowledge creates ironic distance from past self, allowing elegiac meditation on the gap between experience and understanding",
      "assigned_section": "falling_action",
      "chapter": 14,
      "chapter_range": "13-14",
      "pedagogical_tier": 4
    },
    {
      "name": "Repetition",
      "anchor_phrase": "Better today. Better today",
      "location_percent": 80,
      "scene": "Lord Marchmain's mantra-like repetition during his illness",
      "effect": "Repeated phrase creates elegiac rhythm that transforms individual decline into universal meditation on mortality and self-deception",
      "assigned_section": "falling_action",
      "chapter": 14,
      "chapter_range": "13-14",
      "pedagogical_tier": 2
    },
    {
      "name": "Symbolism",
      "anchor_phrase": "Lord Marchmain made the sign of the cross",
      "location_percent": 45,
      "scene": "Lord Marchmain's deathbed scene with priest giving last rites",
      "effect": "Transforms personal memory into universal meditation on divine grace, embodying the elegiac retrospective pattern's core theme of faith triumphing over loss",
      "assigned_section": "resolution",
      "chapter": 15,
      "chapter_range": "15",
      "pedagogical_tier": 3
    },
    {
      "name": "First-Person Narration",
      "anchor_phrase": "I prayed more simply; 'God forgive him his sins'",
      "location_percent": 40,
      "scene": "Charles witnessing and participating in Lord Marchmain's last rites",
      "effect": "Creates subjective elegiac stance that filters theological mystery through personal memory, enabling transformation of individual experience into universal meditation",
      "assigned_section": "resolution",
      "chapter": 15,
      "chapter_range": "15",
      "pedagogical_tier": 5
    },
    {
      "name": "Metaphor",
      "anchor_phrase": "the veil of the temple being rent from top to bottom",
      "location_percent": 50,
      "scene": "Charles's realization after Lord Marchmain makes the sign of the cross",
      "effect": "Elevates personal memory to universal significance through biblical allusion, demonstrating how retrospective narration transforms loss into spiritual revelation",
      "assigned_section": "resolution",
      "chapter": 15,
      "chapter_range": "15",
      "pedagogical_tier": 1
    },
    {
      "name": "Imagery",
      "anchor_phrase": "a small red flame—a beaten-copper lamp of deplorable design",
      "location_percent": 95,
      "scene": "Charles's final meditation in the chapel before leaving",
      "effect": "Creates sensory anchor for elegiac retrospection, transforming physical detail into symbol of enduring faith that survives temporal loss",
      "assigned_section": "resolution",
      "chapter": 15,
      "chapter_range": "15",
      "pedagogical_tier": 1
    },
    {
      "name": "Juxtaposition",
      "anchor_phrase": "the age of Hooper; the place was desolate",
      "location_percent": 90,
      "scene": "Charles reflecting on the transformation of Brideshead into military quarters",
      "effect": "Contrasts past grandeur with present degradation to execute elegiac retrospection's meditation on temporal loss and cultural decay",
      "assigned_section": "resolution",
      "chapter": 15,
      "chapter_range": "15",
      "pedagogical_tier": 3
    },
    {
      "name": "Repetition",
      "anchor_phrase": "So small a thing that was asked",
      "location_percent": 35,
      "scene": "Charles praying for a sign during Lord Marchmain's last rites",
      "effect": "Emphasizes the elegiac tension between human longing and divine mystery, building toward the retrospective revelation of grace's magnitude",
      "assigned_section": "resolution",
      "chapter": 15,
      "chapter_range": "15",
      "pedagogical_tier": 2
    },
    {
      "name": "Allusion",
      "anchor_phrase": "Quomodo sedet sola civitas. Vanity of vanities, all is vanity",
      "location_percent": 88,
      "scene": "Charles's biblical meditation on Brideshead's desolation",
      "effect": "Elevates personal memory to universal lamentation through scriptural reference, exemplifying how elegiac retrospection transforms individual loss into timeless meditation",
      "assigned_section": "resolution",
      "chapter": 15,
      "chapter_range": "15",
      "pedagogical_tier": 3
    }
  ]
}