{
  "metadata": {
    "title": "Jane Eyre",
    "author": "Charlotte Brontë",
    "edition": "Penguin Classics, 2006",
    "creation_date": "2025-12-10T21:34:51.143804",
    "protocol_version": "4.0",
    "kernel_version": "5.1",
    "chapter_aware": true,
    "structure_alignment_protocol": "v1.1",
    "device_density_optimization": true
  },
  "text_structure": {
    "has_chapters": true,
    "total_chapters_estimate": 38,
    "notes": "Chapter breaks identified during kernel creation"
  },
  "structure_detection": {
    "structure_type": "NUM",
    "total_units": 38,
    "special_elements": [],
    "notes": "Numbered chapters I through XXXVIII detected, with final chapter labeled as 'Conclusion'"
  },
  "chapter_alignment": {
    "exposition": {
      "chapter_range": "1-4",
      "chapters": [
        1,
        2,
        3,
        4
      ],
      "primary_chapter": 1,
      "percentage": 11
    },
    "rising_action": {
      "chapter_range": "5-22",
      "chapters": [
        5,
        6,
        7,
        8,
        9,
        10,
        11,
        12,
        13,
        14,
        15,
        16,
        17,
        18,
        19,
        20,
        21,
        22
      ],
      "primary_chapter": 14,
      "percentage": 47
    },
    "climax": {
      "chapter_range": "23-27",
      "chapters": [
        23,
        24,
        25,
        26,
        27
      ],
      "primary_chapter": 26,
      "percentage": 13
    },
    "falling_action": {
      "chapter_range": "28-35",
      "chapters": [
        28,
        29,
        30,
        31,
        32,
        33,
        34,
        35
      ],
      "primary_chapter": 32,
      "percentage": 21
    },
    "resolution": {
      "chapter_range": "36-38",
      "chapters": [
        36,
        37,
        38
      ],
      "primary_chapter": 38,
      "percentage": 8
    }
  },
  "chapter_optimization": {
    "exposition": {
      "chapter_range": "1-4",
      "narrative_primary": 1,
      "optimized_primary": 3,
      "device_density_score": 51.80421579135405,
      "improvement_percent": 5.0724637681159415,
      "optimization_applied": true,
      "chapter_text": "stifled, limited, bossed around, oppressed, or abused by dominant or power ful men of spectacular masculinity . Romance, the critic Janice Radway says, requires rousing as well as allaying women’ s anxieties about men, encompassing both individual desires and power issues in complex ways. As the sociologists Stevi Jackson and Eva Illouz have pointed out, romance is also closely tied to social status and value, though it purports to be an entirely private choice. We may easily recognize all these elements in Jane Eyre. Yet Bron të’s novel is not merely a popular romance, in that it is a work of great linguistic virtuosity that makes artistic use of its equivoc ality toward romantic passio n by dramatizing both sides of the issue. In one way Jane Eyre not only offers the popular romantic solutions of fantasy , but alsocriticizes them, appealing to feminists and other serious critics as well as to the public hunger for a happy and just ending. Thus both Bertha, the intemperate exotic, an icon of selfish and unrestrained sensuality and madness, whose symbol is destruct ive fire, and at the opposite pole, St. John, with his “ice kiss,” who renounc es personal happiness, are both eventually extirpated from the text. These two extremes are found wanting as models for Jane, who must find a way to accommodate “feeling” (including desire) within a Christian framework. Though Cinderella’ s rescue from poverty by a prince who chooses her is often cited as a mythic source for Jane Eyre, on a deeper level the fantasy is the tale of Beau ty and the Beas t, in which the true lover rehumanizes the savage beast, as Jane saves the rake/sinner from sin, “guiding” and helping him as she does when she first meets him on the road, as well as at the end. Perhaps this view allows us to see why Jane Eyre continues to be both a central text in the Western literary canon and a durable fantasy in the popular public imagination. Jane Eyre as heroine is best rememb ered for the strong will that bravely questio ns expected roles for women and asserts a woman’ s right to love and pleasure. Though Brontë’ s solution is Victorian and traditional, the novel is a unique and pivotal contribution to the modern view of romantic love and the problem of sexual desire for women, an attempt to endorse as well as regulate female passion. Jane Eyre suggests emotional equality , “sameness,” “kinship,” and “likeness” of character as the basis of a new kind of mutu al love and respect, in contrast to the social and economic inequalities that formed the nineteenth-century context of courtship and marriage. This view is not asserted in revolutionary form; no transformation of the social order is proposed. On the contrary , at the conclusion of the novel, the bond between Jane and Rochester allows the lovers to withdraw from an unsatisfactory society into a cocoon of protective love. But the romance on which the dramatized versions of the novel focus is only a part of the narrative of Jane’ s “autobiography ,” the tale of how she grows into being fully human. In the end the experience of romantic love illuminates but does not wholly constitute female identity , so that passion itself is a metaphor for the drive to female selfhood and individuation, thekey to a search for a larger meaning than that prescribed for women by cultural norms. Jane Eyre’ s self-respect is integral to her understanding the full meaning of sexual love, even while love itself constitutes a necessary living ener gy, without which life has no light, fire, or air . Susan Ostr ov Weisser is a professor in the English Department at Adelphi University , where she specializes in nineteenth-century literature and women’ s studie s, and teaches frequently in the Honors College. Dr. Weisser ’s Ph.D. is from Columbia University . She is the author and editor of three books in women’ s studies. Her research centers on women and romantic love in nineteenth-cen tury literature, as well as in contemporary popular culture. OceanofPDF .comTo W. M. THACKERA Y, ESQ. THIS WORK IS RESPECTFULL Y INSCRIBED, BY THE AUTHOR OceanofPDF .comPreface to the Second Edition A preface to the first edition of Jane Eyr e being unnecessary , I gave none: this second edition demands a few words both of acknowledgment and miscellaneous remark. My thanks are due in three quarters. To the Public, for the indulgent ear it has inclined to a plain tale with few pretensions. To the Press, for the fair field its honest suffragec has opened to an obscure aspirant. To my Publishers, for the aid their tact, their energy, their pract ical sense, and frank liberality have af forded an unknown and unrecommended Author . The Press and the Public are but vague personifications for me, and I must thank them in vague terms; but my Publishers are definite: so are certain generous critics who have encouraged me as only large-hearted and high- minded men know how to encourage a struggling stranger; to them, i.e., to my Publishers and the select Reviewers, I say cordially , Gentlemen, I thank you from my heart. Having thus acknowledged what I owe those who have aided and approved me, I turn to another class; a small one, so far as I know , but not, therefore, to be overlooked. I mean the timorous or carping few who doubt the tendency of such books as Jane Eyre: in whose eyes whatever is unusual is wrong; whose ears detect in each protest against bigotry—that parent of crime—an insult to piety, that regent of God on earth. I would suggest to such doubters certain obvious distinctions; I would remind them of certain simple truths. Conventionality is not morality . Self-righteousness is not religion. To attack the first is not to assail the last. To pluck the mask from the face ofthe Pharisee, is not to lift an impious hand to the Crown of Thorns. These things and deeds are diametrically opposed; they are as distinct as is vice from virtue. Men too often confound them; they should not be confounded: appearance should not be mistaken for truth; narrow human doctrines, that only tend to elate and magnify a few, should not be substituted for the world-redeem ing creed of Christ. There is—I repeat it— a difference; and it is a good, and not a bad action to mark broadly and clearly the line of separation between them. The world may not like to see these ideas dissevered, for it has been accustomed to blend them; finding it convenient to make external show pass for sterling worth—to let white-washed walls vouch for clean shrines. It may hate him who dares to scrutinise and expose—to rase the gilding, and show base metal under it—to penetrate the sepulchre, and reveal charnel relics: but, hate as it will, it is indebted to him. Ahab did not like Micaiah, because he never prophesied good concerning him, but evil: probably he liked the sycophant son of Chenaanah better; yet might Ahab have escaped a bloody death, had he but stopped his ears to flattery , and opened them to faithful counsel.1 There is a man in our own days whose words are not framed to tickle delicate ears: who, to my thinking, comes before the great ones of society , much as the son of Imlah came before the throned Kings of Judah and Israel; and who speaks truth as deep, with a power as prophet-like and as vital—a mien as dauntless and as daring. Is the satirist of Vanity Fair admired in high places?2 I cannot tell; but I think if some of those amongst whom he hurls the Greek fired of his sarcasm, and over whom he flashes the levin-brande of his denuncia tion, were to take his warnings in time— they or their seed might yet escape a fatal Ramoth-Gilead. Why have I alluded to this man? I have alluded to him, Reader , because I think I see in him an intellect profounder and more unique than his contemporaries have yet recogn ised; because I regard him as the first social regenerator of the day—as the very master of that working corps who would restore to rectitude the warped system of things; because I think no commentator on his writings has yet found the comparison that suits him,the terms which rightly characte rise his talent. They say he is like Fielding: they talk of his wit, humour , comic powers.3 He resembles Fielding as an eagle does a vulture: Fielding could stoop on carrion, but Thackeray never does. His wit is bright, his humour attractive, but both bear the same relation to his serious genius, that the mere lambent sheet-lightning playing under the edge of the summer -cloud, does to the electric death-spark hid in its womb. Finally , I have alluded to Mr. Thackeray , because to him—if he will accept the tribute of a total stranger—I have dedicated this second edition of Jane Eyr e. Currer Bell Dec. 21st, 1847 OceanofPDF .comNote to the Third Edition I avail myself of the opportunity which a third edition of Jane Eyre affords me, of again addressing a word to the Public, to explain that my claim to the title of novelist rests on this one work alone. If, therefore, the authorship of other works of fiction has been attributed to me, an honour is awarded where it is not merited; and consequently , denied where it is justly due. This explanation will serve to rectify mistakes which may already have been made, and to prevent future errors. Currer Bell April 13th, 1848 OceanofPDF .comChapter I There was no possibility of taking a walk that day. We had been wandering, indeed, in the leafless shrubbery an hour in the morning; but since dinner (Mrs. Reed, when there was no company , dined early) the cold winter wind had brought with it clouds so sombre, and a rain so penetrating, that further out-door exercise was now out of the question. I was glad of it. I never liked long walks, especially on chilly afternoons: dreadful to me was the coming home in the raw twilight, with nipped fingers and toes, and a heart saddened by the chidings of Bessi e, the nurse, and humbled by the consciousness of my physical inferiority to Eliza, John, and Geor giana Reed. The said Eliza, John, and Geor giana were now clustered round their mamma in the drawing-room; she lay reclined on a sofa by the fireside, and with her darlings about her (for the time neither quarrelling nor crying) looked perfectly happy . Me, she had dispensed from joining the group, saying, “She regretted to be under the necessity of keeping me at a distance; but that until she heard from Bessie, and could discover by her own observation that I was endeavoring in good earnest to acqu ire a more sociable and childlike disposition, a more attractive and sprightl y manner— something lighter , franker , more natural, as it were—she really must exclude me from privileges intended only for contented, happy little children.” “What does Bessie say I have done?” I asked. “Jane, I don’t like cavillers or questioners: besides, there is something truly forbidding in a child taking up her elders in that manner . Be seated somewhere; and until you can speak pleasantly , remain silent.” A small breakfast-room adjoine d the drawing-room: I slipped in there. It contained a book-case: I soon possessed myself of a volume, taking carethat it should be one stored with pictures. I mounted into the window-seat: gathering up my feet, I sat cross -legged, like a Turk; and, havin g drawn the red moreen curtain nearly close, I was shrined in double retirement. Folds of scarlet drapery shut in my view to the right hand; to the left were the clear panes of glass protecting, but not separating, me from the drear November day. At intervals, while turning over the leaves of my book, I studied the aspect of that winte r afternoon. Afar it offered a pale blank of mist and cloud; near, a scene of wet lawn and storm-beat shrub, with ceaseless rain sweeping away wildly before a long and lamentable blast. I returne d to my book—Bewick’ s History of British Birds:4 the letter- press thereof I cared little for, generally speaking; and yet there were certain introductory pages that, child as I was, I could not pass quite as a blank. They were those which treat of the haunts of sea-fowl; of “the solitary rocks and prom ontories” by them only inhabited; of the coast of Norway , studded with isles from its southern extremity , the Lindeness, or Naze, to the North Cape— Wher e the Northern Ocean, in vast whirls, Boils r ound the naked, melancholy isles Of farthest Thule; and the Atlantic sur ge Pours in among the stormy Hebrides.5 Nor could I pass unnoticed the suggestion of the bleak shores of Lapland, Siberia, Spitzber gen, Nova Zembla, Iceland, Greenland, with “the vast sweep of the Arctic Zone, and those forlorn regions of dreary space—that reservoir of frost and snow , where firm fields of ice, the accumulation of centuries of winters, glazed in Alpine heights above heights, surround the pole, and concentre the multiplied rigors of extreme cold.” Of these death- white realms I formed an idea of my own—shadowy , like all the half- comprehended notions that float dim through children’ s brains, but strangely impressive. The words in these introductory pages connected themselves with the succeeding vignettes, and gave significance to the rock standing up alone in a sea of billow and spray; to the broken boat stranded on a desolate coast; to the cold and ghastly moon glancing through bars of cloud at a wreck just sinking.I cannot tell what sentiment haunted the quiet, solitary church-yard, with its inscribed headstone, its gate, its two trees, its low horizon, girdled by a broken wall, and its newly-risen crescent, attesting the hour of eventide. The two ships becalmed on a torpid sea, I believed to be marine phantoms. The fiend pinning down the thief ’s pack behind him, I passed over quickly: it was an object of terror . So was the black, horned thing, seated aloof on a rock, surveyin g a distant crowd surrounding a gallows. Each picture told a story; mysterious often to my undeveloped understanding and imperfect feelings, yet ever profoundly interesting; as interesting as the tales Bessie sometimes narrated on winter evenings, when she chan ced to be in good humor; and when, having brought her ironing- table to the nursery hearth, she allowed us to sit about it, and while she got up Mrs. Reed’ s lace frills, and crimped her night-cap borders, fed our eager attention with passages of love and adventure taken from old fairy tales and older ballads; or (as at a later period I discovered) from the pages of Pamela, and Henry , Earl of Mor eland.6 With Bewick on my knee, I was then happy; happy at least in my way. I feared nothing but interruption, and that came too soon. The breakfast-room door opened. “Boh! Madam Mope!” cried the voice of John Reed; then he paused: he found the room apparently empty . “Where the dickens is she?” he continued. “Lizzy , Geor gy!” (calling to his sisters), ‘Joan is not here: tell mamma she is run out into the rain—bad animal!” “It is well I drew the curtain,” thought I; and I wished fervently he might not discover my hiding-place: nor would John Reed have found it out himself; he was not quick eithe r of vision or conception; but Eliza just put her head in at the door and said at once— “She is in the window-seat, to be sure, Jack.”And I came out immediately; for I trembled at the idea of being dragged forth by the said Jack. “What do you want?” I asked, with awkward dif fidence. “Say , ‘What do you want, Master Reed?’ ” was the answer . “I want you to come here;” and, seating himself in an arm-chair , he intimated by a gesture that I was to approach and stand before him. John Reed was a school-boy of fourteen years old—four years older than I, for I was but ten—lar ge and stout for his age, with a dingy and unwholesome skin; thick lineaments in a spacious visage, heavy limbs and large extremities. He gorged himself habitually at table, which made him bilious,f and gave him a dim and bleared eye and flabby cheeks. He ought now to have been at school; but his mamma had taken him home for a month or two, “on account of his delicate health.” Mr. Miles, the master , affirmed that he would do very well if he had fewer cakes and sweet-meats sent him from home; but the mother ’s heart turned from an opinion so harsh, and inclined rather to the more refined idea that John’ s sallowness was owing to overapplication, and, perhaps, to pining after home. John had not much affection for his mother and sisters, and an antipathy to me. He bullied and punished me—not two or three times in the week, nor once or twice in the day, but continually : every nerve I had feared him, and every morsel of flesh on my bones shrunk when he came near. There were moments when I was bewildered by the terror he inspired, because I had no appeal whatever against either his menaces or his inflictions: the servants did not like to offend their young master by taking my part against him, and Mrs. Reed was blind and deaf on the subject: she never saw him strike or heard him abuse me, though he did both now and then in her very presence —more frequently , however , behind her back. Habitually obedient to John, I came up to his chair . He spent some three minutes in thrusting out his tongue at me as far as he could without damaging the roots. I knew he would soon strike, and, while dreading the blow , I mused on the disgusting and ugly appearance of him who would presently deal it. I wonderif he read that notion in my face; for, all at once, without speaking, he struck suddenly and strongly . I tottered, and, on regaining my equilibrium, retired back a step or two from his chair .“That is for your impudence in answering mamma a while since,” said he, “and for your sneaking way of getting behind curtains, and for the look you had in your eyes two minutes since, you rat!” Accustomed to John Reed’ s abuse, I never had an idea of replying to it; my care was how to endure the blow which would certainly follow the insult. “What were you doing behind the curtain?” he asked. “I was reading.” “Show the book.” I returned to the window and fetched it thence. “You have no business to take our books; you are a dependen t, mamma says; you have no money; your father left you none; you ought to beg, and not to live here with gentlemen ’s children like us, and eat the same meals we do, and wear clothes at our mamma’ s expense. Now , I’ll teach you to rummage my bookshelves; for they are mine; all the house belongs to me, or will do in a few years. Go and stand by the door, out of the way of the mirror and the windows.” I did so, not at first aware what was his intention; but when I saw him lift and poise the book, and stand in act to hurl it, I instinctively started aside with a cry of alarm—not soon enough, however: the volume was flung, it hit me, and I fell, striking my head against the door and cutting it. The cut bled, the pain was sharp: my terror had passed its climax; other feelings succeeded. “Wicked and cruel boy!” I said. “You are like a murderer—you are like a slave-driver—you are like the Roman emperors!” I had read Gold smith’ s History of Rome, and had formed my opinion of Nero, Caligula, &c.7 Also I had drawn parallels in silence, which I never thought thus to have declared aloud. “What! what!” he cried, “did she say that to me? Did you hear her, Eliza and Geor giana? Won’t I tell mamma? But first—” He ran headlong at me; I felt him grasp my hair and my shoulder ; he had closed with a desperate thing. I really saw in him a tyrant—a murderer . Ifelt a drop or two of blood from my head trickle down my neck, and was sensible of some pungent suffering: these sensations, for the time, predominated over fear, and I received him in frantic sort. I don’t very well know what I did with my hands , but he called me “Rat! rat!” and bellowed out aloud. Aid was near him; Eliza and Geor giana had run for Mrs. Reed, who was gone up stairs; she now came upon the scene, followed by Bessie and the maid Abbot. We were parted; I heard the words: “Dear! dear! What a fury to fly at Master John!” “Did ever anybody see such a picture of passion!” Then Mrs. Reed subjoined: “Take her away to the red-room, and lock her in there.” Four hands were immediately laid upon me, and I was borne up stairs. OceanofPDF .comChapter II I resisted all the way: a new thing for me, and a circumstance which greatly strengthened the bad opinion Bessie and Miss Abbot were disposed to entertain of me. The fact is, I was a trifle beside myself; or, rather , out of myself, as the French would say; I was conscious that a moment’ s mutiny had already rendered me liable to strange penalties, and, like any other rebel slave, I felt resolved, in my desperation, to go all lengths. “Hold her arms, Miss Abbot; she’ s like a mad cat.” “For shame! for shame!” cried the lady’ s maid. “What shocking conduct, Miss Eyre, to strike a young gentleman, your benefactress’ son! your young master!” “Master! How is he my master? Am I a ervant?” “No; you are less than a servant, for you do nothing for your keep. There, sit down and think over your wickedness.” They had got me by this time into the apartment indicated by Mrs. Reed, and had thrust me upon a stool; my impulse was to rise from it like a spring; their two pairs of hands arrested me instantly . “If you don’t sit still, you must be tied down,” said Bessie. “Miss Abbot, lend me your garters; she would break mine directly .” Miss Abbot turned to divest a stout leg of the necessary ligature. This preparation for bonds, and the additional ignominy it inferred, took a little of the excitement out of me. “Don’ t take them of f,” I cried; “I will not stir .” In guaranty whereof I attached myself to my seat by my hands. “Mind you don‘t,” said Bessie; and when she had ascertained that I was really subsiding, she loosened her hold of me; then she and Miss Abbotstood with folded arms, looking darkly and doubtfully on my face, as incredulous of my sanity . “She never did so before,” at last said Bessie, turning to the Abigail.g “But it was always in her,” was the reply . “I’ve told missis often my opinion about the child, and missis agreed with me. She’s an underhand little thing; I never saw a girl of her age with so much cover .”h Bessie answered not; but ere long, addressing me, she said, “You ought to be aware, miss, that you are under obligations to Mrs. Reed. She keeps you; if she were to turn you off, you would have to go to the poor -house.” I had nothing to say to these words; they were not new to me; my very first recollection of existence included hints of the same kind. This reproach of my dependen ce had become a vague sing-song in my ear; very painful and crushing, but only half intelligible. Miss Abbot joined in: “And you ought not to think yourself on an equality with the Misses Reed and Master Reed, because missis kindly allows you to be brought up with them. They will have a great deal of money , and you will have none; it is your place to be humble, and to try to make yourself agreeable to them.” “What we tell you is for your good,” added Bessie, in no harsh voice; “you should try to be useful and pleasant, then perhaps you would have a home here; but if you become passionate and rude, missis will send you away , I am sure.” “Besides,” said Miss Abbot, “God will punish her; he might strike her dead in the midst of her tantrums, and then where would she go? Come, Bessie, we will leave her; I wouldn’ t have her heart for anything. Say your prayers, Miss Eyre, when you are by yourself; for if you don’t repent, something bad might be permitte d to come down the chimney and fetch you away .” They went, shutting the door , and locking it behind them. The bed-room was a spare chamber , very seldom slept in; I might say never , indeed, unless when a chance influx of visitors at Gateshead Hall rendered it necessary to turn to account all the accommodation it contained;yet it was one of the largest and stateliest chambers in the mansion. A bed, supported on massive pillars of mahogany , hung with curtains of deep red damask, stood out like a tabernacle in the centre; the two large windows, with their blinds always drawn down, were half shrouded in festoons and falls of similar drapery; the carpet was red; the table at the foot of the bed was covered with a crimson cloth; the walls a soft fawn-color , with a blush of pink in it; the wardrobe, the toilet-table, the chairs, were of darkly polished old mahogany . Out of these deep surrounding shades rose high, and glared white, the piled-up mattresses and pillows of the bed, spread with a snowy Marseillesi counterpane. Scarcely less prominent was an ample, cushioned easy-chair near the head of the bed, also white, with a footstool before it; and looking, as I thought, like a pale throne. This room was chill, because it seldom had a fire; it was silent, because remote from the nursery and kitchens; solemn, because it was known to be so seldo m enter ed. The housemaid alone came here on Saturdays, to wipe from the mirrors and the furniture a week’ s quiet dust; and Mrs. Reed, herself, at far intervals, visited it to review the contents of a certain secret drawer in the wardrobe, where were stored divers parchments, her jewel- casket, and a miniature of her deceased husband; and in those last words lies the secret of the red-room-th e spell which kept it so lonely in spite of its grandeur . Mr. Reed had been dead nine years; it was in this chamber he breathed his last; here he lay in state; hence his coffin was borne by undertaker ’s men; and, since that day, a sense of dreary consecration had guarded it from frequent intrusion. My seat, to which Bessie and the bitter Miss Abbot had left me riveted, was a low ottoman, near the marble chimney-piece; the bed rose before me; to my right hand there was the high, dark wardrobe, with subdued, broken reflections varying the gloss of its panels; to my left were the muffled windows; a great looking-glass between them repeated the vacant majesty of the bed and room. I was not quite sure whether they had locked the door; and when I dared move, I got up, and went to see. Alas! yes; no jail was ever more secure. Returning, I had to cross before the looking-glass; my fascinated glance involuntarily explored the depth it revealed. All lookedcolder and darker in that vision ary hollow than in reality; and the strange little figure there gazing at me, with a white face and arms specking the gloom, and glittering eyes of fear moving where all else was still, had the effect of a real spirit. I thought it like one of the tiny phantom s, half fairy, half imp, Bessie’ s evening stories represented as coming up out of lone, ferny dells,j in moor s, and appearing before the eyes of belated travellers. I returned to my stool. Superstition was with me at that moment, but it was not yet her hour for complete victory . My blood was still warm; the mood of the revolted slave was still bracing me with its bitter vigor; I had to stem a rapid rush of retrospective thought before I quailed to the dismal present. All John Reed’ s violent tyrannies, all his sisters’ proud indifference, all his mother ’s aversion, all the servants’ partiality , turned up in my disturbed mind like a dark deposit in a turbid well. Why was I alway s suffering, always brow-beaten, always accused, forever condemned? Why could I never please? Why was it useless to try to win any one’s favor? Eliza, who was headstrong and selfish, was respected. Geor giana, who had a spoiled temper , a very acrid spite, a captious and insolent carriage,k was universally indulged. Her beauty—her pink cheeks, and golden curls—see med to give delight to all who looked at her, and to purchase indemnity for every fault. John, no one thwarted, much less punished, though he twisted the necks of the pigeons, killed the little pea-chicks,l set the dogs at the sheep, stripp ed the hothouse vines of their fruit, and broke the buds off the choicest plants in the conservatory; he called his mother “old girl,” too; sometimes reviled her for her dark skin, similar to his own; bluntly disregardedher wishes; not unfrequently tore and spoiled her silk attire; and he was still “her own darling.” I dared commit no fault; I strove to fulfil every duty; and I was termed naughty and tiresome, sullen and sneaking, from morning to noon, and from noon to night. My head still ached and bled with the blow and fall I had received. No one had reproved John for wantonly striking me; and because I had turned against him to avert further irrational violence, I was loaded with general opprobrium.“Unjust! unjust! ” said my reason, forced by the agonizing stimulus into precocious though transitory power; and Resolve, equally wrought up, instigated some strange expedient to achieve escape from insupportable oppression—as running away , or, if that could not be effected, never eating or drinking more, and letting myself die. What a consternation of soul was mine that dreary afternoon! How all my brain was in tumult, and all my heart in insurrection! Yet in what darkness, what dense ignorance, was the mental battle fought! I could not answer the ceaseless inward question— why I thus suffered; now, at the distance of—I will not say how many years, I see it clearly . I was a discord in Gateshead Hall; I was like nobody there; I had nothing in harmony with Mrs. Reed, or her children, or her chosen vassalage. If they did not love me, in fact, as little did I love them. They were not bound to regard with affection a thing that could not sympathize with one among them; a heteroge neous thing, opposed to them in temperament, in capacity , in propensities; a useless thing, incapable of serving their interes t, or adding to their pleasure; a noxious thing, cherishing the germs of indignation at their treatment-of contempt of their judgment. I know that, had I been a sanguine, brilliant, careless, exacting, handsome, romping child, though equally dependent and friendless, Mrs. Reed would have endured my presence more complacently; her children would have entertained for me more of the cordiality of fellow-feeling; the servants would have been less prone to make me the scape-goat of the nursery . Daylight began to forsake the red-room. It was past four o‘clock, and the beclouded aftern oon was tending to drear twilight. I heard the rain still beating continuo usly on the stair-case window , and the wind howling in the grove behind the hall. I grew by degrees cold as a stone, and then my courage sunk. My habitual mood of humiliation, self-doubt, forlorn depression, fell damp on the embers of my decaying ire. All said I was wicked, and perhaps I might be so—what thought had I been but just conceiving, of starving myself to death! That certainly was a crime; and was I fit to die? or was the vault under the chancel of Gateshead church an inviting bourne?m In such vault, I had been told, did Mr. Reed lie buried; and led by this thought to recall his idea, I dwelt on it with gathering dread.I could not remember him, but I knew that he was my own uncle—my mother ’s brother; that he had taken me when a parentless infant to his house; and that, in his last moments, he had",
      "density_breakdown": {
        "Metaphor": 5.537692032868882,
        "Simile": 4.64451589853519,
        "Imagery": 13.39764201500536,
        "Symbolism": 5.894962486602358,
        "Dialogue": 0.0,
        "Foreshadowing": 6.252232940335834,
        "Juxtaposition": 11.789924973204716,
        "Repetition": 4.287245444801715,
        "TOTAL_DENSITY": 51.80421579135405
      }
    },
    "rising_action": {
      "chapter_range": "5-22",
      "narrative_primary": 14,
      "optimized_primary": 22,
      "device_density_score": 56.43864975888552,
      "improvement_percent": 10.85738994745302,
      "optimization_applied": true,
      "chapter_text": "share of all my possessions.” “You play a farce, which I merely laugh at.” “I ask you to pass through life at my side—to be my second self, and best earthly companion.” “For that fate you have already made your choice, and must abide by it.” “Jane, be still a few moments; you are over -excited; I will be still too.” A waft of wind came sweeping down the laurel-walk, and trembled through the boughs of the chestnut; it wandered away—away—to an indefinite distance—it died. The nightingale’ s song was then the only voice of the hour; in listening to it, I again wept. Mr. Rochester sat quiet, looking at me gently and seriously . Some time passed before he spok e; he at last said— “Come to my side, Jane, and let us explain and understand one another .”“I will never again come to your side; I am torn away now, and cannot return.” “But, Jane, I summon you as my wife; it is you only I intend to marry .” I was silent; I thought he mocked me. “Come, Jane—come hither .” “Your bride stands between us.” He rose, and with a stride reached me. “My bride is here,” he said, again drawing me to him, “because my equal is here, and my likeness. Jane, will you marry me?” Still I did not answer , and still I writhed myself from his grasp; for I was still incredulous. “Do you doubt me, Jane?” “Entirely .” “You have no faith in me?” “Not a whit.” “Am I a liar in your eyes?” he asked, passionately . “Little sceptic, you shall be conv inced. What love have I for Miss Ingram? None, and that you know . What love has she for me? None, as I have taken pains to prove; I caused a rumor to reach her that my fortune was not a third of what was supposed, and after that I presented myself to see the result; it was coldness both from her and her mother . I would not—I could not—marry Miss Ingram. You—you strange—you almost unearthly thing! I love as my own flesh. You—poor and obscure, and small and plain, as you are—I entreat to accept me as a husband.” “What, me!” I ejaculated, beginning in his earnestness—and especially in his incivility—to credit his sincerity; “me, who have not a friend in the world but you—if you are my friend; not a shilling but what you have given me?” “You, Jane. I must have you for my own—entirely my own. Will you be mine? Say yes, quickly .” “Mr. Rochester , let me look at your face; turn to the moonlight.”“Why?” “Because I want to read your countenance; turn!” “There; you will find it scarcely more legible than a crumpled, scratched page. Read on; only make haste, for I suf fer.” His face was very much agitated and very much flushed, and there were strong workings in the features, and strange gleams in the eyes. “Oh, Jane, you torture me!” he exclaimed. “With that searchin g and yet faithful and generous look you torture me!” “How can I do that? If you are true, and your offer real, my only feelings to you must be gratitude and devotion—they cannot torture.” “Gratitude!” he ejaculated; and added wildly—‘Jane, accept me quickly . Say, Edward—give me my name—Edward, I will marry you. “Are you in earnest? Do you truly love me? Do you sincerely wish me to be your wife?” “I do; and if an oath is necessary to satisfy you, I swear it.” “Then, sir , I will marry you.” “Edward—my little wife!” “Dear Edward!” “Come to me—come to me entirely now,” said he; and added, in his deepest tone, speaking in my ear as his cheek was laid on mine, “Make my happiness—I will make yours.” “God pardon me!” he subjoined ere long, “and man meddle not with me; I have her , and will hold her .” “There is no one to meddle, sir . I have no kindred to interfere.” “No—that is the best of it,” he said. And if I had loved him less I should have thought his accent and look of exultation savage ; but, sitting by him, roused from the nightmare of parting—called to the paradise of union—I thought only of the bliss given me to drink in so abundant a flow. Again and again he said, “Are you happy , Jane?” And again and again I answered, “Yes.” After which he murmured, “It will atone—it will atone. Have I not found her friendless, and cold, and comfortless? Will I not guard, andcherish, and solace her? Is there not love in my heart, and constancy in my resolves? It will expiate at God’ s tribunal. I know my Maker sanctions what I do. For the world’ s judgment—I wash my hands thereof. For man’ s opinion—I defy it.” But what had befallen the night? The moon was not yet set, and we were all in shadow; I could scarcely see my master ’s face, near as I was. And what ailed the chestnut-tree? It writhed and groaned, while wind roared in the laurel-walk, and came sweeping over us. “We must go in,” said Mr. Roch ester; “the weather changes. I could have sat with thee till morning, Jane.” “And so,” thought I, “could I with you.” I should have said so, perhaps, but a livid, vivid spark leaped out of a cloud at which I was looking, and there was a crack, a crash, and a close rattling peal; and I thought only of hiding my dazzled eyes against Mr. Rochester ’s shoulder . The rain rushed down. He hurried me up the walk, through the grounds, and into the house; but we were quite wet before we could pass the threshold. He was taking off my shawl in the hall, and shaking the water out of my loosened hair, when Mrs. Fairf ax emer ged from her room. I did not observe her at first, nor did Mr. Rochester . The lamp was lighted. The clock was on the stroke of twelve. “Hasten to take off your wet things,” said he; “and before you go, good- night-good-night, my darling!” He kissed me repeatedly . When I looked up, on leaving his arms, there stood the widow , pale, grave, and amazed. I only smiled at her, and ran up stairs. “Explana tion will do for another time,” thought I. Still, when I reached my chamber , I felt a pang at the idea she should even temporarily misconstrue what she had seen. But joy soon effaced every other feeling; and loud as the wind blew , near and deep as the thunder crashed, fierce and frequent as the lightning gleamed, cataract-like as the rain fell during a storm of two hours’ duration, I experienced no fear, and little awe. Mr. Rochester came thrice to my door, in the course of it, to ask if I was safe and tranquil; and that was comfort, that was strength for anything. Before I left my bed in the morning, little Adèle came running in to tell me that the great horse-chestn ut at the bottom of the orchard had beenstruck by lightning in the night, and half of it split away . OceanofPDF .comChapter XXIV As I rose and dressed, I thought over what had happened, and wondered if it were a dream. I could not be certain of the reality till I had seen Mr. Rochester again, and heard him renew his words of love and promise. While arranging my hair, I looked at my face in the glass, and felt it was no longe r plain; there was hope in its aspect and life in its color; and my eyes seemed as if they had beheld the fount of fruition, and borrowed beams from the lustrous ripple. I had often been unwilling to look at my master , because I feared he could not be pleased at my look, but I was sure I might lift my face to his now and not cool his affection by its expression. I took a plain but clean and light summer dress from my drawer and put it on; it seemed no attire had ever so well become me, because none had I ever worn in so blissful a mood. I was not surpri sed, when I ran down into the hall, to see that a brilliant June morning had succeeded to the tempest of the night, and to feel, through the open glass door, the breathing of a fresh and fragrant breeze. Nature must be gladsome when I was so happy . A beggar -woman and her little boy, pale, ragged objects both, were coming up the walk, and I ran down and gave them all the money I happened to have in my purse, some three or four shillings; good or bad they must partake of my jubilee. The rooks cawed, and blither birds sung, but nothing was so merry or so musical as my own rejoicing heart. Mrs. Fairfax surprised me by looking out of the window with a sad countenance, and saying, gravel y, “Miss Eyre, will you come to breakfast?” During the meal she was quiet and cool, but I could not undeceive her then. I must wait for my master to give explanations; and so must she. I ate what I could, and then I hastened up stairs. I met Adèle leaving the school-room. “Where are you going? It is time for lessons.”“Mr. Rochester has sent me away to the nursery .” “Where is he?” “In there,” pointing to the apartm ent she had left; and I went in, and there he stood. “Come, and bid me good-mornin g,” said he. I gladly advanced, and it was not merely a cold word now, or even a shake of the hand that I received, but an embrace and a kiss. It seemed natural ; it seemed genial to be so well loved, so caressed, by him. “Jane, you look blooming, and smiling, and pretty ,” said he; “truly pretty this morning. Is this my pale little elf? Is this my mustard-seed? This little sunny-faced girl, with the dimpled cheek and rosy lips; the satin-smooth hazel hair, and the radiant hazel eyes?” (I had green eyes, reader; but you must excuse the mistake, for him they were new-dyed, I suppose.) “It is Jane Eyre, sir .” “Soon to be Jane Rochester ,” he added; “in four weeks, Janet, not a day more. Do you hear that?” I did, and I could not quite comprehend it; it made me giddy . The feeling the announcement sent throug h me was something stronger than was consistent with joy, something that smote and stunned; it was, I think, almost fear . “You blushed, and now you are white, Jane; what is that for?” “Because you gave me a new name—Jane Rochester; and it seems so strange.” “Yes, Mrs. Rochester ,” said he; “young Mrs. Rochester; Fairfax Rochester ’s girl-bride.” “It can never be, sir; it does not sound likely . Human beings never enjoy complete happin ess in this world. I was not born for a differen t destiny to the rest of my species; to imagine such a lot befalling me is a fairy tale, a daydream.” “Which I can and will realize. I shall begin to-day . This mornin g I wrote to my banker in London to send me certain jewels he has in his keeping, heir-looms for the ladies of Thornfield. In a day or two I hope to pour theminto your lap; for every privilege, every attention, shall be yours, that I would accord to a peer ’s daughter , if about to marry her .” “Oh, sir! never mind jewels! I don’t like to hear them spoken of. Jewels for Jane Eyre sounds unnatural and strange; I would rather not have them.” “I will myself put the diamond chain round your neck, and the circlet on your forehead, which it will become; for nature, at least, has stamped her patent of nobility on this brow , Jane; and I will clasp the bracel ets on these fine wrists, and load these fairy like fingers with rings.” “No, no, sir! think of other subjects, and speak of other things, and in another strain. Don’ t address me as if I were a beauty; I am your plain, Quakerish governess.” “You are a beauty , in my eyes; and a beauty just after the desire of my own heart, delicate and aerial.” “Puny and insignificant, you mean. You are dreaming, sir—or , you are sneering. For God’ s sake, don’ t be ironical!” “I will make the world acknowledge you a beauty , too,” he went on, while I really became uneasy at the strain he had adopted; because I felt he was either deluding himself or trying to delude me. “I will attire my Jane in satin and lace, and she shall have roses in her hair, and I will cover the head I love best with a priceless veil.” “And then you won’t know me, sir, and I shall not be your Jane Eyre any longer , but an ape in a harlequ in’s jacket—a jay in borrowed plumes. I would as soon see you, Mr. Rochester , tricked out in stage trappings, as myself clad in a court-lady’ s robe; and I don’t call you handsome, sir, though I love you most dearly—far too dearly to flatter you. Don’t flatter me.” He pursued his theme, however , without noticing my depre cation. “This very day I shall take you in the carriage to Millcote, and you must choose some dresses for yourself. I told you we should be married in four weeks. The wedding is to take place quietly, in the church down below yonder; and then I shall waft you away at once to town. After a brief stay there, I shall bear my treasure to regions nearer the sun; to French vineyards and Italian plains; and she shall see whatever is famous in old story and in modemrecord; she shall taste, too, of the life of cities; and she shall learn to value herself by just comparison with others.” “Shall I travel? and with you, sir?” “You shall sojourn at Paris, Rome, and Naples; at Florence, Venice, and Vienna; all the ground I have wandered over shall be re-trodden by you; wherever I stamped my hoof, your sylph’ s foot shall step also. Ten years since, I flew through Europe half mad, with disgust, hate, and rage as my companions; now I shall revisit it healed and cleansed, with a very angel as my comforter .” I laughed at him as he said this. “I am not an angel,” I asserted; “and I will not be one till I die; I will be myself, Mr. Rochester; you must neither expect nor exact anything celestial of me, for you will not get it any more than I shall get it of you, which I do not at all anticipate.” “What do you anticipate of me?” “For a little while you will, perhaps, be as you are now, a very little while; and then you will turn cool; and then you will be capricious; and then you will be stern, and I shall have much ado to please you; but when you get well used to me, you will, perhaps, like me again, Like me, I say, not love me. I suppose your love will effervesce in six months, or less. I have observed in books written by men, that period assigned as the farthest to which a husband ’s ardor extends. Yet, after all, as a friend and companion, I hope never to become quite distasteful to my dear master .” “Distasteful! and like you again! I think I shall like you again and yet again; and I will make you confess I do not only like, but love you—with truth, fervor , constancy .” “Yet, are you not capricious, sir?” “To wom en who please me only by their faces, I am the very devil when I find out they have neither souls nor hearts—when they open to me a perspective of flatness, triviality , and, perhaps, imbecility , coarseness, and ill-temper; but to the clear eye and eloquent tongue, to the soul made of fire, and the characte r that bends but does not break—at once supple and stable, tractable and consistent—I am ever tender and true.”“Had you ever experience of such a character , sir? Did you ever love such a one?” “I love it now .” “But before me; if I, indeed, in any respect come up to that difficult standard?” “I never met your likeness, Jane; you please me, and you master me—you seem to submit, and I like the sense of pliancy you impart; and while I am twining the soft, silken skein round my finger , it sends a thrill up my arm to my heart. I am influenced—conquered ; and the influence is sweeter than I can express; and the conquest I under go has a witchery beyond any triumph I can win. Why do you smile , Jane? What does that inexp licable, that uncanny turn of countenance mean?” “I was thinking, sir (you will excuse the idea; it was involuntary) , I was thinking of Hercules and Samson with their charm ers—” “You were, you little, elfish—” “Hush, sir! You don’t talk very wisely just now; any more than those gentlemen acted very wisely . However , had they been married, they would, no doubt, by their severity as husbands, have made up for their softness as suitors; and so will you, I fear. I wonder how you will answe r me a year hence, should I ask a favor it does not suit your convenience or pleasure to grant.” “Ask me something now, Janet—the least thing; I desire to be entreated —” “Indeed, I will, sir; I have my petition all ready .” “Speak! But if you look up and smile with that countenance, I shall swear concession before I know to what, and that will make a fool of me.” “Not at all, sir; I ask only this; don’t send for the jewels, and don’t crown me with roses; you might as well put a border of gold lace round that plain pocket-handkerchief you have there.” “I might as well ‘gild refined gold.’60 I know it; your request is grant ed, then—for the time. I will remand the order I despatched to my banker . Butyou have not yet asked for anything; you have prayed a gift to be withdrawn; try again.” “Well, then, sir; have the goodness to gratify my curiosity , which is much piqued on one point.” He looked disturbed. “What? what?” he said, hastily . “Curi osity is a dangerous petitioner; it is well I have not taken a vow to accord every request—” “But there can be no danger in complying with this, sir .” “Utter it, Jane; but I wish that instead of a mere inquiry into, perhaps, a secret, it was a wish for half my estate.” “Now , King Ahasuerus!61 What do I want with half your estate? Do you think I am a Jew-usurer , seeking good investment in land? I would much rather have all your confiden ce. You will not exclude me from your confidence, if you admit me to your heart?” “You are welcome to all of my confidence that is worth having, Jane; but, for God’ s sake, don’t desire a useless burden! Don’ t long for poison—don’ t turn out a downright Eve on my hands!” “Why not, sir? You have just been telling me how much you like to be conquered, and how pleasant over-persuasionfx is to you. Don’ t you think I had better take advantage of the confession, and begin and coax, and entreat —even cry and be sulky , if necessary—for the sake of a mere essay of my power?” “I dare you to any such experiment. Encroach, presume, and the game is up.” “Is it, sir? You soon give in. How stern you look now! Your eyebrows have become as thick as my finger , and your forehead resembl es, what, in some very astonishing poetry , I once saw styled, ‘a blue-piled thunder -loft.’ That will be your married look, sir , I suppose?” “If that will be your married look, I, as a Christian, will soon give up the notion of consor ting with a mere sprite or salamander . But what had you to ask, thing?—out with it.”“There, you are less than civil now; and I like rudeness a great deal better than flattery . I had rather be a thing than an angel. This is what I have to ask: Why did you take such pains to make me believe you wished to marry Miss Ingram?” “Is that all? Thank God, it is no worse!” And now he unknit his black brows; looked down, smiling at me, and stroked my hair, as if well pleased at seeing a danger averted. “I think I may confess,” he continued, “even although I should make you a little indignant, Jane—and I have seen what a fire-spirit you can be when you are indignant. You glowed in the cool moonlight last night, when you mutinied against fate, and claimed your rank as my equal. Janet, by-the-by , it was you who made me the of fer.” “Of course I did. But to the point, if you please, sir—Miss Ingram?” “Well, I feigned courtship of Miss Ingram, because I wished to render you as madly in love with me as I was with you; and I knew jealousy would be the best ally I could call in for the furtherance of that end.” “Excellent! Now you are small— not one whit bigger than the end of my little finger. It was a burning shame, and a scandalous disgrace, to act in that way. Did you think nothing of Miss Ingram’ s feelings, sir?” “Her feelings are concentrated in one—pride; and that needs humbling. Were you jealous, Jane?” “Never mind, Mr. Rochester; it is in no way interesting to you to know that. Answer me truly once more. Do you think Miss Ingram will not suffer from your dishonest coquetry? Won’t she feel forsaken and deserted?” “Impossible!—when I told you how she, on the contrary , deserted me; the idea of my insolvency cooled , or, rather , extinguished, her flame in a moment.” “You have a curious designing mind, Mr. Rochester . I am afraid your principles on some points are eccentric.” “My principles were never trained, Jane; they may have grown a little awry for want of attention.” “Once again, seriously . May I enjoy the great good that has been vouchsafed to me, without fearing that any one else is suffering the bitterpain I myself felt a while ago?” “That you may, my good little girl; there is not another being in the world has the same pure love for me as yourself—for I lay that pleasan t unction to my soul, Jane, a belief in your af fection.” 62 I turned my lips to the hand that lay on my shoulder . I loved him very much—more than I could trust myself to say—more than word s had power to express. “Ask something more,” he said, presently; “it is my delight to be entreated, and to yield.” I was again ready with my request. “Communicate your intentio ns to Mrs. Fairfax, sir; she saw me with you last night in the hall, and she was shocked. Give her some explan ation before I see her again. It pains me to be misjudged by so good a woman.” “Go to your room, and put on your bonnet,” he replied. “I mean you to accompany me to Millcote this morning; and while you prepare for the drive, I will enlighten the old lady’ s understanding. Did she think, Janet, you had given the world for love and considered it well lost?”63 “I believe she thought I had for gotten my station; and you yours, sir .” “Station! station !—your station is in my heart, and on the neck s of those who would insult you, now or hereafter . Go.” I was soon dressed; and when I heard Mr. Rochester quit Mrs. Fairfax’ s parlor , I hurried down to it. The old lady had been reading her morning portion of Scrip ture—the lesson for the day; her Bible lay open before her, and her spectacles were upon it. Her occupation, suspended by Mr. Rochester ’s announcement, seemed now forgotten; her eyes, fixed on the blank wall opposite, expressed the surprise of a quiet mind , stirred by unwonted tiding s. Seeing me, she roused herself; she made a sort of effort to smile, and framed a few words of congratulation; but the smile expired, and the sentence was abandoned unfinished. She put up her spectacles, shut the Bible, and pushed her chair back from the table. “I feel so astonished,” she began , “I hardly know what to say to you, Miss Eyre. I have surely not been dreaming, have I? Sometimes I half fall asleepwhen I am sitting alone, and fancy things that have never happ ened. It has seemed to me more than once, when I have been in a doze, that my dear husband, who died fifteen years since, has come in and sat down beside me; and that I have even heard him call me by name, Alice, as he used to do. Now can you tell me whether it is actually true that Mr. Rochest er has asked you to marry him? Don’ t laugh at me. But I really thought he came in here five minutes ago, and said that in a month you would be his wife.” “He has said the same thing to me,” I replied. “He has! Do you believe him? Have you accepted him?” “Yes.” She looked at me bewildered. “I could never have thought it. He is a proud man; all the Roche sters were proud; and his father at least liked money . He, too, has always been called careful. He means to marry you?” “He tells me so.” She surveyed my whole person; in her eyes I read that they had found no charm powerful enough to solve the enigma. “It passe s me!” she continued; “but no doubt it is true, since you say so. How it will answer I cannot tell; I really don’t know . Equality of position and fortune is often advisable in such cases; and there are twenty years of difference in your ages. He might almost be your father .” “No, indeed, Mrs. Fairfax!” exclaimed I, nettled; “he is nothing like my father! No one, who saw us together , would suppose it for an instant. Mr. Rochester looks as young, and is as young, as some men at five-and- twenty .” “Is it really for love he is going to marry you?” she asked. I was so hurt by her coldness and scepticism, that the tears rose to my eyes. “I am sorry to grieve you,” pursued the widow , “but you are so young and so little acquainted with men, I wished to put you on your guard. It is an old saying that ‘all is not gold that glitters’; and in this case I do fear there will be something found to be dif ferent to what either you or I expect.”“Why? am I a monster?” I said; “is it impossible that Mr. Rochester should have a sincere af fection for me?” “No, you are very well, and much improved of late; and Mr. Rochester , I dare say, is fond of you. I have always noticed that you were a sort of pet of his. There are times when, for your sake, I have been a little uneasy at his marked preferen ce, and have wished to put you on your guard; but I did not like to suggest even the possibility of wrong. I knew such an idea would shock, perhaps offend you; and you were so discreet, and so thoroughly modest and sensible, I hoped you might be trusted to protect yourself. Last night I cannot tell you what I suffered when I sought all over the house, and could find you nowhere, nor the master either; and then, at twelve o‘clock, saw you come in with him.” “Well, never mind that now,” I interrupted, impatiently; “it is enough that all was right.” “I hope all will be right in the end,” she said; “but, believe me, you cannot be too careful. Try and keep Mr. Rochester at a distance ; distrust yourself as well as him. Gentlemen in his station are not accustomed to marry their governesses.” I was growing truly irritated; happily , Adèle ran in. “Let me go—let me go to Millcote, too!” she cried. “Mr. Rochester won‘t, though there is so much room in the new carriage. Beg him to let me go, mademoiselle.” “That I will, Adèle;” and I hastened away with her, glad to quit my gloomy monitre ss. The carriage was ready; they were bringing it round to the front, and my master was pacing the pavement, Pilot following him backward and forward. “Adèle may accompany us, may she not, sir?” “I told her no. I’ll have no brats! I’ll have only you.” “Do let her go, Mr . Rochester , if you please; it would be better .” “Not it—she will be a restraint.” He was quite peremptory , both in look and voice. The chill of Mrs. Fairfax’ s warnings, and the damp of her doubts, were upon me; somethingof unsubstantiality and uncertainty had beset my hopes. I half lost the sense of power over him. I was about mechanically to obey him, without further remonstrance; but as he helped me into the carriage, he looked at my face. “What is the matter?” he asked; “all the sunshine is gone. Do you really wish the bairn to go? Will it annoy you if she is left behind?” “I would far rather she went, sir .” “Then off for your bonnet, and back, like a flash of lightning!” cried he to Adèle. She obeyed him with what speed she might. “After all, a single morning’ s interruption will not matter much,” said he, “when I mean shortly to claim you, your thoughts, conversation, and company , for life.” Adèle, when lifted in, commenced kissing me, by way of expressing her gratitude for my intercession; she was instantly stowed away into a corner on the other side of him. She then peeped round to where I sat; so stern a neighbor was too restrictive; to him, in his present fractious mood, she dared whisper no observations, nor ask of him any information. “Let her come to me,” I entrea ted; “she will, perhaps, trouble you, sir; there is plenty of room on this side.” He hand ed her over as if she had been a lap-dog; “I’ll send her to school yet,” he said, but now he was smiling. Adèle heard him, and asked if she was to go to school “sans mademoiselle?”fy “Yes,” he replied, “absolutely sans mademoiselle; for I am to take mademoiselle to the moon, and there I shall seek a cave in one of the white valleys among the volcano-tops, and mademoiselle shall live with me there, and only me.” “She will have nothing to eat—you will starve her ,” observed Adèle. “I shall gather manna for her morning and night; the plains and hill-sides in the moon are bleached with manna, Adèle.” “She will want to warm herself; what will she do for a fire?”“Fire rises out of the lunar mountains; when she is cold, I’ll carry her up to a peak and lay her down on the edge of a crater .” “Oh, qu‘elle y sera mal—peu comfortable!fz And her clothes, they will wear out; how can she get new ones?” Mr. Rochester professed to be puzzled. “Hem!” said he. “What would you do, Adèle? Cudgel your brains for an expedient. How would a white or a pink cloud answer for a gown, do you think? And one could cut a pretty enough scarf out of a rainbow .” “She is far better as she is,” concluded Adèle, after musing some time; “besides, she would get tired of living with only you in the moon. If I were mademoiselle, I would never consent to go with you.” “She has consented—she has pledged her word.” “But you can’t get her there; there is no road to the moon—it is all air, and neither you nor she can fly .” “Adèle, look at that field.” We were now outside Thornfield gates, and bowling lightly along the smoot h road to Millcote, where the dust was well laid by the thunder -storm, and where the low hedges and lofty timber trees on each side glistened green, and rain-refreshed. “In that field, Adèle, I was walking late one evening about a fortnight since—the even ing of the day you helped me to make hay in the orchard meadows; and as I was tired with raking swaths, I sat down to rest me on a stile; and there I took out a little book and a pencil, and began",
      "density_breakdown": {
        "Metaphor": 2.321843186283265,
        "Simile": 1.7860332202178961,
        "Imagery": 8.394356135024113,
        "Symbolism": 7.322736202893374,
        "Dialogue": 0.0,
        "Foreshadowing": 19.110555456331486,
        "Juxtaposition": 12.145025897481693,
        "Repetition": 5.3580996606536875,
        "TOTAL_DENSITY": 56.43864975888552
      }
    },
    "climax": {
      "chapter_range": "23-27",
      "narrative_primary": 26,
      "optimized_primary": 23,
      "device_density_score": 58.592354412290106,
      "improvement_percent": 32.25806451612904,
      "optimization_applied": true,
      "chapter_text": "to write about a misfortune that befell me long ago, and a wish I had for happy days to come; I was writing away very fast, though daylight was fading from the leaf, when something came up the path and stopped two yards off me. I looked at it. It was a little thing with a veil of gossamer on its head. I beckoned it to come near me; it stood soon at my knee. I never spoke to it, and it never spoke to me, in words; but I read its eyes, and it read mine; and our speechless colloquy was to this ef fect: “It was a fairy, and come from Elf-land, it said; and its errand was to make me happy; I must go with it out of the common world to a lonely place—such as the moon, for instance—and it nodded its head towards her horn, rising over Hay-hill; it told me of the alabaster cave and silver valewhere we might live. I said I should like to go; but reminded it, as you did me, that I had no wings to fly . “ ‘Oh,’ returned the fairy, ‘that does not signify! Here is a talisman will remove all difficulties;’ and she held out a pretty gold ring. ‘Put it,’ she said, ‘on the fourth finger of my left hand, and I am yours, and you are mine; and we shall leave earth, and make our own heaven yonder .’ She nodded again at the moon. The ring, Adèle, is in my breeches pocket under the disguise of a sovereign; but I mean soon to change it to a ring again.” “But what has mademoiselle to do with it? I don’t care for the fairy; you said it was mademoiselle you would take to the moon—!” “Mademoiselle is a fairy,” he said, whispering mysteriously . Whereupon I told her not to mind his badinage; and she, on her part, evinced a fund of genuine French scepticism; denominating Mr. Rochester “un vrai menteur ,”ga and assuring him that she made no account whatever of his “Contes de fée,”gb and that “du reste, il n‘y avait pas de fees et quand même il y en avait;”gc she was sure they would never appear to him, nor ever give him rings, or of fer to live with him in the moon. The hour spent at Millcote was a somewhat harassing one to me. Mr. Rochester obliged me to go to a certain silk warehouse; there I was ordered to choos e half a dozen dresses. I hated the business, I begged leave to defer it; no—it should be gone through with now. By dint of entreatie s expressed in energetic whispers, I reduced the half-dozen to two; these, however , he vowed he would select himself. With anxiety I watched his eye rove over the gay stores; he fixed on a rich silk of the most brilliant amethyst dye, and a superb pink satin. I told him, in a new series of whispers, that he might as well buy me a gold gown and a silver bonnet at once; I should certainly never venture to wear his choice. With infinite difficulty (for he was stubborn as a stone) I persuaded him to make an exchange in favor of a sober black satin and pearl-gray silk. “It might pass for the present,” he said; but he would yet see me “glittering like a parterre.”gd Glad was I to get him out of the silk warehouse, and then out of the jeweller ’s shop; the more he bought me, the more my cheek burned with a sense of annoyance and degradation. As we reentered the carriage, and I satback feverish and fagged, I remembered what in the hurry of events, dark and bright, I had wholly forgotten—the letter of my uncle, John Eyre, to Mrs. Reed; his intention to adop t me and make me his testatrix. “It would, indeed, be a relief,” I thought, “if I had ever so small an independency; I never can bear being dressed like a doll by Mr. Rochester , or sitting like a second Danaëge with the golden shower falling daily round me. I will write to Madeira the moment I get home, and tell my Uncle John I am going to be married, and to whom; if I had but a prospect of one day bringing Mr. Rochester an accession of fortune, I could better endure to be kept by him now.” And somewhat relieved by this idea (which I failed not to execute that day), I ventured once more to meet my master ’s and lover ’s eye; which most pertinaciou sly sought mine, though I averted both face and gaze. He smiled; and I thought his smile was such as a sultan might, in a blissful and fond moment, bestow on a slave his gold and gems had enriched; I crushed his hand , which was ever hunting mine, vigorously , and thrust it back to him, red with the passionate pressure. “You need not look in that way,” I said; “if you do, I’ll wear nothing but my old Lowood frocks to the end of the chapter . I’ll be married in this lilac gingham—you may make a dressing-gown for yourself out of the pearl- gray silk, and an infinite series of waistcoats out of the black satin.” He chuc kled; he rubbed his hands. “Oh, it is rich to see and hear her!” he exclaimed. “Is she original? Is she piquant? I would not exchange this one little English girl for the Grand Turk’s whole seraglio, gazelle eyes, houriforms and all!” The eastern allusion bit me again; “I’ll not stand you an inch in the stead of a seraglio,” I said; “so don’t consider me an equivalent for one; if you have a fancy for anything in that line, away with you, sir, to the bazaars of Stamboul, without delay; and lay out in extensive slave-purchases some of that spare cash you seem at a loss to spend satisfactorily here.” “And what will you do, Janet, while I am bargaining for so many tons of flesh and such an assortment of black eyes?” “I’ll be preparing myself to go out as a missionary to preach liberty to them that are enslaved—your harem inmates among the rest. I’ll getadmitted there, and I’ll stir up mutiny; and you, three-tailed bashawgf as you are, sir, shall in a trice find yourself fettered among our hands; nor will I, for one, conse nt to cut your bonds till you have signed a charter the most liberal that despot ever yet conferred.” “I would consent to be at your mercy , Jane.” “I would have no mercy , Mr. Rochester , if you supplicated for it with an eye like that. While you looked so, I should be certain that whatever charter you might grant under coercion, your first act, when released, would be to violate its conditions.” “Why , Jane, what would you have? I fear you will compel me to go through a private marriage ceremony , besides that performed at the altar. You will stipulate, I see, for peculiar terms—what will they be?” “I only want an easy mind, sir; not crushed by crowded obliga tions. Do you remember what you said of Céline Varens?—of the diamonds, the cashmeres, you gave her? I will not be your English Céline Varens. I shall continue to act as Adèle’ s governess; by that, I shall earn my board and lodging, and thirty pounds a year besides. I’ll furnish my own wardrobe out of that money , and you shall give me nothing, but—” “Well, but what?” “Your regard; and if I give you mine in return, that debt will be quit.” “Well, for cool native impudence, and pure innate pride, you haven’t your equal,” said he. “We are now approaching Thorn field. Will it please you to dine with me to-day?” he asked, as we reentered the gates. “No, thank you, sir .” “And what for , ‘no, thank you?’ if one may inquire.” “I never have dined with you, sir; and I see no reason why I should now; till—” “Till what? You delight in half phrases.” “Till I can’ t help it.” “Do you suppose I eat like an ogre, or a ghoul, that you dread being the companion of my repast?”“I have formed no suppositions on the subject, sir; but I want to go on as usual for another month.” “You will give up your governessing slavery at once.” “Indeed! begging your pardon, sir, I shall not. I shall just go on with it as usual. I shall keep out of your way all day, as I have been accustomed to do; you may send for me in the even ing, when you feel disposed to see me, and I’ll come then; but at no other time.” “I want a smoke , Jane, or a pinch of snuff, to comfort me under all this, ‘pour me donner une contenance,’gg as Adèle would say; and unfortu nately , I have neither my cigar -case nor my snuff-box. But listen—whisper—it is your time, now, little tyrant, but it will be mine presently; and when once I have fairly seize d you, to have and to hold, I’ll just—figurative ly speaking —attach you to a chain like this” (touching his watch-guard). “Yes, bonny wee thing, I’ll wear you in my bosom, lest my jewel I should tyne.”gh He said this as he helped me to alight from the carriage; and while he afterward lifted out Adèle, I entered the house and made good my retreat up stairs. He duly summoned me to his presence in the evening. I had prepared an occupation for him; for I was determined not to spend the whole time in a tête-à-tête conversation: I remembered his fine voice; I knew he liked to sing—good singers generally do. I was no vocalist myself, and, in his fastidious judgm ent, no musician either; but I delighted in listening when the perfo rmance was good. No sooner had twilight, that hour of romance, begun to lower her blue and starry banner over the lattice, than I rose, opened the piano, and entreated him, for the love of Heaven, to give me a song. He said I was a caprici ous witch, and that he would rather sing another time; but I averred that no time was like the present. “Did I like his voice?” he asked. “Very much.” I was not fond of pampering that susceptible vanity of his; but for once, and from motives of expediency , I would e‘en soothe and stimulate it. “Then, Jane, you must play the accompaniment.”“Very well, sir; I will try .” I did try, but was presently swept off the stool and denominate d “a little bungler .” Being pushed unceremoniously to one side—which was precisely what I wished—he usurped my place, and proceeded to accompany himself; for he could play as well as sing. I hied me to the window-reces s; and while I sat there and looked out on the still trees and dim lawn, to a sweet air was sung in mellow tones the following strain: The truest love that ever heart Felt at its kindled cor e Did thr ough each vein, in quickened start, The tide of being pour . Her coming was my hope each day , Her parting was my pain; The chance that did her steps delay Was ice in every vein I dreamed it would be nameless bliss, As I loved, loved to be; And to this object did I pr ess As blind as eagerly . But wide as pathless was the space That lay our lives between, And danger ous as the foamy race Of ocean-sur ges gr een. And haunted as a r obber path Through wilderness or wood, For Might and Right, and W oe and W rath, Between our spirits stood. I dangers dar ed; I hinderance scorned; I omens did defy; Whatever menaced, harassed, warned, I passed impetuous by . On sped my rainbow , fast as light; I flew as in a dr eam; Far glorious r ose upon my sight That child of Shower and Gleam. Still bright on clouds of suffering dim Shines that soft solemn joy; Nor car e I now , how dense and grim Disasters gather nigh: I car e not in this moment sweet, Though all I have rushed o‘er Should come, on pinion str ong and fleet, Proclaiming vengeance sor e: Though haughty Hate should strike me down, Right, bar appr oach to me, And grinding Might, with furious fr own, Swear endless enmity . My love has placed her little hand With noble faith in mine, And vowed that wedlock’ s sacr ed hand Our natur es shall entwine. My love has sworn, with sealing kiss, With me to live—to die;I have at last my nameless bliss: As I love—loved am I!64 He rose and came toward me, and I saw his face all kindled, and his full falcon-eye flashing, and tenderness and passion in every lineament. I quailed momentarily—then I rallied. Soft scene, daring demonstration, I would not have; and I stood in peril of both; a weapon of defence must be prepared—I whetted my tongue ; as he reached me, I asked with asperity , “whom he was going to marry now?” “That was a strange question to be put by his darling Jane.” “Indeed! I considered it a very natural and necessary one; he had talked of his future wife dying with him. What did he mean by such a pagan idea? I had no intention of dying with him—he might depend on that.” “Oh, all he longed, all he prayed for, was that I might live with him! Death was not for such as I.” “Indeed it was; I had as good a right to die when my time came as he had; but I should bide that time, and not be hurried away in a suttee.” “Would I forgive him for the selfish idea, and prove my pardon by a reconciling kiss?” “No, I would rather be excused.” Here I heard myself apostroph ized as a “hard little thing”; and it was added, “Any other woman would have been melted to marrow at hearing such stanzas crooned in her praise.” I assured him I was naturally hard—very flinty , and that he would often find me so; and that, moreover , I was determined to show him divers rugged points in my character before the ensuing four weeks elapsed; he should know fully what sort of a bargain he had made, while there was yet time to rescind it. “Would I be quiet, and talk rationally?” “I would be quiet if he liked; and as to talking rationally , I flattered myself I was doing that now .”He frette d, pished and pshawed. “Very good,” I thought; “you may fume and fidget as you please, but this is the best plan to pursue with you, I am certain. I like you more than I can say; but I’ll not sink into a bathos of sentiment; and with this needle of repartee I’ll keep you from the edge of the gulf too; and, moreover , maintain by its pungent aid that distance between you and myself most conducive to our real mutual advantage.” From less to more, I worked him up to considerable irritation; then, after he had retired, in dudgeon, quite to the other end of the room, I got up, and saying, “I wish you good-night , sir,” in my natural and wonted respectful manner , I slipped out by the side-door and got away . The system thus entered on, I pursued during the whole season of probation; and with the best success. He was kept, to be sure, rather cross and crusty; but on the whole I could see he was excellently entertained; and that a lamblike submission and turtle-dove sensibility , while fostering his despotism more , would have pleased his judgment, satisfied his common- sense, and even suited his taste, less. In other people’ s presence I was, as formerly , deferential and quiet; any other line of conduct being uncalled-for; it was only in the evening conferences I thus thwarted and afflicted him. He continued to send for me punctually the moment the clock struck seven; though when I appeared before him now, he had no such honeyed terms as “love” and “darling” on his lips: the best words at my service were “provoking puppet,” “malicious elf,” “sprite,” “changeling,” etc. For caresses, too, I now got grimaces; for a pressure of the hand, a pinch on the arm; for a kiss on the cheek, a severe tweak of the ear. It was all right: at present I decidedly preferred these fierce favors to anything more tender . Mrs. Fairfax, I saw, approv ed me: her anxiety on my account vanished; therefore I was certain I did well. Meantime, Mr. Rochester affirmed I was wearing him to skin and bone, and threatened awfu l vengeance for my present conduct at some period fast coming. I laughed in my sleeve at his menaces. “I can keep you in reasonable check now,” I reflected; “and I don’t doubt to be able to do it hereafter; if one expedient loses its virtue, another must be devised.” Yet, after all, my task was not an easy one; often I would rather have pleased than teased him. My future husband was becoming to me my wholeworld, and more than the world—almost my hope of heaven. He stood between me and every thought of religion, as an eclipse intervenes between man and the broad sun. I could not, in those days, see God for his creature, of whom I had made an idol. OceanofPDF .comChapter XXV The month of courtship had wasted; its very last hours were being numbered. Ther e was no putting off the day that advanced—the bridal day; and all preparations for its arrival were complete. I, at least, had nothing more to do. There were my trunks, packed, locked, corded, ranged in a row along the wall of my little chamber; to-morrow , at this time, they will be far on their road to London; and so should I (D.V .),gi or, rather, not I, but one Jane Rochester , a person whom as yet I knew not. The cards of address alone remained to nail on; they lay, four little squares, on the drawer . Mr. Rochester had himself written the direction, “Mrs. Rochester , Hotel, London,” on each; I could not persuade myself to affix them , or to have them affixed. Mrs. Rochester! she did not exist; she would not be born till to-morrow , some time after eight o‘clock A.M., and I would wait to be assured she had come into the world alive, before I assigned to her all that property . It was enough that, in yonder closet, opposite my dressing-table, garments said to be hers had already displaced my black stuff Lowood frock and straw bonne t; for not to me appertained that suit of wedding raiment— the pearl-colored robe, the vapory veil, pendent from the usurped portmanteau.gj I shut the closet to conceal the strange, wraith-like apparel it contained, which, at this evening hour—nine o’clock—gave out certainly a most ghostly shimmer through the shadow of my apartment. “I will leave you by yourself, white dream, ” I said; “I am feverish; I hear the wind blowing, I will go out of doors and feel it.” It was not only the hurry of preparation that made me feverish; not only the antic ipation of the great change—the new life which was to commence to-morrow; both these circumstances had their share, doubtless, in producing that restless, excited mood which hurried me forth at this late hour into the darkening grounds , but a third cause influenced my mind more than they .I had at heart a strange and anxious thought. Something had happened which I could not comprehend. No one knew of or had seen the event but myself; it had taken place the preceding night. Mr. Rochester , that night, was absent from home, nor was he yet returned. Business had called him to a small estate of two or three farms he possessed, thirty miles off—business it was requisite he should settle in person, previous to his meditated departure from England. I waited now his return, eager to disburden my mind, and to seek of him the solution of the enigma that perplex ed me. Stay till he comes, reader; and, when I disclose my secret to him, you shall share the confidence. I sought the orchard, driven to its shelter by the wind, which all day had blown strong and full from the south, without, however , bringing a speck of rain. Instead of subsiding as night drew on, it seemed to augm ent its rush and deepen its roar. The trees blew steadfastly one way, never writhing round, and scarcely tossing back their boughs once in an hour, so continuous was the strain bending their branchy heads northward. The clouds drifted from pole to pole, fast following, mass on mass. No glimpse of blue sky had been visible that July day . It was not witho ut a certain wild pleasure I ran before the wind, delivering my trouble of mind to the measureless air-torrent thundering through space. Descending the laurel-walk, I faced the wreck of the chestnut-tree. It stood up, black and riven; the trunk, split down the centre, gaped ghastly . The cloven halves were not broken from each other , for the firm base and strong roots kept them unsundered below , though community of vitality was destroyed—the sap could flow no more; their great boughs on each side were dead, and next winter ’s tempests would be sure to fell one or both to earth; as yet, however , they might be said to form one tree—a ruin—but an entire ruin. “You did right to hold fast to each other ,” I said, as if the monste r splinters were living things and could hear me. “I think, scathed as you look, and charred and scorched, there must be a little sense of life in you yet, rising out of that adhes ion at the faithful, honest roots. You will never have green leaves more—ne ver more see birds making nests, and singing idyls in your boughs; the time of pleasure and love is over with you; but you are not desolate; each of you has a comrade to sympathize with him in his decay .”As I looked up at them, the moon appeared momentarily in that part of the sky whic h filled their fissure; her disk was blood-red and half overcast. She seemed to throw on me one bewildered, dreary glance, and buried herself again instantly in the deep drift of cloud. The wind fell, for a second, round Thornfield; but far away , over wood and water , poured a wild, melancholy wail. It was sad to listen to, and I ran of f again. Here and there I strayed through the orchard, gathering up the apples with which the grass round the tree-roots was thickly strewed. Then I employed myself in dividing the ripe from the unripe. I carried them into the house and put them away in the store-room. Then I repaired to the library to ascertain whethe r the fire was lighted; for, though summer , I knew on such a gloomy evening Mr. Rocheste r would like to see a cheerful hearth when he came in; yes, the fire had been kindled some time, and burned well. I placed his arm-chair by the chimney-corner; I wheeled the table near it; I let down the curtain, and had the candles brought in ready for lighting. More restless than ever, when I had completed these arrangements I could not sit still, nor even remain in the house. A little time-piece in the room and the old clock in the hall simultaneously struck ten. “How late it grows!” I said. “I will run down to the gates; it is moonlight at intervals; I can see a good way on the road. He may be coming now, and to meet him will save some minutes of suspense.” The wind roared high in the great trees which embowered the gates; but the road, as far as I could see, to the right hand and the left, was all still and solitary; save for the shadows of clouds crossing it at intervals, as the moon looked out, it was but a long, pale line, unvaried by one moving speck. A puerile tear dimmed my eye while I looked—a tear of disap pointment and impatience; ashamed of it, I wiped it away . I lingered; the moon shut herself wholly within her chamber , and drew close her curtain of dense cloud; the night grew dark; rain came driving fast on the gale. “I wish he would come! I wish he would come!” I exclaimed, seized with hypochondriacgk forebod ing. I had expected his arrival before tea; now it was dark; what could keep him? Had an accident happened? The event of last night again recurred to me. I interpreted it as a warning of disaster; I feared my hopes were too brigh t to be realized; and I had enjoy ed so muchbliss lately that I imagined my fortune had passed its meridian, and must now decline. “Well, I cannot return to the house,” I thought. “I cannot sit by the fireside while he is abroad in inclement weather . Better tire my limbs than strain my heart; I will go forward and meet him.” I set out. I walked fast, but not far. Ere I had measured a quarter of a mile, I heard the tramp of hoofs. A horseman came on, full gallop—a dog ran by his side. Away with evil present iment! It was he. Here he was, mounted on Mesrour , followed by Pilot. He saw me, for the moon had opened a blue field in the sky, and rode in it watery bright. He took his hat off and waved it round his head. I now ran to meet him. “There!” he exclaimed, as he stretched out his hand and bent from the saddle. “You can’t do without me, that is evident. Step on my boot-toe; give me both hands; mount!” I obeyed. Joy made me agile; I sprung up before him. A hearty kissing I got for welcome, and some boastful triumph, which I swallowed as well as I could. He checked himself in his exultation to demand, “But is there anything the matter , Janet, that you come to meet me at such an hour? Is there anything wrong?” “No; but I thought you would never come. I could not bear to wait in the house for you, especially with this rain and wind.” “Rain and wind indeed! Yes, you are dripping like a mermaid . Pull my cloak round you; but I think you are feverish, Jane; both your cheek and hand are burning hot. I ask again, is there anything the matter?” “Nothing, now; I am neither afraid nor unhappy .” “Then you have been both?” “Rather—but I’ll tell you all about it by and by, sir; and I dare say you will only laugh at me for my pains.” “I’ll laugh at you heartily when to-morrow is past; till then I dare not; my prize is not certain. This is you, who have been as slippery as an eel this last month, and as thorny as a brier-rose? I could not lay a finger anywhere but Iwas pricked; and now I seem to have gathered up a stray lamb in my arms; you wandered out of the fold to seek your shepherd; did you, Jane?” “I wanted you; but don’t boast. Here we are at Thornfield; now let me get down.” He landed me on the pavement. As John took his horse and he followed me into the hall, he told me to make haste and put something dry on, and then to return to him in the library; and he stopped me, as I made for the stair-case, to extort a promise that I would not be long; nor was I long; in five minutes I rejoined him. I found him at supper . “Take a seat, and bear me comp any, Jane; please God, it is the last meal but one you will eat at Thornfield Hall for a long time.” I sat down near him, but told him I could not eat. “Is it because you have the prospect of a journey before you, Jane? Is it the thoughts of going to London that takes away your appetite?” “I cannot see my prospects clearly to-night, sir; and I hardly know what thoughts I have in my head. Everything in life seems unreal.” “Except me; I am substantial enough—touch me.” “You, sir , are the most phantom-like of all; you are a mere dream.” He held out his hand, laughing. “Is that a dream?” said he, placi ng it close to my eyes. He had a rounded, muscular , and vigorous hand, as well as a long, strong arm. “Yes; though I touch it, it is a dream,” said I, as I put it down from before my face. “Sir , have you finished supper?” “Yes, Jane.” I rung the bell, and ordered away the tray. When we were again alone, I stirred the fire, and then took a low seat at my master ’s knee. “It is near midnight,” I said. “Yes; but remem ber, Jane, you promised to wake with me the night before my wedding.” “I did; and I will keep my promise, for an hour or two at least; I have no wish to go to bed.”“Are all your arrangements complete?” “All, sir .” “And on my part, likewise,” he returned. “I have settled everything; and we shall leave Thornfield to-morrow , within half an hour after our return from church.” “Very well, sir .” “With what an extraordinary smile you uttered that word, ‘very well,’ Jane! What a bright spot of color you have on each cheek! and how strangely your eyes glitter! Are you well?” “I believe I am.” “Believe! What is the matter? Tell me what you feel.” “I could not, sir: no words could tell you what I feel. I wish this present hour would never end; who knows with what fate the next may come charged?” “This is hypoc hondria, Jane. You have been over-excited or over- fatigued.” “Do you, sir , feel calm and happy?” “Calm? no; but happy—to the heart’ s core.”65 I looked up at him to read the signs of bliss in his face; it was ardent and flushed. “Give me your confidence, Jane,” he said; “relieve your mind of any weight that oppresses it, by imparting it to me. What do you fear?—that I shall not prove a good husband?” “It is the idea farthest from my thoughts.” “Are you apprehensive of the new sphere you are about to enter? of the life into which you are passing?” “No.” “You puzzle me, Jane; your look and tone of sorrowful audacity perplex and pain me. I want an explanation.” “Then, sir , listen. You were from home last night?”“I was; I know that; and you hinted a while ago at something which had happened in my absence—nothi ng, probably , of consequence; but, in short, it has disturbed you. Let me hear it. Mrs. Fairfax has said something, perhaps? or you have overhea rd the servants talk? Your sensitive self- respect has been wounded?” “No, sir.” It struck twelve—I waited till the time-piece had concluded its silver chime, and the clock its hoarse, vibrating stroke, and then I proceeded. “All day, yester day, I was very busy, and very happy in my ceaseless bustle; for I am not, as you seem to think, troubled by any haunting fears about the new sphere, et cetera; I think it a glorious thing to have the hope of living with you, because I love you. No, sir, don’t caress me now—let me talk undistu rbed. Yesterday I trusted well in Providence, and believed that events were working togeth er for your good and mine;66 it was a fine day, if you recollect—the calmness of the air and sky forbade apprehensions respecting your safety or comfort on your journey . I walked a little while on the pavement after tea, thinking of you; and I beheld you in imagination so near me, I scarcely missed your actual presence. I thought of the life that lay before me— your life, sir—an existence more expansive and stirring than my own; as much more so as the depths of the sea to which the brook runs are than the shallow s of its own strait channel. I wondered why moralists call this world a dreary wilderness; for me it blossomed like a rose.67 Just at sunset, the air turned cold and the sky cloudy; I went in. Sophie called me up stairs to look at my wedding-dress, which they had just brought; and under it in the box I found your present—the veil which, in your princely extravagance, you sent for from London; resolved , I",
      "density_breakdown": {
        "Metaphor": 4.287245444801715,
        "Simile": 4.287245444801715,
        "Imagery": 14.11218292247231,
        "Symbolism": 5.180421579135405,
        "Dialogue": 0.0,
        "Foreshadowing": 12.861736334405144,
        "Juxtaposition": 14.648088603072527,
        "Repetition": 3.215434083601286,
        "TOTAL_DENSITY": 58.592354412290106
      }
    },
    "falling_action": {
      "chapter_range": "28-35",
      "narrative_primary": 32,
      "optimized_primary": 34,
      "device_density_score": 56.62736691675598,
      "improvement_percent": 23.828125000000007,
      "optimization_applied": true,
      "chapter_text": "fingers! He was deeply displeased by what had occurre d that day; cordiality would not warm, nor tears move him. No happy reconciliation was to be had with him—nocheering smile or generous word; but still the Christian was patient and placid; and when I asked him if he forgave me, he answered that he was not in the habit of cherishing the remembrance of vexation; that he had nothing to for give, not having been of fended. And with that answer , he left me. I would much rather he had knocked me down. OceanofPDF .comChapter XXXV He did not leave for Cambridge the next day, as he had said he would. He deferred his departure a whole week; and during that time he made me feel what severe punishment a good , yet stern—a conscientious, yet implacable man can inflict on one who has offended him. Without one overt act of hostility , one upbraiding word, he contrived to impress me momently with the conviction that I was put beyond the pale of his favor . Not that St. John harbored a spirit of unchristian vindictiveness—not that he woul d have injured a hair of my head, if it had been fully in his power to do so. Both by nature and principle he was superior to the mean gratification of vengeance; he had forgiven me for saying I scorned him and his love, but he had not forgotten the words; and as long as he and I lived, he never would forget them. I saw by his look, when he turned to me, that they were always written on the air between me and him; whenever I spoke, they sounded in my voice to his ear; and their echo toned every answer he gave me. He did not absta in from conversing with me; he even called me as usual each morning to join him at his desk; and I fear the corrupt man within him had a pleasure unimparted to, and unshared by, the pure Christian, in evincing with what skill he could, while acting and speaking apparently just as usual , extract from every deed and every phrase the spirit of interest and approval which had formerly communicated a certain austere charm to his language and manner . To me, he was in reality become no longer flesh, but marble. His eye was a cold, bright, blue gem; his tongue, a speaking instrument—nothing more. All this was torture to me—refined, lingering torture. It kept up a slow fire of indignati on and a trembling trouble of grief, which harassed and crushed me altogether . I felt how, if I were his wife, this good man, pure as the deep sunless source, could soon kill me, without drawing from my veinsa single drop of blood or receiving on his own crystal conscience the faintest stain of crime. Especia lly I felt this when I made any attempt to propitiate him. No ruth met my ruth. He experie nced no suffering from estrangement—no yearning after reconciliation; and though, more than once, my fast-fa lling tears blistered the page over which we both bent, they produced no more effect on him than if his heart had been really a matter of stone or metal. To his sisters, meantime, he was somewhat kinder than usual: as if afraid that mere coldness would not sufficiently convince me how completely I was banished and banned, he added the force of contrast; and this I am sure he did not by malice, but on principle. The night before he left home, happening to see him walking in the garden about sunset and remembering, as I looked at him, that this man, alienated as he now was, had once saved my life, and that we were near relations, I was moved to make a last attempt to regain his friendship. I went out and approached him as he stood leaning over the little gate; I spoke to the point at once. “St. John, I am unhappy , becau se you are still angry with me. Let us be friends.” “I hope we are friends,” was the unmoved reply , while he still watched the rising of the moon, which he had been contemplating as I approached. “No, St. John, we are not friends as we were. You know that.” “Are we not? That is wrong. For my part, I wish you no ill and all good.” “I believe you, St. John; for I am sure you are incapable of wishing any one ill; but, as I am your kinswoman, I should desire somewhat more of affection than that sort of general philanthropy you exten d to mere strangers.” “Of course,” he said. “Your wish is reasonable; and I am far from regarding you as a stranger .” This, spoken in a cool, tranquil tone, was mortifying and baffling enough. Had I attended to the suggestions of pride and ire, I should immediately have left him; but something worked within me more strongly than those feelings could. I deeply venerated my cousin’ s talent and principle. Hisfriendship was of value to me; to lose it tried me severely . I would not so soon relinquish the attempt to reconquer it. “Must we part in this way, St. John? And when you go to India, will you leave me so, without a kinder word than you have yet spoken?” He now turned quite from the moon, and faced me. “When I go to India, Jane, will I leave you? What! do you not go to India?” “You said I could not, unless I married you.” “And you will not marry me? You adhere to that resolution?” Reader , do you know , as I do, what terror those cold people can put into the ice of their questions? How much of the fall of the avalanche is in their anger? of the breaking up of the frozen sea in their displeasure? “No, St. John, I will not marry you. I adhere to my resolution.” The avalanche had shaken and slid a little forward, but it did not yet crash down. “Once more, why this refusal?” he asked. “Formerly ,” I answered, “because you did not love me now, I reply , because you almost hate me. If I were to marry you, you would kill me. You are killing me now .” His lips and cheeks turned white—quite white. “I shoul d kill—I am killing you? Your words are such as ought not to be used; violent, unfeminine, and untrue. They betray an unfortun ate state of mind; they merit severe reproof. They would seem inexcusable, but that it is the duty of man to forgive his fellow , even until sevent y-and-seven times.”102 I had finished the business now. While earnestly wishing to erase from his mind the trace of my former offence, I had stamped on that tenacious surface another and far deeper impression; I had burned it in. “Now you will indeed hate me,” I said. “It is useless to attempt to conciliate you; I see I have made an eternal enemy of you.”A fresh wrong did these words inflict; the worse, because they touched on the truth . That bloodless lip quivered to a temporary spasm. I knew the steely ire I had whetted. I was heart-wrung. “You utterly misinterpret my words,” I said, at once seizing his hand; “I have no intention to grieve or pain you—indeed I have not.” Most bitterly he smiled—most decidedly he withdrew his hand from mine. “And now you recall your promise, and will not go to India at all, I presume?” said he, after a considerable pause. “Yes I will, as your assistant,” I answered. A very long silence succeeded. What struggle there was in him between Nature and Grace in this interval, I cannot tell; only singular gleams scintillated in his eyes, and strange shadows passed over his face. He spoke at last. “I before proved to you the absurdity of a single woman of your age proposing to accompany abroad a single man of mine. I proved it to you in such terms as I should have thought would have prevented your ever again alluding to the plan. That you have done so, I regret—for your sake.” I interru pted him. Anything like a tangible reproach gave me courage at once. “Keep to common sense, St. John; you are verging on nonsense. You pretend to be shocked by what I have said. You are not really shocked; for, with your superi or mind, you cannot be either so dull or so conceited as to misunderstand my meaning. I say again, I will be your curate, if you like, but never your wife.” Again he turned lividlyia pale; but, as before, controlled his passion perfectly . He answered emphatically but calmly— “A female curate who is not my wife would never suit me. With me, then, it seems you cannot go; but if you are sincere in your offer I will, while in town, speak to a married missi onary whose wife needs a coadjutor . Your own fortune will make you independent of the Society’ s aid; and thus you may still be spared the dishonor of breaking your promise and deserting the band you engaged to join.”Now I never had, as the reader knows, either given any formal promise or entered into any engagement; and this language was all much too hard, and much too despotic, for the occasion. I replied— “There is no dishonor , no breach of promise, no desertion, in the case. I am not under the slightest obligation to go to India, especially with strangers. With you I would have ventured much, because I admire, confide in, and, as a sister , I love you; but I am convinced that, go when and with whom I would, I should not live long in that climate.” “Ah! you are afraid of yourself,” he said, curling his lip. “I am. God did not give me my life to throw away; and to do as you wish me, would, I begin to think, be almost equivalent to committing suicide. Moreover , befor e I definitely resolve on quitting England, I will know for certain whether I cannot be of greater use by remaining in it than by leaving it.” “What do you mean?” “It would be fruitless to attempt to explain; but there is a point on which I have long endured painful doub t; and I can go nowhere till by some means that doubt is removed.” “I know where your heart turns, and to what it clings. The interest you cherish is lawless and unconsecrated. Long since you ought to have crushed it; now you should blush to allude to it. You think of Mr . Rochester?” It was true. I confessed it by silence. “Are you going to seek Mr . Rochester?” “I must find out what has become of him.” “It remains for me, then,” he said, “to remember you in my prayers, and to entreat God for you, in all earnestness, that you may not indee d become a castaway .103 I had thought I recognized in you one of the chosen. But God sees not as man sees; His will be done.”104 He opened the gate, passed through it, and strayed away down the glen. He was soon out of sight.On reentering the parlor , I found Diana standing at the window , looking very thoughtful. Diana was a great deal taller than I; she put her hand on my shoulder , and, stooping, examined my face. “Jane,” she said, ”you are always agitated and pale now. I am sure there is something the matter . Tell me what business St. John and you have on hand. I have watched you this half hour from the window; you must forgive my being such a spy, but for a long time I have fancied I hardly know what. St. John is a strange being—” She paused—I did not speak; soon she resumed— “That brother of mine cherishe s peculiar views of some sort respecting you, I am sure; he has long distinguished you, by a notice and interest he never showed any one else—to what end? I wish he loved you—does he, Jane?” I put her cool hand to my hot forehead; “No, Di, not one whit.” “Then why does he follow you so with his eyes—and get you so frequently alone with him, and keep you so continually at his side? Mary and I had both concluded he wished you to marry him.” “He does—he has asked me to be his wife.” Diana clapped her hands. “That is just what we hoped and thought! And you will marry him, Jane, won’ t you? And then he will stay in England.” “Far from that, Diana; his sole idea in proposing to me is to procure a fitting fellow-laborer in his Indian toils.” “What! he wishes you to go to India?” “Yes.” “Madness!” she exclaimed. “You would not live three months there, I am certain. You never shall go; you have not consented—have you, Jane?” “I have refused to marry him—” “And have, consequently , displeased him?” she suggested. “Deeply; he will never forgive me, I fear; yet I offered to accompany him as his sister .”“It was frantic folly to do so, Jane. Think of the task you undertook—one of incessant fatigue—where fatigue kills even the strong; and you are weak. St. John—you know him—would urge you to impossibilities; with him there would be no permissi on to rest during the hot hours; and, unfortunately , I have noticed, whatever he exacts, you force yourself to perform. I am astonished you found courage to refuse his hand. You do not love him, then, Jane?” “Not as a husband.” “And yet he is a handsome fellow .” “And I am so plain, you see, Di. We should never suit.” “Plain! You? Not at all. You are much too pretty , as well as too good, to be grille d alive in Calcutta.” And again she earnestly conjured me to give up all thoughts of going out with her brother . “I must indeed,” I said; “for when, just now, I repeated the offer of serving him for a deacon, he expressed himself shocked at my want of decency . He seemed to think I had committed an impropriety in proposing to accompany him unmarried, as if I had not from the first hoped to find in him a brother , and habitually regarded him as such.” “What makes you say he does not love you, Jane?” “You should hear himself on the subject. He has again and again explained that it is not himself, but his office, he wishes to mate. He has told me I am formed for labor—not for love—which is true, no doubt. But in my opinion, if I am not formed for love, it follows that I am not formed for marriage. Would it not be strange, Di, to be chained for life to a man who regarded one but as a useful tool?” “Insupportable—unnatural—out of the question!” “And then,” I continued, “thou gh I have only sisterly affectio n for him now, yet, if forced to be his wife, I can imagine the possibility of conceiving an inevitable, strange, torturing kind of love for him, because he is so talented; and there is often a certain heroic grandeur in his look, manner , and conv ersation. In that case, my lot would become unspeakably wretched. He would not want me to love him; and if I showed the feeling, he wouldmake me sensible that it was a superfluity , unrequired by him, unbecoming in me. I know he would.” “And yet St. John is a good man,” said Diana. “He is a good and a great man; but he forgets, pitilessly , the feelings and claims of little people, in pursuing his own large views. It is better , therefore, for the insignificant to keep out of his way, lest, in his progress, he should trample them down. Here he comes! I will leave you, Diana.” And I hastened up stairs as I saw him entering the garden. But I was forced to meet him again at supper . During that meal he appeared just as composed as usual. I had thought he would hardly speak to me, and I was certain he had given up the pursuit of his matrimonial scheme; the sequel showed I was mistaken on both points. He addressed me precisely in his ordinary mann er, or what had, of late, been his ordinary manner—one scrupulously polite. No doubt he had invoked the help of the Holy Spirit to subdue the anger I had roused in him, and now believed he had for given me once more. For the evenin g reading before prayers, he selected the twenty-first chapter of Revelation. It was at all times pleasant to listen, while from his lips fell the words of the Bible; never did his fine voice sound at once so sweet and full—never did his manner become so impressive in its noble simplicity , as when he delivered the oracles of God; and to-night that voice took a more solemn tone, that manner a more thrilling meaning, as he sat in the mids t of his household circle (the May moon shining in through the uncurtained window , and rendering almost unnecessary the light of the candle on the table); as he sat there, bending over the great old Bible, and described from its page the vision of the new heaven and the new earth— told how God would come to dwell with men—how he would wipe away all tears from their eyes, and promised that there should be no more death, neither sorrow nor crying, nor any more pain, because the former things were passed away . The succeeding words thrilled me strangely as he spoke them, especially as I felt, by the slight, indescribable alteration in sound, that in uttering them his eye had turned on me.“He that overcometh shall inher it all things; and I will be his God, and he shall be my son. But,” was slowly , distinctly read, “the fearful, the unbelieving, &c., shall have their part in the lake which burneth with fire and brimstone, which is the second death.”105 Henceforward I knew what fate St. John feared for me. A calm, subdued triumph, blent with a longing earnestness, marked his enunciation of the last glorious verses of that chapter . The reader believed his name was already written in the Lamb’ s book oflife,106 and he yearned after the hour which should admit him to the city to which the kings of the earth bring their glory and honor—which has no need of sun or moon to shine in it, because the glory of God lightens it, and the Lamb is the light thereof. In the prayer following the chapter , all his energy gathered, all his stern zeal woke: he was in deep earnest, wrestling with God, and resolved on a conquest. He supplicated strength for the weak-hearted-gu idance for wanderers from the fold—a return, even at the eleventh hour, for those whom the temptations of the world and the flesh were luring from the narrow path. He asked, he urged, he claimed, the boon of a brand snatched from the burning.107 Earnestness is ever deeply solemn: first, as I listened to that prayer , I wondered at his; then, when it continued and rose, I was touched by it, and at last awed. He felt the greatness and goodness of his purpose so sincerely , others who heard him plead for it could not but feel it too. The prayer over, we took leave of him; he was to go at a very early hour in the morning. Diana and Mary , having kissed him, left the room, in compliance, I think, with a whispered hint from him; I tendered my hand, and wished him a pleasant journey . “Thank you, Jane. As I said, I shall return from Cambridge in a fortnight; that space, then, is yet left you for reflection. If I listened to human pride, I should say no more to you of marriage with me; but I listen to my duty, and keep steadily in view my first aim—to do all things to the glory of God. My master was long suffering; so will I be. I cannot give you up to perdition as a vessel of wrath; repent—resolve, while there is yet time. Remember , weare bid to work while it is day—warned that ‘the night cometh when no man shall work. ’108 Rem ember the fate of Dives, who had his good things in this life.109 God give you strength to choose that better part which shall not be taken from you!”110 He laid his hand on my head as he uttered the last words. He had spoken earnestly , mildly ; his look was not, indeed, that of a lover beholding his mistress, but it was that of a pastor recalling his wandering sheep—or better , of a guardian angel watching the soul for which he is responsible. All men of talent, whether they be men of feeling or not, whet her they be zealots, or aspirants, or despots— provided only they be sincere—have their sublime moments, when they subdue and rule. I felt veneration for St. John —veneration so strong that its impetus thrust me at once to the point I had so long shunned. I was tempted to cease struggling with him—to rush down the torrent of his will into the gulf of his existence, and there lose my own. I was almost as hard beset by him now as I had been once before, in a different way, by another . I was a fool both times. To have yielded then would have been an error of principle; to have yielded now would have been an error of judgment. So I think at this hour, when I look back to the crisis through the quiet medium of time, I was unconscious of folly at the instant. I stood motionless under my hierophant’ s touch. My refusals were forgotten—my fears overcome— my wrestlings paralyzed. The impossible —i.e., my marriage with St. John—was fast becoming the possible. All was changing utterly , with a sudden sweep. Religion called—angels beckoned— God command ed—life rolled together like a scroll111-death’ s gates opening, showed eternity beyond; it seemed that, for safety and bliss there, all here might be sacrificed in a second. The dim room was full of visions. “Could you decide now?” asked the missionary . The inquiry was put in gentle tones; he drew me to him as gently . Oh, that gentleness! how far more potent is it than force! I could resist St. John’ s wrath; I grew pliant as a reed under his kindness. Yet I knew all the time, if I yielded now, I should not the less be made to repent, some day, of my former rebellion . His nature was not changed by one hour of solemn prayer; it was only elevated.“I could decide if I were but certain,” I answered; “were I but convinced that it is God’ s will I should marry you, I could vow to marry you here and now—come afterward what would!” “My prayers are heard!” ejaculated St. John. He pressed his hand firmer on my head, as if he claimed me; he surrounded me with his arm, almost as if he loved me (I say almost —I knew the difference—for I had felt what it was to be loved; but like him, I had now put love out of the question, and thought only of duty); I contended with my inward dimnes s of vision, before which clouds yet rolled. I sincerely , deeply , fervently longed to do what was right, and only that. “Show me—show me the path!” I entreated of Heaven. I was excited more than I had ever been; and whether what followed was the ef fect of excitement, the reader shall judge. All the house was still, for I believe all except St. John and myself were now retired to rest. The one candle was dying out; the room was full of moonlight. My heart beat fast and thick; I heard it throb. Suddenly it stood still to an inexpr essible feeling that thrilled it through, and passed at once to my head and extremities. The feeling was not like an electric shock, but it was quite as sharp, as strange, as startling; it acted on my sense s as if their utmost activity hitherto had been but torpor , from which they were now summoned and forced to wake. They rose expectant; eye and ear waited, while the flesh quivered on my bones. “What have you heard! What do you see?” asked St. John. I saw nothing, but I heard a voice somewhere cry , “Jane! Jane! Jane!” nothing more. “Oh, God! what is it?” I gasped. I might have said, “Where is it?” for it did not seem in the room —nor in the hous e—nor in the garden; it did not come out of the air—nor from under the earth—nor from overhead. I had heard it—where or whence, forever impossible to know! And it was the voice of a human being—a known, loved, well-remembered voice—that of Edward Fairfax Rochester; and it spoke in pain and woe—wildly , eerily , urgently . “I am coming!” I cried. “Wait for me! Oh, I will come!” I flew to the door, and looked into the passage; it was dark. I ran out into the garden; itwas void. “Where are you?” I exclaimed. The hills beyond Marsh-Glen sent the answer faintly back, “Where are you!” I listened. The wind sighed low in the firs; all was moorland loneliness and midnight hush. “Down superstition!” I commented, as that spectre rose up black by the black yew at the gate. “This is not thy deception, nor thy witchc raft; it is the work of nature. She was roused, and did—no miracle—but her best.” I broke from St. John, who had followed, and would have detai ned me. It was my turn to assume ascendency . My powers were in play, and in force. I told him to forbear question or remark; I desired him to leave me; I must, and would be alone. He obeyed at once. Where there is energy to command well enough, obedience never fails. I mounted to my chamber , locked myself in, fell on my knees, and prayed in my way—a different way to St. John‘s—but effective in its own fashion. I seemed to penetrate very near a Mighty Spirit, and my soul rushed out in gratitude at His feet. I rose from the thanksgiving —took a resolve—and lay down, unscared, enlightened— eager but for the daylight. OceanofPDF .comChapter XXXVI The daylight came. I rose at dawn. I busied myself for an hour or two with arranging my things in my chamber , drawers, and wardrobe, in the order wherein I should wish to leave them during a brief absence. Meantime, I heard St. John quit his room. He stopped at my door; I feare d he would knock—no, but a slip of paper was passed under the door. I took it up. It bore these words: “You left me too suddenly last night. Had you stayed but a little longer , you would have laid your hand on the Christian’ s cross and the angel’ s crown. I shall expect your clear decision when I return this day fortnight. Meantime, watc h and pray that you enter not into temptation; the spirit, I trust, is willing, but the flesh, I see, is weak.112 I shall pray for you hourly . Yours, St. John.” “My spirit,” I answered mentally , “is willing to do what is right; and my flesh, I hope, is strong enough to accomplish the will of Heaven, when once that will is distinctly known to me. At any rate, it shall be strong enough to search—inquire—to grope an outlet from this cloud of doubt, and find the open day of certainty .” It was the first of June, yet the morning was overcast and chilly; rain beat fast on my casement. I heard the front door open and St. John pass out. Looking through the window , I saw him traverse the garden. He took the way over the misty moors in the direction of Whitcross; there he would meet the coach. “In a few more hours I shall succeed you in that track, cousin,” thought I; “I too have a coach to meet at Whitcross. I too have some to see and ask after in England, before I depart forever .” It wanted yet two hours of breakfast-time. I filled the interval in walking softly about my room and pondering the visitation which had given myplans their present bent. I recalled that inward sensation I had experienced: for I could recall it, with all its unspeakable strangeness. I recalled the voice I had heard; again I questioned whence it came, as vainly as before; it seemed in me—not in the external world. I asked, was it a mere nervous impression—a delusion? I could not conceive or believe it; it was more like an inspiration. The wondrous shock of feeling had come like the earthquake which shook the foundations of Paul and Silas’ prison;113 it had opened the doors of the soul’s cell, and loosed its bands—it had wakened it out of its sleep, whence it sprung trembli ng, listening, aghast; then vibrated thrice a cry on my startled ear, and in my quaking heart, and through my spirit; which neither feared nor shook, but exulted as if in joy over the success of one effort it had been privileged to make, independent of the cumbrous body . “Ere many days,” I said, as I terminated my musings, “I will know something of him whose voice seemed last night to summon me. Letters have proved of no avail—personal inquiry shall replace them.” At breakfast, I announced to Diana and Mary that I was going on a journey , and should be absent at least four days. “Alone, Jane?” they asked. “Yes; it was to see, or hear news of, a friend about whom I had for some time been uneasy .” They might have said, as I have no doubt they thought, that they had believed me to be without any friends save them; for, indeed, I had often said so; but with their true natural delicacy , they abstained from comment; except that Diana asked me if I was sure I was well enough to travel. I looked very pale, she observed. I replied that nothing ailed me save anxiety of mind, which I hoped soon to alleviate. It was easy to make my further arrangements; for I was trouble d with no inquiries—no surmises. Having once explained to them that I could not now be explicit about my plans, they kindly and wisely acquiesced in the silence with which I pursued them; according to me the privi lege of free action, I should, under similar circumstances, have accorded them.I left Moor House at three o‘clo ck P.M., and soon after four I stood at the foot of the sign-post at Whitcross, waiting the arrival of the coach which was to take me to distant Thornfield. Amid the silence of those solitary roads and desert hills, I heard it approach from a great distance. It was the same vehicle whence, a year ago, I had alighted one summer evening on this very spot—how desolate, and hopeless, and objectless! It stopped as I beckoned. I entered—not now obliged to part with my whole fortune as the price of its accommodation. Once more on the road to Thornfield, I felt like the messenger -pigeon flying home. It was a journey of six-and-thirty hours. I had set out from Whitcross on a Tuesday afterno on, and early on the succeeding Thursday morning the coach stopped to water the horses at a wayside inn, situated in the midst of scenery whose green hedges and large fields and low, pastora l hills (how mild of feature and verdant of hue compared with the stern north-midland moors of Morton!) met my eye like the lineaments of a once familiar face. Yes, I knew the character of this landscape; I was sure we were near my bourn. “How far is Thornfield Hall from here?” I asked of the hostler . “Just two miles, ma‘am, across the fields.” “My journey is closed,” I thought to myself. I got out of the coach, gave a box I had into the hostler ’s charge, to be kept till I called for it; paid my fare; satisfiedib the coachman, and was going; the brightening day gleamed on the sign of the inn, and I read in gilt letters, “The Rochester Arms.” My heart leaped up; I was already on my master ’s very lands. It fell again; the thought struck it: “Your master himself may be beyond the British Channel, for aught you know; and then, if he is at Thor nfield Hall, toward which you hasten, who beside him is there? His lunatic wife; and you have nothing to do with him; you dare not speak to",
      "density_breakdown": {
        "Metaphor": 3.7513397642015005,
        "Simile": 2.8581636298678097,
        "Imagery": 10.718113612004288,
        "Symbolism": 5.894962486602358,
        "Dialogue": 0.0,
        "Foreshadowing": 14.29081814933905,
        "Juxtaposition": 13.040371561271883,
        "Repetition": 6.073597713469097,
        "TOTAL_DENSITY": 56.62736691675598
      }
    },
    "resolution": {
      "chapter_range": "36-38",
      "narrative_primary": 38,
      "optimized_primary": 36,
      "device_density_score": 53.23329760628796,
      "improvement_percent": 14.63585896061781,
      "optimization_applied": true,
      "chapter_text": "and long-uncut locks; “for I see you are being metamorphosed into a lion, or somethin g of that sort. You have a ‘faux air’ij of Nebu chadnezzar in the fields about you, that is certain; your hair reminds me of eagles’ feathers; whether your nails are grown like birds’ claws or not, I have not yet noticed.”116 “On this arm, I have neither hand nor nails,” he said, drawing the mutilated limb from his breast, and showing it to me. “It is a mere stump— a ghastly sight! Don’ t you think so, Jane?” “It is a pity to see it; and a pity to see your eyes—and the scar of fire on your forehead; and the worst of it is, one is in danger of loving you too well for all this, and making too much of you.” “I thought you would be revolt ed, Jane, when you saw my arm and my cicatrized visage.” “Did you? Don’ t tell me so—le st I should say something disparaging to your judgment. Now , let me leave you an instant, to make a better fire and have the hearth swept up. Can you tell when there is a good fire?” “Yes; with the right eye I see a glow , a ruddy haze.” “And you see the candles?” “Very dimly; each is a luminous cloud.” “Can you see me?” “No, my fairy; but I am only too thankful to hear and feel you.”“When do you take supper?” “I never take supper .” “But you shall have some to-ni ght. I am hungry; so are you, I dare say, only you for get.” Summoning Mary, I soon had the room in more cheerful order; I prepared him likewise a comfortable repast. My spirits were excited, and with pleasure and ease I talked to him during supper , and for a long time after. There was no harassing restraint, no repressing of glee and vivacity , with him; for with him I was at perfect ease, because I knew I suited him; all I said or did seemed either to console or revive him. Delightful consciousness! It brought to life and light my whole nature; in his presence I thoroughly lived, and he lived in mine. Blind as he was, smiles played over his face, joy dawned on his forehead; his lineaments softened and warmed. After supper, he began to ask me many questions, of where I had been, what I had been doing, how I had found him out; but I gave him only very partial replies; it was too late to enter into particulars that night. Besides, I wished to touch no deep-thrilling chord, to open no fresh well of emotion in his heart; my sole present aim was to cheer him. Cheered, as I have said, he was, and yet but by fits. If a moment’ s silence broke the conversation, he would turn restless, touch me, then say , “Jane.” “You are altogether a human being, Jane? You are certain of that?” “I conscientiously believe so, Mr . Rochester .” “Yet how, on this dark and doleful evening, could you so sudden ly rise on my lone hearth? I stretched my hand to take a glass of water from a hireling, and it was given me by you; I asked a question, expecting John’ s wife to answer me, and your voice spoke at my ear .” “Because I had come in, in Mary’ s stead, with the tray .” “And there is enchantment in the very hour I am now spending with you. Who can tell what a dark, dreary , hopeless life I have dragged on for months past? Doing nothing, expecting nothing; merging night in day; feeling but the sensation of cold when I let the fire go out, of hunger when I forgot to eat; and then a ceasele ss sorrow , and, at times, a very delirium ofdesire to behold my Jane again. Yes, for her restoration I longed far more than for that of my lost sight. How can it be, that Jane is with me and says she loves me? Will she not depart as suddenly as she came? To-morrow , I fear, I shall find her no more.” A comm on-place, practical reply, out of the train of his own disturbed ideas, was, I was sure, the best and most reassuring for him in this frame of mind. I passed my finger over his eyebrows, and remarked that they were scorched, and that I would apply something which should make them grow as broad and black as ever . “Where is the use of doing me good in any way, beneficent spirit, when, at some fatal moment, you will again desert me, passing like a shadow , whither and how, to me unknown; and for me, remaining afterward undiscoverable?” “Have you a pocket-comb about you, sir?” “What for , Jane?” ‘Just to comb out this shaggy black mane. I find you rather alarming, when I examine you close at hand. You talk of my being a fairy; but I am sure you are more like a brownie.“ik “Am I hideous, Jane?” “Very, sir; you always were, you know .” “Humph! The wickedness has not been taken out of you, wherever you have sojourned.” “Yet I have been with good people; far better than you, a hundred times better; people possessed of ideas and views you never entertai ned in your life; quite more refined and exalted.” “Who the deuce have you been with?” “If you twist in that way, you will make me pull the hair out of your head; and then I think you will cease to entertain doubts of my substantiality .” “Who have you been with, Jane?” “You shall not get it out of me to-night, sir; you must wait till to-morrow; to leave my tale half told,117 will, you know , be a sort of security that Ishall appear at your breakfast-ta ble to finish it. By-the-by , I must mind not to rise on your hearth with only a glass of water , then; I must bring an egg at the least, to say nothing of fried ham.” “You mocking changeling, fairy -born and human-bred! You make me feel as I have not felt these twelve months. If Saul could have had you for his David, the evil spirit would have been exorcised without the aid of the harp.”118 “There, sir, you are redd upil and made decent. Now I’ll leave you; I have been travelling these last three days, and I believe I am tired. Good-night.” “Just one word, Jane; were there only ladies in the house where you have been?” I laughed and made my escape, still laughing as I ran up stairs. “A good idea!” I thought, with glee. “I see I have the means of fretting him out of his melancholy for some time to come.” Very early the next morning, I heard him up and astir, wande ring from one room to another. As soon as Mary came down, I heard the question, “Is Miss Eyre here?” Then, “Which room did you put her into? Was it dry? Is she up? Go and ask if she wants anything, and when she will come down.” I came down as soon as I thought there was a prospect of breakfast. Entering the room very softly , I had a view of him before he discovered my presence. It was mournful, indeed, to witness the subjugation of that vigorous spirit to a corporeal infirmity . He sat in his chair , still, but not at rest; expectant evidently , the lines of now habitual sadness marking his strong features. His countenance reminded one of a lamp quenched, waiting to be relighted, and, alas! it was not himself that could now kindle the lustre of animated expression; he was dependent on another for that office! I had meant to be gay and careless, but the powerlessness of the strong man touched my heart to the quick; still I accosted him with what vivacity I could. “It is a bright, sunny morning, sir,” I said. “The rain is over and gone,119 and there is a tender shining after it; you shall have a walk soon.” I had wakened the glow; his features beamed.“Oh, you are indeed there, my sky-lark! Come to me. You are not gone; not vanished? I heard one of your kind an hour ago, singing high over the wood; but its song had no music for me, any more than the rising sun had rays. All the melody on earth is concentrated in my Jane’ s tongue to my ear (I am glad it is not naturally a silent one); all the sunshine I can feel is in her presence.” The water stood in my eyes to hear this avowal of his dependence; just as if a royal eagle, chained to a perch, should be forced to entreat a sparrow to become its purveyor . But I would not be lachrymose; I dashed off the salt drops, and busied myself with preparing breakfast. Most of the morning was spent in the open air. I led him out of the wet and wild wood, into some cheerful fields; I described to him how brilliantly green they were; how the flowers and hedges looked refreshed; how sparklingly blue was the sky. I sought a seat for him in a hidden and lovely spot—a dry stump of a tree; nor did I refuse to let him, when seated, place me on his knee; why should I, when both he and I were happi er near than apart? Pilot lay beside us; all was quiet. He broke out suddenly while clasping me in his arms— “Cruel, cruel deserter! Oh, Jane, what did I feel when I disco vered you had fled from Thornfield, and when I could nowhere find you; and, after examining your apartment, ascertained that you had taken no money , nor anything which could serve as an equivalent? A pearl necklace I had given you lay untouched in its little casket; your trunks were left corded and locked as they had been prepared for the bridal tour. What could my darling do, I asked, left destitute and penniless? And what did she do? Let me hear now.” Thus urged, I began the narrat ive of my experience for the last year. I softened considerably what related to the three days of wandering and starvation, because to have told him all would have been to inflict unnecessary pain; the little I did say lacerated his faithful heart deeper than I wished. I should not have left him thus, he said, without any means of making my way; I should have told him my intention. I should have confided in him; he would never have forced me to be his mistress. Violent as he had seemed inhis despair , he, in truth, loved me far too well and too tenderly to constitute himself my tyrant; he would have given me half his fortune, without demanding so much as a kiss in return, rather than I should have flung myself friendless on the wide world. I had endured, he was certain, more than I had confessed to him. “Well, whatever my sufferings had been, they were very short,” I answered; and then I proceeded to tell him how I had been received at Moor House, how I had obtained the office of school mistress, &c. The accession of fortune, the discovery of my relations, followed in due order . Of course, St. John Rivers’ name came in frequently in the progress of my tale. When I had done, that name was immediately taken up. “This St. John, then, is your cousin?” “Yes.” “You have spoken of him often; did you like him?” “He was a very good man, sir; I could not help liking him.” “A good man? Does that mean a respectable, well-conducte d man of fifty? Or what does it mean?” “St. John was only twenty-nine, sir .” “ ‘Jeune encor e,’im as the French say. Is he a person of low stature, phlegmatic, and plain? A person whose goodness consists rather in his guiltlessness of vice than in his prowess in virtue?” “He is untiringl y active. Great and exalted deeds are what he lives to perform.” “But his brain? That is probably rather soft? He means well; but you shrug your shoulders to hear him talk?” “He talks little, sir; what he does say is ever to the point. His brain is first- rate, I should think; not impressible, but vigorous.” “Is he an able man, then?” “Truly able.” “A thoroughly educated man?”“St. John is an accomplished and profound scholar .” “His manners, I think you said, are not to your taste? priggish and parsonic?” “I never mentioned his manners; but, unless I had a very bad taste, they must suit it; they are polished, calm, and gentleman-like.” “His appearance—I forget what description you gave of his appearance; a sort of raw curate, half strangled with his white neckcloth, and stilted up on his thick-soled high-lows,in eh?” “St. John dresses well. He is a handsome man; tall, fair, with blue eyes, and a Grecian profile.” (Aside): “Damn him!” (To me): “Did you like him, Jane?” “Yes, Mr . Rochester , I liked him; but you asked me that before.” I perceived, of course, the drift of my interlocutor . Jealousy had got hold of him; she stung him; but the sting was salutary; it gave him respite from the gnawing fang of melancholy . I would not, therefore, immedi ately charm the snake. “Perhaps you would rather not sit any longer on my knee, Miss Eyre?” was the next somewhat unexpected observation. “Why not, Mr . Rochester?” “The picture you have just drawn is suggestive of a rather too overwhelming contrast. Your words have delineated very prettily a graceful Apollo; he is present to your imagination—tall, fair, blue-eyed, and with a Grecian profile. Your eyes dwell on a Vulcan io—a real blacksmith, brown, broad-shouldered; and blind and lame in the bar gain.” “I never thought of it before; but you certainly are rather like Vulcan, sir .” “Well—you can leave me, ma‘a m; but before you go (and he retained me by a firmer grasp than ever), you will be pleased just to answer me a question or two.” He paused. “What questions, Mr . Rochester?” Then followed this cross-examination:“St. John made you school-mistress of Morton before he knew you were his cousin?” “Yes.” “You would often see him? He would visit the school sometimes?” “Daily .” “He would approve of your plans, Jane? I know they would be clever; for you are a talented creature.” “He approved of them—yes.” “He would discover many things in you he could not have expected to find? Some of your accomplishments are not ordinary .” “I don’ t know about that.” “You had a little cottage near the school, you say; did he ever come there to see you?” “Now and then.” “Of an evening?” “Once or twice.” A pause. “How long did you reside with him and his sisters after the cousinship was discovered?” “Five months.” “Did Rivers spend much time with the ladies of his family?” “Yes; the back parlor was both his study and ours; he sat near the window , and we by the table.” “Did he study much?” “A good deal.” “What?” “Hindostanee.” “And what did you do meantime?” “I learned German, at first.”“Did he teach you?” “He did not understand German.” “Did he teach you nothing?” “A little Hindostanee.” “Rivers taught you Hindostanee?” “Yes, sir .” “And his sisters also?” “No.” “Only you?” “Only me.” “Did you ask to learn?” “No.” “He wished to teach you?” “Yes.” A second pause. “Why did he wish it? Of what use could Hindostanee be to you?” “He intended me to go with him to India.” “Ah! here I reach the root of the matter . He wanted you to marry him?” “He asked me to marry him.” “That is a fiction—an impudent invention to vex me.” “I beg your pardon, it is the literal truth; he asked me more than once, and was as stif f about ur ging his point as ever you could be.” “Miss Eyre, I repeat it, you can leave me. How often am I to say the same thing? Why do you remain pertinaciously perched on my knee, when I have given you notice to quit?” “Because I am comfortable there.” “No, Jane, you are not comfortable there; because your heart is not with me; it is with this cousin—this St. John. Oh, till this moment, I thought mylittle Jane was all mine! I had a belief she loved me even when she left me; that was an atom of sweet in much bitter . Long as we have been parted, hot tears as I have wept over our separation, I never thought that while I was mourning her, she was loving another! But it is useless grieving. Jane, leave me; go and marry Rivers.” “Shake me off, then, sir—push me away; for I’ll not leave you of my own accord.” “Jane, I ever like your tone of voice; it still renews hope, it sounds so truthful. When I hear it, it carries me back a year. I forgot that you have formed a new tie. But I am not a fool—go—” “Where must I go, sir?” “Your own way—with the husband you have chosen.” “Who is that?” “You know—this St. John Rivers.” “He is not my husband, nor ever will be. He does not love me; I do not love him. He loves (as he can love, and that is not as you love) a beautiful young lady called Rosamond. He wanted to marry me only because he thought I should make a suitable missionary’ s wife, which she would not have done. He is good and great, but severe; and, for me, cold as an iceber g. He is not like you, sir; I am not happy at his side, nor near him, nor with him. He has no indulgence for me—no fondness. He sees nothing attractive in me; not even youth—only a few useful mental points. Then, must I leave you, sir , to go to him?” I shudde red involuntarily , and clung instinctively closer to my blind but beloved master . He smiled. “What, Jane! Is this true? Is such really the state of matters between you and Rivers?” “Absolutely , sir. Oh, you need not be jealous! I wanted to tease you a little to make you less sad; I thought anger would be better than grief . But if you wish me to love you, could you but see how much I do love you, you would be proud and content. All my heart is yours, sir; it belongs to you; and withyou it would remain, were fate to exile the rest of me from your presence forever .” Again, as he kissed me, painful thoughts darkened his aspect. “My seared vision! My crippled strength!” he murmured regretfully . I caressed in order to soothe him. I knew of what he was thinking, and wanted to speak for him, but dared not. As he turned aside his face a minute, I saw a tear slide from under the sealed eyelid, and trickle down the manly cheek. My heart swelled. “I am no better than the old, lightning-struck chestnut-tree in Thornfield orchard,” he remarked, ere long. “And what right would that ruin have to bid a budding woodbine cover its decay with freshness?” “You are no ruin, sir—no lightning-struck tree; you are green and vigorous. Plants will grow abou t your roots, whether you ask them or not, because they take delight in your bountiful shadow; and as they grow they will lean toward you, and wind round you, because your strength offers them so safe a prop.” Again he smiled; I gave him comfort. “You speak of friends, Jane?” he asked. “Yes; of friends,” I answered, rather hesitatingly; for I knew I meant more than friends, but could not tell what other word to employ . He helped me. “Ah! Jane. But I want a wife.” “Do you, sir?” “Yes; is it news to you?” “Of course; you said nothing about it before.” “Is it unwelcome news?” “That depends on circumstances, sir—on your choice.” “Which you shall make for me, Jane. I will abide by your decision.” “Choose then, sir— her who loves you best.” “I will at least choose— her I love best. Jane, will you marry me?” “Yes, sir .”“A poor blind man, whom you will have to lead about by the hand?” “Yes, sir .” “A cripp led man, twenty years older than you, whom you will have to wait on?” “Yes, sir .” “Truly, Jane?” “Most truly , sir.” “Oh! my darling! God bless you and reward you!” “Mr. Rochester , if ever I did a good deed in my life—if ever I thought a good thought—if ever I prayed a sincere and blameless praye r—if ever I wished a righteous wish, I am rewarded now. To be your wife is, for me, to be as happy as I can be on earth.” “Because you delight in sacrifice.” “Sacrifice! Wha t do I sacrifice? Famine for food, expectation for content. To be privileged to put my arms round what I value—to press my lips to what I love—to repose on what I trust; is that to make a sacrifice? If so, then certainly I delight in sacrifice.” “And to bear with my infirmities, Jane; to overlook my deficiencies.” “Which are none, sir, to me. I love you better now, when I can really be useful to you, than I did in your state of proud independence, when you disdained every part but that of the giver and protector .” “Hitherto I have hated to be helped—to be led; henceforth, I feel, I shall hate it no more. I did not like to put my hand into a hireling‘s, but it is pleasant to feel it circled by Jane’s little fingers. I preferred utter loneliness to the constant attendance of servants; but Jane’ s soft ministr y will be a perpetual joy . Jane suits me; do I suit her?” “To the finest fibre of my nature, sir .” “The case being so, we have nothing in the world to wait for; we must be married instantly .” He looked and spoke with eagerness; his old impetuosity was rising.“We must become one flesh without any delay , Jane; there is but the license to get—then we marry—” “Mr. Rochester , I have just discovered the sun is far declined from its meridian, and Pilot is actually gone home to his dinner . Let me look at your watch.” “Fasten it into your girdle, Janet, and keep it henceforward; I have no use for it.” “It is nearly four o‘clock in the afternoon, sir . Don’ t you feel hungry?” “The third day from this must be our wedding-day , Jane. Never mind fine clothes and jewels, now; all that is not worth a fillip.” “The sun has dried up all the rain-drops, sir. The breeze is still; it is quite hot.” “Do you know , Jane, I have your little pearl necklace at this moment fastened round my bronze scragip under my crava t? I have worn it since the day I lost my only treasure; as a memento of her .” “We will go home through the wood; that will be the shadiest way .” He pursued his own thoughts without heeding me. “Jane! you think me, I dare say, an irreligious dog; but my heart swells with gratitude to the beneficent God of this earth just now. He sees not as man sees, but far clearer; judge s not as man judges, but far more wisely . I did you wrong; I would have sullied my innocent flower—breat hed guilt on its purity; the Omnipotent snatched it from me. I, in my stiff-necked rebellion, almos t cursed the dispensation; instead of bending to the decree, I defied it. Divine justice pursued its course; disasters came thick upon me; I was forced to pass through the valley of the shadow of death.120 His chastisements are mighty; and one smote me which has humbled me forever . You know I was proud of my strength; but what is it now, when I must give it over to foreign guidance, as a child does its weakne ss? Of late, Jane—only of late—I began to see and acknowledge the hand of God in my doom. I began to experience remorse, repentance; the wish for reconcilement to my Maker . I began sometimes to pray; very brief prayers they were, but very sincere.“Some days since—nay , I can number them, four; it was last Monday night, a singular mood came over me, one in which grief replaced frenzy; sorrow , sullenne ss. I had long had the impression that since I could nowhere find you, you must be dead. Late that night, perhaps it might be between eleven and twelv e o‘clock, ere I retired to my dreary rest, I supplicated God that, if it seeme d good to Him, I might soon be taken from this life and admitted to that world to come, where there was still hope of rejoining Jane. “I was in my own room and sitting by the window , which was open; it soothed me to feel the balmy night air, though I could see no stars, and only by a vague, luminous haze knew the presence of a moon. I longed for thee, Janet! Oh, I longed for thee both with soul and flesh! I asked of God, at once in anguish and humility , if I had not been long enoug h desolate, afflicted, tormented, and might not soon taste bliss and peace once more. That I merited all I endured, I acknowledged; that I could scarcely endure more, I pleaded; and the alpha and omega of my heart’ s wishes broke involuntarily from my lips, in the words, ‘Jane! Jane! Jane!’ ” “Did you speak these words aloud?” “I did, Jane. If any listener had heard me he would have though t me mad, I pronounced them with such frantic ener gy.” “And it was last Monday night; somewhere near midnight?” “Yes; but the time is of no consequence; what followed is the strange point. You will think me superstitious—some superstition I have in my blood, and always had; nevertheless, this is true—true, at least, it is that I heard what I now relate. “As I exclaimed ‘Jane! Jane! Jane!’ a voice—I cannot tell whence the voice came, but I know whose voice it was—replied, ‘I am coming; wait for me!’ and a moment after, went whispering on the wind, the words, ‘Where are you?’ “I’ll tell you, if I can, the idea, the picture, these words opened to my mind; yet it is difficult to express what I want to express. Ferndean is buried, as you see, in a heavy wood, where sound falls dull and lies unreverberating. ‘Where are you?’ seemed spoken among mountains, for I heard a hill-sent echo repeat the words. Cooler and fresher at the momentthe gale seemed to visit my brow; I could have deemed that in some wild, lone scene, I and Jane were meeting. In spirit, I believe, we must have met. You, no doubt, were at that hour in unconscious sleep, Jane; perhaps your soul wandered from its cell to comfort mine; for those were your accents— as certain as I live—they were yours!” Reader , it was on Monday night, near midnight, that I, too, had received the mysterious summons; those were the very words by which I had replied to it. I listened to Mr. Roches ter’s narrative, but made no disclosure in return. The coincidence struck me as too awful and inexplicable to be communicated or discussed. If I told anything, my tale would be such as must necessarily make a profound impression on the mind of my hearer; and that mind, yet from its sufferings too prone to gloom, needed not the deeper shade of the supernatur al. I kept these things, then, and pondered them in my heart.121 “You cannot now wonder ,” continued my master , “that when you rose upon me so unexpectedly last night, I had difficulty in believing you any other than a mere voice and vision; something that would melt to silence and annihilation, as the midnight whisper and mountain echo had melted before. Now , I thank God! I know it to be otherwise. Yes, I thank God!” He put me off his knee, rose, and reverently lifting his hat from his brow , and bending his sightless eyes to the earth, he stood in mute devotion. Only the last words of the worship were audible. “I thank my Maker , that in the midst of judgment he has remembered mercy . I humbly entreat my Redeemer to give me streng th to lead henceforth a purer life than I have done hitherto!” Then he stretched his hand out to be led. I took that dear hand, held it a moment to my lips, then let it pass round my shoulder; being so much lower of statur e than he, I served both for his prop and guide. We entered the wood, and wended homeward. OceanofPDF .comChapter XXXVIII Conclusion Reader , I married him. A quiet wedding we had; he and I, the parson and clerk, were alone present. When we got back from church, I went into the kitchen of the manor-house, where Mary was cooking the dinner and John cleaning the knives, and I said: “Mary , I have been married to Mr. Rochester this morning.” The housekeeper and her husband were both of that decent, phlegma tic order of people to whom one may at any time safely communicate a remarkable piece of news without incurring the danger of having one’s ears pierced by some shrill ejaculation, and subsequently stunned by a torrent of wordy wonderment. Mary did look up, and she did stare at me; the ladle with which she was basting a pair of chickens roasting at the fire did for some three minutes hang suspended in air; and for the same space of time John’ s knives also had rest from the polishing process; but Mary , bending again over the roast, said only , “Have you, miss? Well, for sure!” A short time after she pursued: “I seed you go out with the master, but I didn’ t know you were gone to church to be wed”; and she basted away . John, when I turned to him, was grinning from ear to ear . “I telled Mary how it would be,” he said; “I knew what Mr. Edward”— (John was an old servant, and had known his master when he was the cadet of the house, therefore he often gave him his Christian name )—“I knew what Mr. Edward would do, and I was certain he would not wait long neither; and he’s done right, for aught I know . I wish you joy, miss!” and he politely pulled his fore-lock.“Thank you, John. Mr. Rochest er told me to give you and Mary this.” I put into his hand a five-pound note. Without waiting to hear more, I left the kitchen. In passing the door of that sanctum some time after, I caught the words— “She’ll happen do better for him nor ony o’ t’ grand ladies.” And again, “If she ben’t one o’ th’ hands omest, she’s noan faâliq and varry good- natured; and i’ his een she’ s fair beautiful, onybody may see that.” I wrote to Moor House and to Cambridge immediately , to say what I had done; fully explained also why I had thus acted. Diana and Mary approved the step unreservedly . Diana announced that she would just give me time to get over the honey-moon, and then she would come and see me. “She had better not wait till then, Jane,” said Mr. Rochester , when I read her letter to him; “if she does she will be too late, for our honey -moon will shine our life-long; its beams will only fade over your grave or mine.” How St. John received the news I don’t know; he never answered the letter in which I communicated it; yet six months after, he wrote to me, without, however , mentioning Mr. Rochester ’s name or alluding to my marriage. His letter was then calm, and, though very serious, kind. He has maintained a regular , though not frequent, correspondence ever since; he hopes I am happy , and trusts I am not of those who live without God in the world, and only mind earthly things.122 You have not quite forgotten little Adèle, have you, reader? I had not; I soon asked and obtained leave of Mr. Rochester to go and see her at the school where he had placed her. Her frantic joy at beholding me again moved me much. She looked pale and thin; she said she was not happy . I found the rules of the establishment were too strict, its course of study too severe, for a child of her age; I took her home with me. I meant to become",
      "density_breakdown": {
        "Metaphor": 2.679528403001072,
        "Simile": 1.9649874955341196,
        "Imagery": 10.539478385137548,
        "Symbolism": 8.395855662736691,
        "Dialogue": 0.0,
        "Foreshadowing": 11.789924973204716,
        "Juxtaposition": 12.147195426938193,
        "Repetition": 5.716327259735619,
        "TOTAL_DENSITY": 53.23329760628796
      }
    }
  },
  "narrative_position_mapping": {
    "exposition": {
      "chapter_range": "1-4",
      "narrative_primary": 1,
      "optimized_primary": 3,
      "device_density_score": 51.80421579135405,
      "optimization_applied": true,
      "pages": ""
    },
    "rising_action": {
      "chapter_range": "5-22",
      "narrative_primary": 14,
      "optimized_primary": 22,
      "device_density_score": 56.43864975888552,
      "optimization_applied": true,
      "pages": ""
    },
    "climax": {
      "chapter_range": "23-27",
      "narrative_primary": 26,
      "optimized_primary": 23,
      "device_density_score": 58.592354412290106,
      "optimization_applied": true,
      "pages": ""
    },
    "falling_action": {
      "chapter_range": "28-35",
      "narrative_primary": 32,
      "optimized_primary": 34,
      "device_density_score": 56.62736691675598,
      "optimization_applied": true,
      "pages": ""
    },
    "resolution": {
      "chapter_range": "36-38",
      "narrative_primary": 38,
      "optimized_primary": 36,
      "device_density_score": 53.23329760628796,
      "optimization_applied": true,
      "pages": ""
    }
  },
  "macro_variables": {
    "narrative": {
      "voice": {
        "pov": "FP",
        "pov_description": "First-person narration from Jane's perspective throughout",
        "focalization": "INT",
        "focalization_description": "Limited to Jane's internal perception and understanding",
        "reliability": "REL",
        "temporal_distance": "RETRO",
        "mode_dominance": "BAL",
        "free_indirect": "SOME",
        "stream_consciousness": "NONE",
        "character_revelation": "MIX",
        "narrative_intrusion": "SOME",
        "voice_consistency": "CONS"
      },
      "structure": {
        "chronology": "LIN",
        "framing": "NONE",
        "plot_architecture": "MONO",
        "plot_architecture_description": "Single bildungsroman plot following Jane's development",
        "pacing": "VAR",
        "temporal_span": "EXTENDED",
        "beginning_type": "AB_OVO",
        "ending_type": "CLOSED",
        "scene_summary_ratio": "SCENE",
        "chapter_structure": "TRAD",
        "causation": "STRONG"
      }
    },
    "rhetoric": {
      "voice": {
        "tone": "earnest, passionate, morally assertive",
        "register": "FORM",
        "stance": "SUBJ",
        "ethos": "STRONG",
        "pathos": "STRONG",
        "logos": "MOD",
        "irony": "SIT",
        "figurative_density": "HIGH"
      },
      "structure": {
        "alignment_type": "TRANS",
        "narrative_rhetoric_relationship": "TIGHT",
        "primary_mechanism": "CHAR",
        "device_density": "HIGH",
        "device_distribution": "PEAK",
        "mediation_strategy": "ACCUMULATION"
      }
    },
    "device_mediation": {
      "summary": "Literary devices accumulate to support Jane's moral and emotional development, with figurative language, symbolism, and dialogue mediating her transformation from powerless orphan to independent woman who achieves equality in love through moral strength rather than social position."
    }
  },
  "alignment_pattern": {
    "pattern_name": "Moral Bildungsroman",
    "core_dynamic": "First-person retrospective narration with tight character-mediated alignment creates intimate access to moral development while maintaining formal distance through temporal remove.",
    "reader_effect": "Readers experience Jane's emotional journey intimately while gaining wisdom perspective through the mature narrator's moral framework and accumulated understanding.",
    "device_priorities": [
      "Foreshadowing",
      "Juxtaposition",
      "Imagery",
      "Symbolism",
      "Repetition",
      "Metaphor",
      "Dramatic Irony",
      "Characterization"
    ]
  },
  "micro_devices": [
    {
      "name": "First-Person Narration",
      "anchor_phrase": "There was no possibility of taking a walk that day",
      "location_percent": 5,
      "scene": "Opening sentence establishing narrator's perspective on a confined winter day",
      "effect": "Establishes intimate retrospective voice that creates immediate access to Jane's subjective experience while maintaining temporal distance through mature narrative tone",
      "assigned_section": "exposition",
      "chapter": 3,
      "chapter_range": "1-4",
      "pedagogical_tier": 5
    },
    {
      "name": "Symbolism",
      "anchor_phrase": "red moreen curtain nearly close, I was shrined in double retirement",
      "location_percent": 25,
      "scene": "Jane hiding behind curtains in the breakfast-room window seat",
      "effect": "The curtained enclosure symbolizes Jane's marginalized position and need for protection, foreshadowing her moral journey toward finding legitimate shelter and belonging",
      "assigned_section": "exposition",
      "chapter": 3,
      "chapter_range": "1-4",
      "pedagogical_tier": 3
    },
    {
      "name": "Imagery",
      "anchor_phrase": "death-white realms I formed an idea of my own",
      "location_percent": 35,
      "scene": "Jane reading about Arctic landscapes in Bewick's bird book",
      "effect": "Creates atmospheric connection between Jane's inner desolation and external landscapes, establishing pattern of psychological states reflected in natural imagery",
      "assigned_section": "exposition",
      "chapter": 3,
      "chapter_range": "1-4",
      "pedagogical_tier": 1
    },
    {
      "name": "Foreshadowing",
      "anchor_phrase": "Each picture told a story; mysterious often to my undeveloped understanding",
      "location_percent": 40,
      "scene": "Jane studying the illustrations in Bewick's book",
      "effect": "Hints at Jane's future capacity for deeper moral understanding while establishing her current position as developing consciousness interpreting symbolic meanings",
      "assigned_section": "exposition",
      "chapter": 3,
      "chapter_range": "1-4",
      "pedagogical_tier": 3
    },
    {
      "name": "Juxtaposition",
      "anchor_phrase": "I was a discord in Gateshead Hall; I was like nobody there",
      "location_percent": 85,
      "scene": "Jane's retrospective analysis of her alienation in the red-room",
      "effect": "Contrasts Jane's nature against the Reed family environment, establishing the moral conflict that will drive her bildungsroman journey toward finding compatible community",
      "assigned_section": "exposition",
      "chapter": 3,
      "chapter_range": "1-4",
      "pedagogical_tier": 3
    },
    {
      "name": "Metaphor",
      "anchor_phrase": "my reason, forced by the agonizing stimulus into precocious though transitory power",
      "location_percent": 80,
      "scene": "Jane's intellectual awakening during her punishment in the red-room",
      "effect": "Presents reason as a faculty that can be awakened by moral crisis, establishing pattern of Jane's growth through ethical challenges that develop her judgment",
      "assigned_section": "exposition",
      "chapter": 3,
      "chapter_range": "1-4",
      "pedagogical_tier": 1
    },
    {
      "name": "Repetition",
      "anchor_phrase": "Why was I always suffering, always brow-beaten, always accused, forever condemned",
      "location_percent": 75,
      "scene": "Jane's internal questioning of her treatment at Gateshead",
      "effect": "Emphasizes the systematic nature of Jane's oppression while building toward her moral awakening and future assertion of self-worth",
      "assigned_section": "exposition",
      "chapter": 3,
      "chapter_range": "1-4",
      "pedagogical_tier": 2
    },
    {
      "name": "Symbolism",
      "anchor_phrase": "the chestnut-tree. It stood up, black and riven",
      "location_percent": 65,
      "scene": "Jane encounters the lightning-struck chestnut tree in the orchard the night before her wedding",
      "effect": "Creates intimate access to Jane's moral interpretation of the destroyed tree as prophetic symbol while maintaining formal distance through her reflective analysis of its meaning",
      "assigned_section": "climax",
      "chapter": 23,
      "chapter_range": "23-27",
      "pedagogical_tier": 3
    },
    {
      "name": "Foreshadowing",
      "anchor_phrase": "I feared my hopes were too bright to be realized",
      "location_percent": 85,
      "scene": "Jane waiting anxiously for Rochester's return, interpreting the previous night's mysterious event as ominous",
      "effect": "Provides retrospective narrator's subtle hint at coming disaster while preserving Jane's innocent perspective in the moment of telling",
      "assigned_section": "climax",
      "chapter": 23,
      "chapter_range": "23-27",
      "pedagogical_tier": 3
    },
    {
      "name": "First-Person Narration",
      "anchor_phrase": "Stay till he comes, reader; and, when I disclose",
      "location_percent": 55,
      "scene": "Jane directly addressing the reader about the mysterious event from the previous night",
      "effect": "Creates intimate bond between mature narrator and reader while building suspense about moral crisis to come",
      "assigned_section": "climax",
      "chapter": 23,
      "chapter_range": "23-27",
      "pedagogical_tier": 5
    },
    {
      "name": "Imagery",
      "anchor_phrase": "her disk was blood-red and half overcast",
      "location_percent": 70,
      "scene": "Jane observing the ominous moon through the split chestnut tree",
      "effect": "Provides sensory access to Jane's moral intuition about impending doom while allowing reader to interpret symbolic meaning independently",
      "assigned_section": "climax",
      "chapter": 23,
      "chapter_range": "23-27",
      "pedagogical_tier": 1
    },
    {
      "name": "Juxtaposition",
      "anchor_phrase": "You, sir, are the most phantom-like of all",
      "location_percent": 95,
      "scene": "Jane telling Rochester he seems unreal despite his physical presence",
      "effect": "Contrasts Jane's spiritual uncertainty with Rochester's material confidence, revealing her developing moral awareness of their relationship's instability",
      "assigned_section": "climax",
      "chapter": 23,
      "chapter_range": "23-27",
      "pedagogical_tier": 3
    },
    {
      "name": "Repetition",
      "anchor_phrase": "I wish he would come! I wish he would come!",
      "location_percent": 88,
      "scene": "Jane's anxious waiting for Rochester's return in the storm",
      "effect": "Emphasizes Jane's emotional dependence while the retrospective frame suggests the narrator's awareness of this as moral weakness",
      "assigned_section": "climax",
      "chapter": 23,
      "chapter_range": "23-27",
      "pedagogical_tier": 2
    },
    {
      "name": "Metaphor",
      "anchor_phrase": "my whole world, and more than the world—almost my hope of heaven",
      "location_percent": 45,
      "scene": "Jane's retrospective analysis of her feelings during the courtship month",
      "effect": "Reveals the moral danger of idolatry through intimate confession while temporal distance allows mature judgment of past spiritual blindness",
      "assigned_section": "climax",
      "chapter": 23,
      "chapter_range": "23-27",
      "pedagogical_tier": 1
    },
    {
      "name": "Dramatic Irony",
      "anchor_phrase": "Mrs. Rochester! she did not exist; she would not be born",
      "location_percent": 50,
      "scene": "Jane contemplating the wedding cards addressed to 'Mrs. Rochester'",
      "effect": "Creates tension between Jane's innocent anticipation and reader's awareness that this identity will indeed never come to exist, deepening moral complexity",
      "assigned_section": "climax",
      "chapter": 23,
      "chapter_range": "23-27",
      "pedagogical_tier": 4
    },
    {
      "name": "Metaphor",
      "anchor_phrase": "To me, he was in reality become no longer flesh, but marble",
      "location_percent": 15,
      "scene": "Jane reflecting on St. John's cold treatment after their confrontation",
      "effect": "Creates intimate access to Jane's moral perception of relationships without love, establishing the dehumanizing effect of duty divorced from feeling through first-person retrospective insight",
      "assigned_section": "falling_action",
      "chapter": 34,
      "chapter_range": "28-35",
      "pedagogical_tier": 1
    },
    {
      "name": "Imagery",
      "anchor_phrase": "His eye was a cold, bright, blue gem; his tongue, a speaking instrument",
      "location_percent": 18,
      "scene": "Jane describing St. John's transformed demeanor toward her",
      "effect": "Provides visceral access to Jane's developing understanding of loveless relationships through sensory details that reinforce moral bildungsroman themes via character-mediated perception",
      "assigned_section": "falling_action",
      "chapter": 34,
      "chapter_range": "28-35",
      "pedagogical_tier": 1
    },
    {
      "name": "Foreshadowing",
      "anchor_phrase": "if I were his wife, this good man...could soon kill me",
      "location_percent": 20,
      "scene": "Jane contemplating the consequences of marriage to St. John",
      "effect": "Anticipates her ultimate rejection of his proposal while revealing moral growth through intimate first-person insight into the dangers of sacrificing authentic feeling for duty",
      "assigned_section": "falling_action",
      "chapter": 34,
      "chapter_range": "28-35",
      "pedagogical_tier": 3
    },
    {
      "name": "Symbolism",
      "anchor_phrase": "The avalanche had shaken and slid a little forward, but it did not yet crash down",
      "location_percent": 45,
      "scene": "Jane describing St. John's controlled anger after she refuses marriage again",
      "effect": "Represents the suppressed emotional violence beneath religious duty, allowing retrospective moral analysis of how spiritual authority can mask destructive impulses",
      "assigned_section": "falling_action",
      "chapter": 34,
      "chapter_range": "28-35",
      "pedagogical_tier": 3
    },
    {
      "name": "Juxtaposition",
      "anchor_phrase": "To his sisters, meantime, he was somewhat kinder than usual",
      "location_percent": 25,
      "scene": "Jane observing St. John's differential treatment of family members",
      "effect": "Contrasts his coldness toward Jane with warmth toward others, deepening first-person moral insight into manipulative aspects of his character through comparative observation",
      "assigned_section": "falling_action",
      "chapter": 34,
      "chapter_range": "28-35",
      "pedagogical_tier": 3
    },
    {
      "name": "First-Person Narration",
      "anchor_phrase": "Reader, do you know, as I do, what terror those cold people",
      "location_percent": 42,
      "scene": "Jane directly addressing the reader about St. John's intimidating nature",
      "effect": "Creates intimate moral guidance through direct reader address, establishing the retrospective wisdom that characterizes the bildungsroman pattern while maintaining formal narrative distance",
      "assigned_section": "falling_action",
      "chapter": 34,
      "chapter_range": "28-35",
      "pedagogical_tier": 5
    },
    {
      "name": "Repetition",
      "anchor_phrase": "Jane! Jane! Jane!",
      "location_percent": 85,
      "scene": "Jane hearing Rochester's mysterious voice calling to her",
      "effect": "Emphasizes the spiritual/supernatural intervention that resolves her moral crisis, providing climactic moment where authentic feeling triumphs over duty through repeated mystical summons",
      "assigned_section": "falling_action",
      "chapter": 34,
      "chapter_range": "28-35",
      "pedagogical_tier": 2
    }
  ]
}