{
  "metadata": {
    "title": "We Have Always Lived in the Castle",
    "author": "Shirley Jackson",
    "edition": "Penguin Classics, 2006",
    "creation_date": "2025-12-10T21:09:50.143842",
    "protocol_version": "4.0",
    "kernel_version": "5.1",
    "chapter_aware": true,
    "structure_alignment_protocol": "v1.1",
    "device_density_optimization": true
  },
  "text_structure": {
    "has_chapters": true,
    "total_chapters_estimate": 10,
    "notes": "Chapter breaks identified during kernel creation"
  },
  "structure_detection": {
    "structure_type": "NUM",
    "total_units": 10,
    "special_elements": [],
    "notes": "Numbered chapters 1-10 detected"
  },
  "chapter_alignment": {
    "exposition": {
      "chapter_range": "1-2",
      "chapters": [
        1,
        2
      ],
      "primary_chapter": 1,
      "percentage": 20
    },
    "rising_action": {
      "chapter_range": "3-7",
      "chapters": [
        3,
        4,
        5,
        6,
        7
      ],
      "primary_chapter": 5,
      "percentage": 50
    },
    "climax": {
      "chapter_range": "8",
      "chapters": [
        8
      ],
      "primary_chapter": 8,
      "percentage": 10
    },
    "falling_action": {
      "chapter_range": "9",
      "chapters": [
        9
      ],
      "primary_chapter": 9,
      "percentage": 10
    },
    "resolution": {
      "chapter_range": "10",
      "chapters": [
        10
      ],
      "primary_chapter": 10,
      "percentage": 10
    }
  },
  "chapter_optimization": {
    "exposition": {
      "chapter_range": "1-2",
      "narrative_primary": 1,
      "optimized_primary": 2,
      "device_density_score": 58.959332267803234,
      "improvement_percent": 19.4032520387526,
      "optimization_applied": true,
      "chapter_text": "it. “A small leg of lamb,” I said, “my Uncle Julian always fancies a roasted lamb in the first spring days.” I should not have said it, I knew, and a little gasp went around the store like a scream. I could make them run like rabbits, I thought, if I said to them what I really wanted to, but they would only gather again outside and watch for me there. “Onions,” I said politely to Mr. Elbert, “coffee, bread, flour. Walnuts,” I said, “and sugar; we are very low on sugar.” Somewhere behind me there was a little horrified laugh, and Mr. Elbert glanced past me, briefly, and then to the items he was arranging on the counter. In a minute Mrs. Elbert would bring my chicken and my meat, wrapped, and set them down by the other things; I need not turn around until I was ready to go. “Two quarts of milk,” I said. “A half pint of cream, a pound of butter.” The Harrises had stopped delivering dairy goods to us six years ago and I brought milk and butter home from the grocery now. “And a dozen eggs.” Constance had forgotten to put eggs on the list, but there had been only two at home. “A box of peanut brittle,” I said; Uncle Julian would clatter and crunch over his papers tonight, and go to bed sticky. “The Blackwoods always did set a fine table.” That was Mrs. Donell, speaking clearly from somewhere behind me, and someone giggled and someone else said “Shh.” I never turned; it was enough to feel them all there in back of me without looking into their flat grey faces with the hating eyes. I wish you were all dead, I thought, and longed to say it out loud. Constance said, “Never let them see that you care,” and “If you pay any attention they’ll only get worse,” and probably it was true, but I wished they were dead. I would have liked to come into the grocery some morning and see them all, even the Elberts and the children, lying there crying with the pain and dying. I would then help myself to groceries, I thought, stepping over their bodies, taking whatever I fancied from the shelves, and go home, with perhaps a kick for Mrs. Donell while she lay there. I was never sorry when I had thoughts like this; I only wished they would come true. “It’s wrong to hate them,” Constance said, “it only weakens you, ” but I hated them anyway, and wondered why it had been worth while creating them in the first place. Mr. Elbert put all my groceries together on the counter and waited, looking past me into the distance. “That’s all I want today,” I told him, and without looking at me he wrote the prices on a slip and added,then passed the slip to me so I could make sure he had not cheated me. I always made a point of checking his figures carefully, although he never made a mistake; there were not many things I could do to get back at them, but I did what I could. The groceries filled my shopping bag and another bag besides, but there was no way of getting them home except by carrying them. No one would ever offer to help me, of course, even if I would let them. Lose two turns. With my library books and my groceries, going slowly, I had to walk down the sidewalk past the general store and into Stella’s. I stopped in the doorway of the grocery, feeling around inside myself for some thought to make me safe. Behind me the little stirrings and coughings began. They were getting ready to talk again, and across the width of the store the Elberts were probably rolling their eyes at each other in relief. I froze my face hard. Today I was going to think about taking our lunch out into the garden, and while I kept my eyes open just enough to see where I was walking—our mother’s brown shoes going up and down—in my mind I was setting the table with a green cloth and bringing out yellow dishes and strawberries in a white bowl. Yellow dishes, I thought, feeling the eyes of the men looking at me as I went by, and Uncle Julian shall have a nice soft egg with toast broken into it, and I will remember to ask Constance to put a shawl across his shoulders because it is still very early spring. Without looking I could see the grinning and the gesturing; I wished they were all dead and I was walking on their bodies. They rarely spoke directly to me, but only to each other. “That’s one of the Blackwood girls,” I heard one of them say in a high mocking voice, “one of the Blackwood girls from Blackwood Farm.” “Too bad about the Blackwoods,” someone else said, just loud enough, “too bad about those poor girls.” “Nice farm out there,” they said, “nice land to farm. Man could get rich, farming the Blackwood land. If he had a million years and three heads, and didn’t care what grew, a man could get rich. Keep their land pretty well locked up, the Blackwoods do.” “Man could get rich.” “Too bad about the Blackwood girls.” “Never can tell what’ll grow on Blackwood land.” I am walking on their bodies, I thought, we are having lunch in the garden and Uncle Julian is wearing his shawl. I always held my groceries carefully along here, because one terrible morning I had dropped the shopping bag and the eggs broke and the milk spilled and I gathered up what I could while they shouted, telling myself that whatever I did I would not run away, shovelling cans and boxes andspilled sugar wildly back into the shopping bag, telling myself not to run away. In front of Stella’s there was a crack in the sidewalk that looked like a finger pointing; the crack had always been there. Other landmarks, like the handprint Johnny Harris made in the concrete foundation of the town hall and the Mueller boy’s initials on the library porch, had been put in in times that I remembered; I was in the third grade at the school when the town hall was built. But the crack in the sidewalk in front of Stella’s had always been there, just as Stella’s had always been there. I remember roller-skating across the crack, and being careful not to step on it or it would break our mother’s back, and riding a bicycle past here with my hair flying behind; the villagers had not openly disliked us then although our father said they were trash. Our mother told me once that the crack was here when she was a girl in the Rochester house, so it must have been here when she married our father and went to live on Blackwood Farm, and I suppose the crack was there, like a finger pointing, from the time when the village was first put together out of old grey wood and the ugly people with their evil faces were brought from some impossible place and set down in the houses to live. Stella bought the coffee urn and put in the marble counter with the insurance money when her husband died, but otherwise there had been no change in Stella’s since I could remember; Constance and I had come in here to spend pennies after school and every afternoon we picked up the newspaper to take home for our father to read in the evening; we no longer bought newspapers, but Stella still sold them, along with magazines and penny candy and grey postcards of the town hall. “Good morning, Mary Katherine,” Stella said when I sat down at the counter and put my groceries on the floor; I sometimes thought when I wished all the village people dead that I might spare Stella because she was the closest to kind that any of them could be, and the only one who managed to keep hold of any color at all. She was round and pink and when she put on a bright print dress it stayed looking bright for a little while before it merged into the dirty grey of the rest. “How are you today?” she asked. “Very well, thank you.” “And Constance Blackwood, is she well?” “Very well, thank you.” “And how is he ?”“As well as can be expected. Black coffee, please.” I really preferred sugar and cream in my coffee, because it is such bitter stuff, but since I only came here out of pride I needed to accept only the barest minimum for token. If anyone came into Stella’s while I was there I got up and left quietly, but some days I had bad luck. This morning she had only set my coffee down on the counter when there was a shadow against the doorway, and Stella looked up, and said, “Good morning, Jim.” She went down to the other end of the counter and waited, expecting him to sit down there so I could leave without being noticed, but it was Jim Donell and I knew at once that today I had bad luck. Some of the people in the village had real faces that I knew and could hate individually; Jim Donell and his wife were among these, because they were deliberate instead of just hating dully and from habit like the others. Most people would have stayed down at the end of the counter where Stella waited, but Jim Donell came right to the end where I was sitting and took the stool next to me, as close to me as he could come because, I knew, he wanted this morning to be bad luck for me. “They tell me,” he said, swinging to sit sideways on his stool and look at me directly, “they tell me you’re moving away.” I wished he would not sit so close to me; Stella came toward us on the inside of the counter and I wished she would ask him to move so I could get up and leave without having to struggle around him. “They tell me you’re moving away,” he said solemnly. “No,” I said, because he was waiting. “Funny,” he said, looking from me to Stella and then back. “I could have swore someone told me you’d be going soon.” “No,” I said. “Coffee, Jim?” Stella asked. “Who do you think would of started a story like that, Stella? Who do you think would want to tell me they’re moving away when they’re not doing any such thing?” Stella shook her head at him, but she was trying not to smile. I saw that my hands were tearing at the paper napkin in my lap, ripping off a little corner, and I forced my hands to be still and made a rule for myself: Whenever I saw a tiny scrap of paper I was to remember to be kinder to Uncle Julian. “Can’t ever tell how gossip gets around,” Jim Donell said. Perhaps someday soon Jim Donell would die; perhaps there was already a rot growing inside him that was going to kill him. “Did you ever hear anything like the gossip in this town?” he asked Stella.“Leave her alone, Jim,” Stella said. Uncle Julian was an old man and he was dying, dying regrettably, more surely than Jim Donell and Stella and anyone else. The poor old Uncle Julian was dying and I made a firm rule to be kinder to him. We would have a picnic lunch on the lawn. Constance would bring his shawl and put it over his shoulders, and I would lie on the grass. “I’m not bothering anybody, Stell. Am I bothering anybody? I’m just asking Miss Mary Katherine Blackwood here how it happens everyone in town is saying she and her big sister are going to be leaving us soon. Moving away. Going somewheres else to live.” He stirred his coffee; from the corner of my eye I could see the spoon going around and around and around, and I wanted to laugh. There was something so simple and silly about the spoon going around while Jim Donell talked; I wondered if he would stop talking if I reached out and took hold of the spoon. Very likely he would, I told myself wisely, very likely he would throw the coffee in my face. “Going somewheres else,” he said sadly. “Cut it out,” Stella said. I would listen more carefully when Uncle Julian told his story. I was already bringing peanut brittle; that was good. “Here I was all upset,” Jim Donell said, “thinking the town would be losing one of its fine old families. That would be really too bad.” He swung the other way around on the stool because someone else was coming through the doorway; I was looking at my hands in my lap and of course would not turn around to see who was coming, but then Jim Donell said “Joe,” and I knew it was Dunham, the carpenter; “Joe, you ever hear anything like this? Here all over town they’re saying that the Blackwoods are moving away, and now Miss Mary Katherine Blackwood sits right here and speaks up and tells me they’re not.” There was a little silence. I knew that Dunham was scowling, looking at Jim Donell and at Stella and at me, thinking over what he had heard, sorting out the words and deciding what each one meant. “That so?” he said at last. “Listen, you two,” Stella said, but Jim Donell went right on, talking with his back to me, and his legs stretched out so I could not get past him and outside. “I was saying to people only this morning it’s too bad when the old families go. Although you could rightly say a good number of the Blackwoods are gone already.” He laughed, and slapped the counter with his hand. “Gone already,” he said again. The spoon in his cup was still, but he was talking on. “A village loses a lot of stylewhen the fine old people go. Anyone would think,” he said slowly, “that they wasn’t wanted.” “That’s right,” Dunham said, and he laughed. “The way they live up in their fine old private estate, with their fences and their private path and their stylish way of living.” He always went on until he was tired. When Jim Donell thought of something to say he said it as often and in as many ways as possible, perhaps because he had very few ideas and had to wring each one dry. Besides, each time he repeated himself he thought it was funnier; I knew he might go on like this until he was really sure that no one was listening any more, and I made a rule for myself: Never think anything more than once, and I put my hands quietly in my lap. I am living on the moon, I told myself, I have a little house all by myself on the moon. “Well,” Jim Donell said; he smelled, too. “I can always tell people I used to know the Blackwoods. They never did anything to me that I can remember, always perfectly polite to me. Not,” he said, and laughed, “that I ever got invited to take my dinner with them, nothing like that.” “That’s enough right there,” Stella said, and her voice was sharp. “You go pick on someone else, Jim Donell.” “Was I picking on anyone? You think I wanted to be asked to dinner? You think I’m crazy? ” “Me,” Dunham said, “I can always tell people I fixed their broken step once and never got paid for it.” That was true. Constance had sent me out to tell him that we wouldn’t pay carpenter’s prices for a raw board nailed crookedly across the step when what he was supposed to do was build it trim and new. When I went out and told him we wouldn’t pay he grinned at me and spat, and picked up his hammer and pried the board loose and threw it on the ground. “Do it yourself,” he said to me, and got into his truck and drove away. “Never did get paid for it,” he said now. “That must of been an oversight, Joe. You just go right up and speak to Miss Constance Blackwood and she’ll see you get what’s coming to you. Just if you get invited to dinner, Joe, you just be sure and say no thank you to Miss Blackwood.” Dunham laughed. “Not me,” he said. “I fixed their step for them and never did get paid for it.” “Funny,” Jim Donell said, “them getting the house fixed up and all, and planning to move away all the time.” “Mary Katherine,” Stella said, coming down inside the counter to where I was sitting, “you go along home. Just get up off that stool andgo along home. There won’t be any peace around here until you go.” “Now, that’s the truth,” Jim Donell said. Stella looked at him, and he moved his legs and let me pass. “You just say the word, Miss Mary Katherine, and we’ll all come out and help you pack. Just you say the word, Merricat.” “And you can tell your sister from me—” Dunham started to say, but I hurried, and by the time I got outside all I could hear was the laughter, the two of them and Stella. I liked my house on the moon, and I put a fireplace in it and a garden outside (what would flourish, growing on the moon? I must ask Constance) and I was going to have lunch outside in my garden on the moon. Things on the moon were very bright, and odd colors; my little house would be blue. I watched my small brown feet go in and out, and let the shopping bag swing a little by my side; I had been to Stella’s and now I needed only to pass the town hall, which would be empty except for the people who made out dog licenses and the people who counted traffic fines from the drivers who followed the highway into the village and on through, and the people who sent out notices about water and sewage and garbage and forbade other people to burn leaves or to fish; these would all be buried somewhere deep inside the town hall, working busily together; I had nothing to fear from them unless I fished out of season. I thought of catching scarlet fish in the rivers on the moon and saw that the Harris boys were in their front yard, clamoring and quarrelling with half a dozen other boys. I had not been able to see them until I came past the corner by the town hall, and I could still have turned back and gone the other way, up the main highway to the creek, and then across the creek and home along the other half of the path to our house, but it was late, and I had the groceries, and the creek was nasty to wade in our mother’s brown shoes, and I thought, I am living on the moon, and I walked quickly. They saw me at once, and I thought of them rotting away and curling in pain and crying out loud; I wanted them doubled up and crying on the ground in front of me. “Merricat,” they called, “Merricat, Merricat,” and moved all together to stand in a line by the fence. I wondered if their parents taught them, Jim Donell and Dunham and dirty Harris leading regular drills of their children, teaching them with loving care, making sure they pitched their voices right; how else could so many children learn so thoroughly?Merricat, said Connie, would you like a cup of tea? Oh no, said Merricat, you’ll poison me. Merricat, said Connie, would you like to go to sleep? Down in the boneyard ten feet deep! I was pretending that I did not speak their language; on the moon we spoke a soft, liquid tongue, and sang in the starlight, looking down on the dead dried world; I was almost halfway past the fence. “Merricat, Merricat!” “Where’s old Connie—home cooking dinner?” “Would you like a cup of tea?” It was strange to be inside myself, walking steadily and rigidly past the fence, putting my feet down strongly but without haste that they might have noticed, to be inside and know that they were looking at me; I was hiding very far inside but I could hear them and see them still from one corner of my eye. I wished they were all lying there dead on the ground. “Down in the boneyard ten feet deep.” “Merricat!” Once when I was going past, the Harris boys’ mother came out onto the porch, perhaps to see what they were all yelling so about. She stood there for a minute watching and listening and I stopped and looked at her, looking into her flat dull eyes and knowing I must not speak to her and knowing I would. “Can’t you make them stop?” I asked her that day, wondering if there was anything in this woman I could speak to, if she had ever run joyfully over grass, or had watched flowers, or known delight or love. “Can’t you make them stop?” “Kids,” she said, not changing her voice or her look or her air of dull enjoyment, “don’t call the lady names.” “Yes, ma,” one of the boys said soberly. “Don’t go near no fence. Don’t call no lady names.” And I walked on, while they shrieked and shouted and the woman stood on the porch and laughed. Merricat, said Connie, would you like a cup of tea? Oh, no, said Merricat, you’ll poison me. Their tongues will burn, I thought, as though they had eaten fire. Their throats will burn when the words come out, and in their bellies they will feel a torment hotter than a thousand fires.“Goodbye, Merricat,” they called as I went by the end of the fence, “don’t hurry back.” “Goodbye, Merricat, give our love to Connie.” “Goodbye, Merricat,” but I was at the black rock and there was the gate to our path.2 I had to put down the shopping bag to open the lock on the gate; it was a simple padlock and any child could have broken it, but on the gate was a sign saying PRIVATE NO TRESPASSING and no one could go past that. Our father had put up the signs and the gates and the locks when he closed off the path; before, everyone used the path as a short- cut from the village to the highway four-corners where the bus stopped; it saved them perhaps a quarter of a mile to use our path and walk past our front door. Our mother disliked the sight of anyone who wanted to walking past our front door, and when our father brought her to live in the Blackwood house, one of the first things he had to do was close off the path and fence in the entire Blackwood property, from the highway to the creek. There was another gate at the other end of the path, although I rarely went that way, and that gate too had a padlock and a sign saying PRIVATE NO TRESPASSING. “The highway’s built for common people,” our mother said, “and my front door is private.” Anyone who came to see us, properly invited, came up the main drive which led straight from the gateposts on the highway up to our front door. When I was small I used to lie in my bedroom at the back of the house and imagine the driveway and the path as a crossroad meeting before our front door, and up and down the driveway went the good people, the clean and rich ones dressed in satin and lace, who came rightfully to visit, and back and forth along the path, sneaking and weaving and sidestepping servilely, went the people from the village. They can’t get in, I used to tell myself over and over, lying in my dark room with the trees patterned in shadow on the ceiling, they can’t ever get in any more; the path is closed forever. Sometimes I stood inside the fence, hidden by the bushes, and watched people walking on the highway to get from the village to the four corners. As far as I knew, no one from the village had ever tried to use the path since our father locked the gates. When I had moved the shopping bag inside, I carefully locked the gate again, and tested the padlock to make sure it held. Once the padlock was securely fastened behind me I was safe. The path was dark, because once our father had given up any idea of putting his land to profitable use he had let the trees and bushes and small flowers grow as they chose, and except for one great meadow and the gardensour land was heavily wooded, and no one knew its secret ways but me. When I went along the path, going easily now because I was home, I knew each step and every turn. Constance could put names to all the growing things, but I was content to know them by their way and place of growing, and their unfailing offers of refuge. The only prints on the path were my own, going in and out to the village. Past the turn I might find a mark of Constance’s foot, because she sometimes came that far to wait for me, but most of Constance’s prints were in the garden and in the house. Today she had come to the end of the garden, and I saw her as soon as I came around the turn; she was standing with the house behind her, in the sunlight, and I ran to meet her. “Merricat,” she said, smiling at me, “look how far I came today.” “It’s too far,” I said. “First thing I know you’ll be following me into the village.” “I might, at that,” she said. Even though I knew she was teasing me I was chilled, but I laughed. “You wouldn’t like it much,” I told her. “Here, lazy, take some of these packages. Where’s my cat?” “He went off chasing butterflies because you were late. Did you remember eggs? I forgot to tell you.” “Of course. Let’s have lunch on the lawn.” When I was small I thought Constance was a fairy princess. I used to try to draw her picture, with long golden hair and eyes as blue as the crayon could make them, and a bright pink spot on either cheek; the pictures always surprised me, because she did look like that; even at the worst time she was pink and white and golden, and nothing had ever seemed to dim the brightness of her. She was the most precious person in my world, always. I followed her across the soft grass, past the flowers she tended, into our house, and Jonas, my cat, came out of the flowers and followed me. Constance waited inside the tall front door while I came up the steps behind her, and then I put my packages down on the table in the hall and locked the door. We would not use it again until afternoon, because almost all of our life was lived toward the back of the house, on the lawn and the garden where no one else ever came. We left the front of the house turned toward the highway and the village, and went our own ways behind its stern, unwelcoming face. Although we kept the house well, the rooms we used together were the back ones, the kitchen and the back bedrooms and the little warm room off the kitchen where Uncle Julian lived; outside was Constance’s chestnuttree and the wide, lovely reach of lawn and Constance’s flowers and then, beyond, the vegetable garden Constance tended and, past that, the trees which shaded the creek. When we sat on the back lawn no one could see us from anywhere. I remembered that I was to be kinder to Uncle Julian when I saw him sitting at his great old desk in the kitchen corner playing with his papers. “Will you let Uncle Julian have peanut brittle?” I asked Constance. “After his lunch,” Constance said. She took the groceries carefully from the bags; food of any kind was precious to Constance, and she always touched foodstuffs with quiet respect. I was not allowed to help; I was not allowed to prepare food, nor was I allowed to gather mushrooms, although I sometimes carried vegetables in from the garden, or apples from the old trees. “We’ll have muffins,” Constance said, almost singing because she was sorting and putting away the food. “Uncle Julian will have an egg, done soft and buttery, and a muffin and a little pudding.” “Pap,” said Uncle Julian. “Merricat will have something lean and rich and salty.” “Jonas will catch me a mouse,” I said to my cat on my knee. “I’m always so happy when you come home from the village,” Constance said; she stopped to look and smile at me. “Partly because you bring home food, of course. But partly because I miss you.” “I’m always happy to get home from the village,” I told her. “Was it very bad?” She touched my cheek quickly with one finger. “You don’t want to know about it.” “Someday I’ll go.” It was the second time she had spoken of going outside, and I was chilled. “Constance,” Uncle Julian said. He lifted a small scrap of paper from his desk and studied it, frowning. “I do not seem to have any information on whether your father took his cigar in the garden as usual that morning.” “I’m sure he did,” Constance said. “That cat’s been fishing in the creek,” she told me. “He came in all mud.” She folded the grocery bag and put it with the others in the drawer, and set the library books on the shelf where they were going to stay forever. Jonas and I were expected to stay in our corner, out of the way, while Constance worked in the kitchen, and it was a joy to watch her, moving beautifully in the sunlight, touching foods so softly. “It’s Helen Clarke’s day,” I said. “Are you frightened?”She turned to smile at me. “Not a bit,” she said. “I’m getting better all the time, I think. And today I’m going to make little rum cakes.” “And Helen Clarke will scream and gobble them.” Even now, Constance and I still saw some small society, visiting acquaintances who drove up the driveway to call. Helen Clarke took her tea with us on Fridays, and Mrs. Shepherd or Mrs. Rice or old Mrs. Crowley stopped by occasionally on a Sunday after church to tell us we would have enjoyed the sermon. They came dutifully, although we never returned their calls, and stayed a proper few minutes and sometimes brought flowers from their gardens, or books, or a song that Constance might care to try over on her harp; they spoke politely and with little runs of laughter, and never failed to invite us to their houses although they knew we would never come. They were civil to Uncle Julian, and patient with his talk, they offered to take us for drives in their cars, they referred to themselves as our friends. Constance and I always spoke well of them to each other, because they believed that their visits brought us pleasure. They never walked on the path. If Constance offered them a cutting from a rosebush, or invited them to see a happy new arrangement of colors, they went into the garden, but they never offered to step beyond their defined areas; they walked along the garden and got into their cars by the front door and drove away down the driveway and out through the big gates. Several times Mr. and Mrs. Carrington had come to see how we were getting along, because Mr. Carrington had been a very good friend of our father’s. They never came inside or took any refreshment, but they drove to the front steps and sat in their car and talked for a few minutes. “How are you getting along?” they always asked, looking from Constance to me and back; “how are you managing all by yourselves? Is there anything you need, anything we can do? How are you getting along?” Constance always invited them in, because we had been brought up to believe that it was discourteous to keep guests talking outside, but the Carringtons never came into the house. “I wonder,” I said, thinking about them, “whether the Carringtons would bring me a horse if I asked them. I could ride it in the long meadow.” Constance turned and looked at me for a minute, frowning a little. “You will not ask them,” she said at last. “We do not ask from anyone. Remember that.” “I was teasing,” I said, and she smiled again. “I really only want a winged horse, anyway. We could fly you to the moon and back, my horse and I.”“I remember when you used to want a griffin,” she said. “Now, Miss Idleness, run out and set the table.” “They quarrelled hatefully that last night,” Uncle Julian said. “I won’t have it,’ she said,",
      "density_breakdown": {
        "Metaphor": 2.3086485526549456,
        "Simile": 2.3086485526549456,
        "Imagery": 9.234594210619782,
        "Symbolism": 7.813887408985971,
        "Dialogue": 0.0,
        "Foreshadowing": 10.655301012253597,
        "Juxtaposition": 14.029479666133902,
        "Repetition": 12.60877286450009,
        "TOTAL_DENSITY": 58.959332267803234
      }
    },
    "rising_action": {
      "chapter_range": "3-7",
      "narrative_primary": 5,
      "optimized_primary": 4,
      "device_density_score": 59.325044404973355,
      "improvement_percent": 15.591461953081302,
      "optimization_applied": true,
      "chapter_text": "them and although I deserve to die—we all do, do we not? —I hardly think that my niece is the one to point it out.” “She told the police that it was all her fault.” “Now there,” Uncle Julian said, “I think she made a mistake. It was certainly true that she thought at first that her cooking had caused all this, but in taking full blame I think that she was over-eager. I would have advised her against any such attitude had I been consulted; it smacks of self-pity.”“But the great, the unanswered question, is why ? Why did she do it? I mean, unless we agree that Constance was a homicidal maniac—” “You have met her, madam.” “I have what? Oh, my goodness yes. I completely forgot. I cannot seem to remember that that pretty young girl is actually—well. Your mass murderer must have a reason, Mr. Blackwood, even if it is only some perverted, twisted—oh, dear. She is such a charming girl, your niece; I cannot remember when I have taken to anyone as I have to her. But if she is a homicidal maniac—” “I’m leaving.” Helen Clarke stood up and slammed her pocketbook emphatically under her arm. “Lucille,” she said, “I am leaving. We have overstayed all limits of decency; it’s after five o’clock.” Mrs. Wright scurried out of the dining room, distraught. “I’m so sorry,” she said. “We were chatting and I lost track of time. Oh, dear.” She ran to her chair to gather up her pocketbook. “You haven’t even touched your tea,” I said, wanting to see her blush. “Thank you,” she said; she looked down at her teacup and blushed. “It was delicious.” Uncle Julian stopped his wheel chair in the center of the room and folded his hands happily before him. He looked at Constance and then raised his eyes to gaze on a corner of the ceiling, sober and demure. “Julian, goodbye,” Helen Clarke said shortly. “Constance, I’m sorry we stayed so long; it was inexcusable. Lucille?” Mrs. Wright looked like a child who knows it is going to be punished, but she had not forgotten her manners. “Thank you,” she said to Constance, putting her hand out and then taking it back again quickly. “I had a very nice time. Goodbye,” she said to Uncle Julian. They went into the hall and I followed, to lock the door after they had gone. Helen Clarke started the car before poor Mrs. Wright had quite finished getting herself inside, and the last I heard of Mrs. Wright was a little shriek as the car started down the driveway. I was laughing when I came back into the drawing room, and I went over and kissed Constance. “A very nice tea party,” I said. “That impossible woman.” Constance put her head back against the couch and laughed. “Ill bred, pretentious, stupid. Why she keeps coming I’ll never know.” “She wants to reform you.” I took up Mrs. Wright’s teacup and her rum cake and brought them over to the tea tray. “Poor little Mrs. Wright,” I said.“You were teasing her, Merricat.” “A little bit, maybe. I can’t help it when people are frightened; I always want to frighten them more.” “Constance?” Uncle Julian turned his wheel chair to face her. “How was I?” “Superb, Uncle Julian.” Constance stood up and went over to him and touched his old head lightly. “You didn’t need your notes at all.” “It really happened?” he asked her. “It certainly did. I’ll take you in to your room and you can look at your newspaper clippings.” “I think not right now. It has been a superlative afternoon, but I think I am a little tired. I will rest till dinner.” Constance pushed the wheel chair down the hall and I followed with the tea tray. I was allowed to carry dirty dishes but not to wash them, so I set the tray on the kitchen table and watched while Constance stacked the dishes by the sink to wash later, swept up the broken milk pitcher on the floor, and took out the potatoes to start for dinner. Finally I had to ask her; the thought had been chilling me all afternoon. “Are you going to do what she said?” I asked her. “What Helen Clarke said?” She did not pretend not to understand. She stood there looking down at her hands working, and smiled a little. “I don’t know,” she said.3 A change was coming, and nobody knew it but me. Constance suspected, perhaps; I noticed that she stood occasionally in her garden and looked not down at the plants she was tending, and not back at our house, but outward, toward the trees which hid the fence, and sometimes she looked long and curiously down the length of the driveway, as though wondering how it would feel to walk along it to the gates. I watched her. On Saturday morning, after Helen Clarke had come to tea, Constance looked at the driveway three times. Uncle Julian was not well on Saturday morning, after tiring himself at tea, and stayed in his bed in his warm room next to the kitchen, looking out of the window beside his pillow, calling now and then to make Constance notice him. Even Jonas was fretful—he was running up a storm, our mother used to say—and could not sleep quietly; all during those days when the change was coming Jonas stayed restless. From a deep sleep he would start suddenly, lifting his head as though listening, and then, on his feet and moving in one quick ripple, he ran up the stairs and across the beds and around through the doors in and out and then down the stairs and across the hall and over the chair in the dining room and around the table and through the kitchen and out into the garden where he would slow, sauntering, and then pause to lick a paw and flick an ear and take a look at the day. At night we could hear him running, feel him cross our feet as we lay in bed, running up a storm. All the omens spoke of change. I woke up on Saturday morning and thought I heard them calling me; they want me to get up, I thought before I came fully awake and remembered that they were dead; Constance never called me to wake up. When I dressed and came downstairs that morning she was waiting to make my breakfast, and I told her, “I thought I heard them calling me this morning.” “Hurry with your breakfast,” she said. “It’s another lovely day.” After breakfast on the good mornings when I did not have to go into the village I had my work to do. Always on Wednesday mornings I went around the fence. It was necessary for me to check constantly to be sure that the wires were not broken and the gates were securely locked. I could make the repairs myself, winding the wire back together where it had torn, tightening loose strands, and it was a pleasure to know, every Wednesday morning, that we were safe for another week.On Sunday mornings I examined my safeguards, the box of silver dollars I had buried by the creek, and the doll buried in the long field, and the book nailed to the tree in the pine woods; so long as they were where I had put them nothing could get in to harm us. I had always buried things, even when I was small; I remember that once I quartered the long field and buried something in each quarter to make the grass grow higher as I grew taller, so I would always be able to hide there. I once buried six blue marbles in the creek bed to make the river beyond run dry. “Here is treasure for you to bury,” Constance used to say to me when I was small, giving me a penny, or a bright ribbon; I had buried all my baby teeth as they came out one by one and perhaps someday they would grow as dragons. All our land was enriched with my treasures buried in it, thickly inhabited just below the surface with my marbles and my teeth and my colored stones, all perhaps turned to jewels by now, held together under the ground in a powerful taut web which never loosened, but held fast to guard us. On Tuesdays and Fridays I went into the village, and on Thursday, which was my most powerful day, I went into the big attic and dressed in their clothes. Mondays we neatened the house, Constance and I, going into every room with mops and dustcloths, carefully setting the little things back after we had dusted, never altering the perfect line of our mother’s tortoise-shell comb. Every spring we washed and polished the house for another year, but on Mondays we neatened; very little dust fell in their rooms, but even that little could not be permitted to stay. Sometimes Constance tried to neaten Uncle Julian’s room, but Uncle Julian disliked being disturbed and kept his things in their own places, and Constance had to be content with washing his medicine glasses and changing his bed. I was not allowed in Uncle Julian’s room. On Saturday mornings I helped Constance. I was not allowed to handle knives, but when she worked in the garden I cared for her tools, keeping them bright and clean, and I carried great baskets of flowers, sometimes, or vegetables which Constance picked to make into food. The entire cellar of our house was filled with food. All the Blackwood women had made food and had taken pride in adding to the great supply of food in our cellar. There were jars of jam made by great- grandmothers, with labels in thin pale writing, almost unreadable by now, and pickles made by great-aunts and vegetables put up by our grandmother, and even our mother had left behind her six jars of apple jelly. Constance had worked all her life at adding to the food in thecellar, and her rows and rows of jars were easily the handsomest, and shone among the others. “You bury food the way I bury treasure,” I told her sometimes, and she answered me once: “The food comes from the ground and can’t be permitted to stay there and rot; some thing has to be done with it.” All the Blackwood women had taken the food that came from the ground and preserved it, and the deeply colored rows of jellies and pickles and bottled vegetables and fruit, maroon and amber and dark rich green, stood side by side in our cellar and would stand there forever, a poem by the Blackwood women. Each year Constance and Uncle Julian and I had jam or preserve or pickle that Constance had made, but we never touched what belonged to the others; Constance said it would kill us if we ate it. This Saturday morning I had apricot jam on my toast, and I thought of Constance making it and putting it away carefully for me to eat on some bright morning, never dreaming that a change would be coming before the jar was finished. “Lazy Merricat,” Constance said to me, “stop dreaming over your toast; I want you in the garden on this lovely day.” She was arranging Uncle Julian’s tray, putting his hot milk into a jug painted with yellow daisies, and trimming his toast so it would be tiny and hot and square; if anything looked large, or difficult to eat, Uncle Julian would leave it on the plate. Constance always took Uncle Julian’s tray in to him in the morning because he slept painfully and sometimes lay awake in the darkness waiting for the first light and the comfort of Constance with his tray. Some nights, when his heart hurt him badly, he might take one more pill than usual, and then lie all morning drowsy and dull, unwilling to sip from his hot milk, but wanting to know that Constance was busy in the kitchen next door to his bedroom, or in the garden where he could see her from his pillow. On his very good mornings she brought him into the kitchen for his breakfast, and he would sit at his old desk in the corner, spilling crumbs among his notes, studying his papers while he ate. “If I am spared,” he always said to Constance, “I will write the book myself. If not, see that my notes are entrusted to some worthy cynic who will not be too concerned with the truth.” I wanted to be kinder to Uncle Julian, so this morning I hoped he would enjoy his breakfast and later come out into the garden in his wheel chair and sit in the sun. “Maybe there will be a tulip open today,” I said, looking out through the open kitchen door into the bright sunlight.“Not until tomorrow, I think,” said Constance, who always knew. “Wear your boots if you wander today; it will still be quite wet in the woods.” “There’s a change coming,” I said. “It’s spring, silly,” she said, and took up Uncle Julian’s tray. “Don’t run off while I’m gone; there’s work to be done.” She opened Uncle Julian’s door and I heard her say good morning to him. When he said good morning back his voice was old and I knew that he was not well. Constance would have to stay near him all day. “Is your father home yet, child?” he asked her. “No, not today,” Constance said. “Let me get your other pillow. It’s a lovely day.” “He’s a busy man,” Uncle Julian said. “Bring me a pencil, my dear; I want to make a note of that. He’s a very busy man.” “Take some hot milk; it will make you warm.” “You’re not Dorothy. You’re my niece Constance.” “Drink.” “Good morning, Constance.” “Good morning, Uncle Julian.” I decided that I would choose three powerful words, words of strong protection, and so long as these great words were never spoken aloud no change would come. I wrote the first word— melody —in the apricot jam on my toast with the handle of a spoon and then put the toast in my mouth and ate it very quickly. I was one-third safe. Constance came out of Uncle Julian’s room carrying the tray. “He’s not well this morning,” she said. “He left most of his breakfast and he’s very tired.” “If I had a winged horse I could fly him to the moon; he would be more comfortable there.” “Later I’ll take him out into the sunshine, and perhaps make him a little eggnog.” “Everything’s safe on the moon.” She looked at me distantly. “Dandelion greens,” she said. “And radishes. I thought of working in the vegetable garden this morning, but I don’t want to leave Uncle Julian. I hope that the carrots . . .” She tapped her fingers on the table, thinking. “Rhubarb,” she said. I carried my breakfast dishes over to the sink and set them down; I was deciding on my second magic word, which I thought might very well be Gloucester. It was strong, and I thought it would do, although Uncle Julian might take it into his head to say almost anything and noword was truly safe when Uncle Julian was talking. “Why not make a pie for Uncle Julian?” Constance smiled. “You mean, why not make a pie for Merricat? Shall I make a rhubarb pie?” “Jonas and I dislike rhubarb.” “But it has the prettiest colors of all; nothing is so pretty on the shelves as rhubarb jam.” “Make it for the shelves, then. Make me a dandelion pie.” “Silly Merricat,” Constance said. She was wearing her blue dress, the sunlight was patterned on the kitchen floor, and color was beginning to show in the garden outside. Jonas sat on the step, washing, and Constance began to sing as she turned to wash the dishes. I was two- thirds safe, with only one magic word to find. Later Uncle Julian still slept and Constance thought to take five minutes and run down to the vegetable garden to gather what she could; I sat at the kitchen table listening for Uncle Julian so I could call Constance if he awakened, but when she came back he was still quiet. I ate tiny sweet raw carrots while Constance washed the vegetables and put them away. “We will have a spring salad,” she said. “We eat the year away. We eat the spring and the summer and the fall. We wait for something to grow and then we eat it.” “Silly Merricat,” Constance said. At twenty minutes after eleven by the kitchen clock she took off her apron, glanced in at Uncle Julian, and went, as she always did, upstairs to her room to wait until I called her. I went to the front door and unlocked it and opened it just as the doctor’s car turned into the drive. He was in a hurry, always, and he stopped his car quickly and ran up the steps; “Good morning, Miss Blackwood,” he said, going past me and down the hall, and by the time he had reached the kitchen he had his coat off and was ready to put it over the back of one of the kitchen chairs. He went directly to Uncle Julian’s room without a glance at me or at the kitchen, and then when he opened Uncle Julian’s door he was suddenly still, and gentle. “Good morning, Mr. Blackwood,” he said, his voice easy, “how are things today?” “Where’s the old fool?” Uncle Julian said, as he always did. “Why didn’t Jack Mason come?” Dr. Mason was the one Constance called the night they all died. “Dr. Mason couldn’t make it today,” the doctor said, as he always did. “I’m Dr. Levy. I’ve come to see you instead.” “Rather have Jack Mason.”“I’ll do the best I can.” “Always said I’d outlive the old fool.” Uncle Julian laughed thinly. “Why are you pretending with me? Jack Mason died three years ago.” “Mr. Blackwood,” the doctor said, “it is a pleasure to have you as a patient.” He closed the door very quietly. I thought of using digitalis as my third magic word, but it was too easy for someone to say, and at last I decided on Pegasus. I took a glass from the cabinet, and said the word very distinctly into the glass, then filled it with water and drank. Uncle Julian’s door opened, and the doctor stood in the doorway for a minute. “Remember, now,” he said. “And I’ll see you next Saturday.” “Quack,” Uncle Julian said. The doctor turned, smiling, and then the smile disappeared and he began to hurry again. He took up his coat and went off down the hall. I followed him and by the time I came to the front door he was already going down the steps. “Goodbye, Miss Blackwood,” he said, not looking around, and got into his car and started at once, going faster and faster until he reached the gates and turned onto the highway. I locked the front door and went to the foot of the stairs. “Constance?” I called. “Coming,” she said from upstairs. “Coming, Merricat.” Uncle Julian was better later in the day, and sat out in the warm afternoon sun, hands folded in his lap, half-dreaming. I lay near him on the marble bench our mother had liked to sit on, and Constance knelt in the dirt, both hands buried as though she were growing, kneading the dirt and turning it, touching the plants on their roots. “It was a fine morning,” Uncle Julian said, his voice going on and on, “a fine bright morning, and none of them knew it was their last. She was downstairs first, my niece Constance. I woke up and heard her moving in the kitchen—I slept upstairs then, I could still go upstairs, and I slept with my wife in our room—and I thought, this is a fine morning, never dreaming then that it was their last. Then I heard my nephew—no, it was my brother; my brother came downstairs first after Constance. I heard him whistling. Constance?” “Yes?” “What was the tune my brother used to whistle, and always off-key?” Constance thought, her hands in the ground, and hummed softly, and I shivered. “Of course. I never had a head for music; I could remember what people looked like and what they said and what they did but I could never remember what they sang. It was my brother who camedownstairs after Constance, never caring of course if he woke people with his noise and his whistling, never thinking that perhaps I might still be asleep, although as it happened I was already awake.” Uncle Julian sighed, and lifted his head to look curiously, once, around the garden. “He never knew it was his last morning on earth. He might have been quieter, I think, if he did know. I heard him in the kitchen with Constance and I said to my wife—she was awake, too; his noise had awakened her—I said to my wife, you had better get dressed; we live here with my brother and his wife, after all, and we must remember to show them that we are friendly and eager to help out wherever we can; dress and go down to Constance in the kitchen. She did as she was told; our wives always did as they were told, although my sister-in-law lay in bed late that morning; perhaps she had a premonition and wanted to take her earthly rest while she could. I heard them all. I heard the boy go downstairs. I thought of dressing; Constance?” “Yes, Uncle Julian?” “I could still dress myself in those days, you know, although that was the last day. I could still walk around by myself, and dress myself, and feed myself, and I had no pain. I slept well in those days as a strong man should. I was not young, but I was strong and I slept well and I could still dress myself.” “Would you like a rug over your knees?” “No, my dear, I thank you. You have been a good niece to me, although there are some grounds for supposing you an undutiful daughter. My sister-in-law came downstairs before I did. We had pancakes for breakfast, tiny thin hot pancakes, and my brother had two fried eggs and my wife—although I did not encourage her to eat heavily, since we were living with my brother—took largely of sausage. Homemade sausage, made by Constance. Constance?” “Yes, Uncle Julian?” “I think if I had known it was her last breakfast I would have permitted her more sausage. I am surprised, now I think of it, that no one suspected it was their last morning; they might not have grudged my wife more sausage then. My brother sometimes remarked upon what we ate, my wife and I; he was a just man, and never stinted his food, so long as we did not take too much. He watched my wife take sausage that morning, Constance. I saw him watching her. We took little enough from him, Constance. He had pancakes and fried eggs and sausage but I felt that he was going to speak to my wife; the boyate hugely. I am pleased that the breakfast was particularly good that day.” “I could make you sausage next week, Uncle Julian; I think homemade sausage would not disagree with you if you had very little.” “My brother never grudged our food if we did not take too much. My wife helped to wash the dishes.” “I was very grateful to her.” “She might have done more, I think now. She entertained my sister- in-law, and she saw to our clothes, and she helped with the dishes in the mornings, but I believe that my brother thought that she might have done more. He went off after breakfast to see a man on business.” “He wanted an arbor built; it was his plan to start a grape arbor.” “I am sorry about that; we might now be eating jam from our own grapes. I was always better able to chat after he was gone; I recall that I entertained the ladies that morning, and we sat here in the garden. We talked about music; my wife was quite musical although she had never learned to play. My sister-in-law had a delicate touch; it was always said of her that she had a delicate touch, and she played in the evenings usually. Not that evening, of course. She was not able to play that evening. In the morning we thought she would play in the evening as usual. Do you recall that I was very entertaining in the garden that morning, Constance?” “I was weeding the vegetables,” Constance said. “I could hear you all laughing.” “I was quite entertaining; I am happy for that now.” He was quiet for a minute, folding and refolding his hands. I wanted to be kinder to him, but I could not fold his hands for him, and there was nothing I could bring him, so I lay still and listened to him talk. Constance frowned, staring at a leaf, and the shadows moved softly across the lawn. “The boy was off somewhere,” Uncle Julian said at last in his sad old voice. “The boy had gone off somewhere—was he fishing, Constance?” “He was climbing the chestnut tree.” “I remember. Of course. I remember all of it very clearly, my dear, and I have it all down in my notes. It was the last morning of all and I would not like to forget. He was climbing the chestnut tree, shouting down to us from very high in the tree, and dropping twigs until my sister-in-law spoke sharply to him. She disliked the twigs falling into her hair, and my wife disliked it too, although she would never have been the first to speak. I think my wife was civil to your mother,Constance. I would hate to think not; we lived in my brother’s house and ate his food. I know my brother was home for lunch.” “We had a rarebit,” Constance said. “I had been working with the vegetables all morning and I had to make something quickly for lunch.” “It was a rarebit we had. I have often wondered why the arsenic was never put into the rarebit. It is an interesting point, and one I shall bring out forcefully in my book. Why was the arsenic not put into the rarebit? They would have lost some hours of life on that last day, but it would all have been over with that much sooner. Constance, if there is one dish you prepare which I strongly dislike, it is a rarebit. I have never cared for rarebit.” “I know, Uncle Julian. I never serve it to you.” “It would have been most suitable for the arsenic. I had a salad instead, I recall. There was an apple pudding for dessert, left over from the night before.” “The sun is going down.” Constance rose and brushed the dirt from her hands. “You’ll be chilly unless I take you indoors.” “It would have been far more suitable in the rarebit, Constance. Odd that the point was never brought out at the time. Arsenic is tasteless, you know, although I swear a rarebit is not. Where am I going?” “You are going indoors. You will rest in your room for an hour until your dinner, and after dinner I will play for you, if you like.” “I cannot afford the time, my dear. I have a thousand details to remember and note down, and not a minute to waste. I would hate to lose any small thing from their last day; my book must be complete. I think, on the whole, it was a pleasant day for all of them, and of course it is much better that they never supposed it was to be their last. I think I am chilly, Constance.” “You will be tucked away in your room in a minute.” I came slowly behind them, unwilling to leave the darkening garden; Jonas came after me, moving toward the light in the house. When Jonas and I came inside Constance was just closing the door to Uncle Julian’s room, and she smiled at me. “He’s practically asleep already,” she said softly. “When I’m as old as Uncle Julian will you take care of me?” I asked her. “If I’m still around,” she said, and I was chilled. I sat in my corner holding Jonas and watched her move quickly and silently around our bright kitchen. In a few minutes she would ask me to set the table forthe three of us in the dining room, and then after dinner it would be night and we would sit warmly together in the kitchen where we were guarded by the house and no one from outside could see so much as a light.4 On Sunday morning the change was one day nearer. I was resolute about not thinking my three magic words and would not let them into my mind, but the air of change was so strong that there was no avoiding it; change lay over the stairs and the kitchen and the garden like fog. I would not forget my magic words; they were MELODY GLOUCESTER PEGASUS, but I refused to let them into my mind. The weather was uneasy on Sunday morning and I thought that perhaps Jonas would succeed after all in running up a storm; the sun shone into the kitchen but there were clouds moving quickly across the sky and a sharp little breeze that came in and out of the kitchen while I had my breakfast. “Wear your boots if you wander today,” Constance told me. “I don’t expect that Uncle Julian will sit outdoors today; it will be far too cool for him.” “Pure spring weather,” Constance said, and smiled out at her garden. “I love you, Constance,” I said. “I love you too, silly Merricat.” “Is Uncle Julian better?” “I don’t think so. He had his tray while you were still asleep, and I thought he seemed very tired. He said he had an extra pill during the night. I think perhaps he is getting worse.” “Are you worried about him?” “Yes. Very.” “Will he die?” “Do you know what he said to me this morning?” Constance turned, leaning against the sink, and looked at me with sadness. “He thought I was Aunt Dorothy, and he held my hand and said, ‘It’s terrible to be old, and just lie here wondering when it will happen.’ He almost frightened me.” “You should have let me take him to the moon,” I said. “I gave him his hot milk and then he remembered who I was.” I thought that Uncle Julian was probably really very happy, with both Constance and Aunt Dorothy to take care of him, and I told myself that long thin things would remind me to be kinder to Uncle Julian; this was to be a day of long thin things, since there had already been a hair in my toothbrush, and a fragment of a string was caught on the side of my chair and I could see a splinter broken off the back step.“Make him a little pudding,” I said. “Perhaps I will.” She took out the long thin slicing knife and set it on the sink. “Or a cup of cocoa. And dumplings with his chicken tonight.” “Do you need me?” “No, my Merricat. Run along, and wear your boots.” The day outside was full of changing light, and Jonas danced in and out of shadows as he followed me. When I ran Jonas ran, and when I stopped and stood still he stopped and glanced at me and then went briskly off in another direction, as though we were not acquainted, and then he sat down and waited for me to run again. We were going to the long field which today looked like an ocean, although I had never seen an ocean; the grass was moving in the breeze and the cloud shadows passed back and forth and the trees in the distance moved. Jonas disappeared into the grass, which was tall enough for me to touch with my hands while I walked, and he made small crooked movements of his own; for a minute the grass would all bend together under the breeze and then there would be a hurrying pattern across it where Jonas was running. I started at one corner and walked diagonally across the long field toward the opposite corner, and in the middle I came directly to the rock covering the spot where the doll was buried; I could always find it although much of my buried treasure was forever lost. The rock was undisturbed and so the doll was safe. I am walking on buried treasure, I thought, with the grass brushing against my hands and nothing around me but the reach of the long field with the grass blowing and the pine woods at the end; behind me was the house, and far off to my left, hidden by trees and almost out of sight, was the wire fence our father had built to keep people out. When I left the long field I went between the four apple trees we called our orchard, and along the path toward the",
      "density_breakdown": {
        "Metaphor": 2.3090586145648313,
        "Simile": 2.3090586145648313,
        "Imagery": 10.479573712255773,
        "Symbolism": 6.571936056838366,
        "Dialogue": 0.0,
        "Foreshadowing": 11.72291296625222,
        "Juxtaposition": 15.452930728241563,
        "Repetition": 10.479573712255773,
        "TOTAL_DENSITY": 59.325044404973355
      }
    },
    "climax": {
      "chapter_range": "8",
      "narrative_primary": 8,
      "optimized_primary": 8,
      "device_density_score": 59.847274018824365,
      "improvement_percent": 0.0,
      "optimization_applied": false,
      "chapter_text": "standing open and I could see the movement of fire inside. Fire burns upward, I thought; it will burn their things in the attic. Charles had left the front door open too, and a line of smoke reached down the stairs and drifted outside. I did not see any need to move quickly or to run shrieking around the house because the fire did not seem to be hurrying itself. I wondered if I could go up the stairs and shut the door to our father’s room and keep the fire inside, belonging entirely to Charles, but when I started up the stairs I saw a finger of flame reach out to touch the hall carpet and some heavy object fell crashing in our father’s room. There would be nothing of Charles in there now; even his pipe must have been consumed. “Uncle Julian is gathering his papers,” Constance said, coming into the hall to stand beside me. She had Uncle Julian’s shawl over her arm. “We will have to go outside,” I said. I knew that she was frightened, so I said, “We can stay on the porch, behind the vines, in the darkness.” “We neatened it just the other day,” she said. “It has no right to burn.” She began to shiver as though she were angry, and I took her by the hand and brought her through the open front door and just as we turned back for another look the lights came into the driveway with the disgusting noise of sirens and we were held in the doorway in the light. Constance put her face against me to hide, and then there was Jim Donell, the first one to leap from the fire engine and run up the steps. “Out of the way,” he said, and pushed past us and into our house. I took Constance along the porch to the corner where the vines grew thick, and she moved into the corner and pressed against the vines. I held her hand tight, and together we watched the great feet of the men stepping across our doorsill, dragging their hoses, bringing filth and confusion and danger into our house. More lights moved into the driveway and up to the steps, and the front of the house was white and pale and uncomfortable at being so clearly visible; it had never been lighted before. The noise was too much for me to hear all together, butsomewhere in the noise was Charles’ voice, still going on and on. “Get the safe in the study,” he said a thousand times. Smoke squeezed out the front door, coming between the big men pushing in. “Constance,” I whispered, “Constance, don’t watch them.” “Can they see me?” she whispered back. “Is anyone looking?” “They’re all watching the fire. Be very quiet.” I looked carefully out between the vines. There was a long row of cars, and the village fire engine, all parked as close to the house as they could get, and everyone in the village was there, looking up and watching. I saw faces laughing, and faces that looked frightened, and then someone called out, very near to us, “What about the women, and the old man? Anyone see them?” “They had plenty of warning,” Charles shouted from somewhere, “they’re all right.” Uncle Julian could manage his chair well enough to get out the back door, I thought, but it did not seem that the fire was going near the kitchen or Uncle Julian’s room; I could see the hoses and hear the men shouting, and they were all on the stairs and in the front bedrooms upstairs. I could not get through the front door, and even if I could leave Constance there was no way to go around to the back door without going down the steps in the light with all of them watching. “Was Uncle Julian frightened?” I whispered to Constance. “I think he was annoyed,” she said. A few minutes later she said, “It will take a great deal of scrubbing to get that hall clean again,” and sighed. I was pleased that she thought of the house and forgot the people outside. “Jonas?” I said to her; “where is he?” I could see her smile a little in the darkness of the vines. “He was annoyed, too,” she said. “He went out the back door when I took Uncle Julian in to get his papers.” We were all right. Uncle Julian might very well forget that there was a fire at all if he became interested in his papers, and Jonas was almost certainly watching from the shadow of the trees. When they had finished putting out Charles’ fire I would take Constance back inside and we could start to clean our house again. Constance was quieter, although more and more cars came down the driveway and the unending patter of feet went back and forth across our doorsill. Except for Jim Donell, who wore a hat proclaiming him “Chief,” it was impossible to identify any one person, any more than it was possible to put a name to any of the faces out in front of our house, looking up andlaughing at the fire. I tried to think clearly. The house was burning; there was fire inside our house, but Jim Donell and the other, anonymous, men in hats and raincoats were curiously able to destroy the fire which was running through the bones of our house. It was Charles’ fire. When I listened particularly for the fire I could hear it, a singing hot noise upstairs, but over and around it, smothering it, were the voices of the men inside and the voices of the people watching outside and the distant sound of cars on the driveway. Next to me Constance was standing quietly, sometimes looking at the men going into the house, but more often covering her eyes with her hands; she was excited, I thought, but not in any danger. Every now and then it was possible to hear one voice raised above the others; Jim Donell shouted some word of instruction, or someone in the crowd called out. “Why not let it burn?” a woman’s voice came loudly, laughing, and “Get the safe out of the study downstairs”; that was Charles, safely in the crowd out front. “Why not let it burn?” the woman called insistently, and one of the dark men going in and out of our front door turned and waved and grinned. “We’re the firemen,” he called back, “we got to put it out.” “Let it burn,” the woman called. Smoke was everywhere, thick and ugly. Sometimes when I looked out the faces of the people were clouded with smoke, and it came out the front door in frightening waves. Once there was a crash from inside the house and voices speaking quickly and urgently, and the faces outside turned up happily in the smoke, mouths open. “Get the safe,” Charles called out wildly, “two or three of you men get the safe out of the study; the whole house is going.” “Let it burn,” the woman called. I was hungry and I wanted my dinner, and I wondered how long they could make the fire last before they put it out and went away and Constance and I could go back inside. One or two of the village boys had edged onto the porch dangerously close to where we stood, but they only looked inside, not at the porch, and tried to stand on their toes and see past the firemen and the hoses. I was tired and I wished it would all be over. I realized then that the light was lessening, the faces on the lawn less distinct, and a new tone came into the noise; the voices inside were surer, less sharp, almost pleased, and the voices outside were lower, and disappointed. “It’s going out,” someone said. “Under control,” another voice added.“Did a lot of damage, though.” There was laughter. “Sure made a mess of the old place.” “Should of burned it down years ago.” “And them in it.” They mean us, I thought, Constance and me. “Say—anybody seen them?” “No such luck. Firemen threw them out.” “Too bad.” The light was almost gone. The people outside stood now in shadows, their faces narrowed and dark, with only the headlights of the cars to light them; I saw the flash of a smile, and somewhere else a hand raised to wave, and the voices went on regretfully. “Just about over.” “Pretty good fire.” Jim Donell came through the front door. Everyone knew him because of his size and his hat saying CHIEF. “Say, Jim,” someone called, “why don’t you let it burn?” He lifted both his hands to make everyone be quiet. “Fire’s all out, folks,” he said. Very carefully he put up his hands and took off his hat saying CHIEF and while everyone watched he walked slowly down the steps and over to the fire engine and set his hat down on the front seat. Then he bent down, searching thoughtfully, and finally, while everyone watched, he took up a rock. In complete silence he turned slowly and then raised his arm and smashed the rock through one of the great tall windows of our mother’s drawing room. A wall of laughter rose and grew behind him and then, first the boys on the steps and then the other men and at last the women and the smaller children, they moved like a wave at our house. “Constance,” I said, “Constance,” but she had her hands over her eyes. The other of the drawing-room windows crashed, this time from inside, and I saw that it had been shattered by the lamp which always stood by Constance’s chair in the drawing room. Above it all, most horrible, was the laughter. I saw one of the Dresden figurines thrown and break against the porch rail, and the other fell unbroken and rolled along the grass. I heard Constance’s harp go over with a musical cry, and a sound which I knew was a chair being smashed against the wall. “Listen,” said Charles from somewhere, “will a couple of you guyshelp me with this safe?” Then, through the laughter, someone began, “Merricat, said Constance, would you like a cup of tea?” It was rhythmic and insistent. I am on the moon, I thought, please let me be on the moon. Then I heard the sound of dishes smashing and at that minute realized that we stood outside the tall windows of the dining room and they were coming very close. “Constance,” I said, “we have to run.” She shook her head, her hands over her face. “They’ll find us in a minute. Please, Constance dearest; run with me.” “I can’t,” she said, and from just inside the dining-room window a shout went up: “Merricat, said Constance, would you like to go to sleep?” and I pulled Constance away a second before the window went; I thought a chair had been thrown through it, perhaps the dining-room chair where our father used to sit and Charles used to sit. “Hurry,” I said, no longer able to be quiet in all that noise, and pulling Constance by the hand I ran toward the steps. As we came into the light she threw Uncle Julian’s shawl across her face to hide it. A little girl ran out of the front door carrying something, and her mother, behind her, caught her by the back of the dress and slapped her hands. “Don’t you put that stuff in your mouth,” the mother screamed, and the little girl dropped a handful of Constance’s spice cookies. “Merricat, said Constance, would you like a cup of tea?” “Merricat, said Constance, would you like to go to sleep?” “Oh, no, said Merricat, you’ll poison me.” We had to get down the steps and into the woods to be safe; it was not far but the headlights of the cars shone across the lawn. I wondered if Constance would slip and fall, running through the light, but we had to get to the woods and there was no other way. We hesitated near the steps, neither one of us quite daring to go farther, but the windows were broken and inside they were throwing our dishes and our glasses and our silverware and even the pots Constance used in cooking; I wondered if my stool in the corner of the kitchen had been smashed yet. While we stood still for a last minute, a car came up the driveway, and another behind it; they swung to a stop in front of the house, sending more light onto the lawn. “What the holy devil is going on here?” Jim Clarke said, rolling out of the first car, and Helen Clarke, on the other side, opened her mouth and stared. Shouting andpushing, and not seeing us at all, Jim Clarke made his way through our door and into our house, “What the holy goddam devil is going on here?” he kept saying and outside Helen Clarke never saw us, but only stared at our house. “Crazy fools,” Jim Clarke yelled inside, “crazy drunken fools.” Dr. Levy came out of the second car and hurried toward the house. “Has everyone gone crazy in here?” Jim Clarke was saying from inside, and there was a shout of laughter. “Would you like a cup of tea?” someone inside screamed, and they laughed. “Ought to bring it down brick by brick,” someone said inside. The doctor came up the steps running, and pushed us aside without looking. “Where is Julian Blackwood?” he asked a woman in the doorway, and the woman said, “Down in the boneyard ten feet deep.” It was time; I took Constance tightly by the hand, and we started carefully down the steps. I would not run yet because I was afraid that Constance might fall, so I brought her slowly down the steps; no one could see us yet except Helen Clarke and she stared at the house. Behind us I heard Jim Clarke shouting; he was trying to make the people leave our house, and before we reached the bottom step there were voices behind us. “There they are,” someone shouted and I think it was Stella. “There they are, there they are, there they are,” and I started to run but Constance stumbled and then they were all around us, pushing and laughing and trying to get close to see. Constance held Uncle Julian’s shawl across her face so they could not look at her, and for a minute we stood very still, pressed together by the feeling of people all around us. “Put them back in the house and start the fire all over again.” “We fixed things up nice for you girls, just like you always wanted it.” “Merricat, said Constance, would you like a cup of tea?” For one terrible minute I thought that they were going to join hands and dance around us, singing. I saw Helen Clarke far away, pressed hard against the side of her car; she was crying and saying something and even though I could not hear her through the noise I knew she was saying “I want to go home, please, I want to go home.” “Merricat, said Constance, would you like to go to sleep?” They were trying not to touch us; whenever I turned they fell back a little; once, between two shoulders I saw Harler of the junk yard wandering across the porch of our house, picking up things and setting them to one side in a pile. I moved a little, holding Constance’s hand tight, and as they fell back we ran suddenly, going toward the trees, but Jim Donell’s wife and Mrs. Mueller came in front of us, laughing andholding out their arms, and we stopped. I turned, and gave Constance a little pull, and we ran, but Stella and the Harris boys crossed in front of us, laughing, and the Harris boys shouting “Down in the boneyard ten feet deep,” and we stopped. Then I turned toward the house, running again with Constance pulled behind me, and Elbert the grocer and his greedy wife were there, holding their hands to halt us, almost dancing together, and we stopped. I went then to the side, and Jim Donell stepped in front of us, and we stopped. “Oh, no, said Merricat, you’ll poison me,” Jim Donell said politely, and they came around us again, circling and keeping carefully out of reach. “Merricat, said Constance, would you like to go to sleep?” Over it all was the laughter, almost drowning the singing and the shouting and the howling of the Harris boys. “Merricat, said Constance, would you like a cup of tea?” Constance held to me with one hand and with the other hand she kept Uncle Julian’s shawl across her face. I saw an opening in the circle around us, and ran again for the trees, but all the Harris boys were there, one on the ground with laughter, and we stopped. I turned again and ran for the house but Stella came forward and we stopped. Constance was stumbling, and I wondered if we were going to fall onto the ground in front of them, lying there where they might step on us in their dancing, and I stood still; I could not possibly let Constance fall in front of them. “That’s all now,” Jim Clarke said from the porch. His voice was not loud, but they all heard. “That’s enough,” he said. There was a small polite silence, and then someone said, “Down in the boneyard ten feet deep,” and the laughter rose. “Listen to me,” Jim Clarke said, raising his voice, “listen to me. Julian Blackwood is dead.” Then they were quiet at last. After a minute Charles Blackwood said from the crowd around us, “Did she kill him?” They went back from us, moving slowly in small steps, withdrawing, until there was a wide clear space around us and Constance standing clearly with Uncle Julian’s shawl across her face. “Did she kill him?” Charles Blackwood asked again. “She did not,” said the doctor, standing in the doorway of our house. “Julian died as I have always known he would; he has been waiting a long time.” “Now go quietly,” Jim Clarke said. He began to take people by the shoulders, pushing a little at their backs, turning them toward theircars and the driveway. “Go quickly,” he said, “There has been a death in this house.” It was so quiet, in spite of many people moving across the grass and going away, that I heard Helen Clarke say, “Poor Julian.” I took a cautious step toward the darkness, pulling Constance a little so that she followed me. “Heart,” the doctor said on the porch, and I went another step. No one turned to look at us. Car doors slammed softly and motors started. I looked back once. A little group was standing around the doctor on the steps. Most of the lights were turned away, heading down the driveway. When I felt the shadows of the trees fall on us, I moved quickly; one last step and we were inside. Pulling Constance, I hurried under the trees, in the darkness; when I felt my feet leave the grass of the lawn and touch the soft mossy ground of the path through the woods and knew that the trees had closed in around us I stopped and put my arms around Constance. “It’s all over,” I told her, and held her tight. “It’s all right,” I said, “all right now.” I knew my way in the darkness or in the light. I thought once how good it was that I had straightened my hiding place and freshened it, so it would now be pleasant for Constance. I would cover her with leaves, like children in a story, and keep her safe and warm. Perhaps I would sing to her or tell her stories; I would bring her bright fruits and berries and water in a leaf cup. Someday we would go to the moon. I found the entrance to my hiding place and led Constance in and took her to the corner where there was a fresh pile of leaves and a blanket. I pushed her gently until she sat down and I took Uncle Julian’s shawl away from her and covered her with it. A little purr came from the corner and I knew that Jonas had been waiting here for me. I put branches across the entrance; even if they came with lights they would not see us. It was not entirely dark; I could see the shadow that was Constance and when I put my head back I saw two or three stars, shining from far away between the leaves and the branches and down onto my head. One of our mother’s Dresden figurines is broken, I thought, and I said aloud to Constance, “I am going to put death in all their food and watch them die.” Constance stirred, and the leaves rustled. “The way you did before?” she asked. It had never been spoken of between us, not once in six years. “Yes,” I said after a minute, “the way I did before.”9 Sometime during the night an ambulance came and took Uncle Julian away, and I wondered if they missed his shawl, which was wound around Constance as she slept. I saw the ambulance lights turning into the driveway, with the small red light on top, and I heard the distant sounds of Uncle Julian’s leaving, the voices speaking gently because they were in the presence of the dead, and the doors opening and closing. They called to us two or three times, perhaps to ask if they might have Uncle Julian, but their voices were subdued and no one came into the woods. I sat by the creek, wishing that I had been kinder to Uncle Julian. Uncle Julian had believed that I was dead, and now he was dead himself; bow your heads to our beloved Mary Katherine, I thought, or you will be dead. The water moved sleepily in the darkness and I wondered what kind of a house we would have now. Perhaps the fire had destroyed everything and we would go back tomorrow and find that the past six years had been burned and they were waiting for us, sitting around the dining-room table waiting for Constance to bring them their dinner. Perhaps we would find ourselves in the Rochester house, or living in the village or on a houseboat on the river or in a tower on top of a hill; perhaps the fire might be persuaded to reverse itself and abandon our house and destroy the village instead; perhaps the villagers were all dead now. Perhaps the village was really a great game board, with the squares neatly marked out, and I had been moved past the square which read “Fire; return to Start,” and was now on the last few squares, with only one move to go to reach home. Jonas’s fur smelled of smoke. Today was Helen Clarke’s day to come to tea, but there would be no tea today, because we would have to neaten the house, although it was not the usual day for neatening the house. I wished that Constance had made sandwiches for us to bring down to the creek, and I wondered if Helen Clarke would try to come to tea even though the house was not ready. I decided that from now on I would not be allowed to hand tea cups. When it first began to get light I heard Constance stirring on the leaves and I went into my hiding place to be near her when she awakened. When she opened her eyes she looked first at the trees above her, and then at me and smiled. “We are on the moon at last,” I told her, and she smiled.“I thought I dreamed it all,” she said. “It really happened,” I said. “Poor Uncle Julian.” “They came in the night and took him away, and we stayed here on the moon.” “I’m glad to be here,” she said. “Thank you for bringing me.” There were leaves in her hair and dirt on her face and Jonas, who had followed me into my hiding place, stared at her in surprise; he had never seen Constance with a dirty face before. For a minute she was quiet, no longer smiling, looking back at Jonas, realizing that she was dirty, and then she said, “Merricat, what are we going to do?” “First we must neaten the house, even though it is not the usual day.” “The house,” she said. “Oh, Merricat.” “I had no dinner last night,” I told her. “Oh, Merricat. ” She sat up and untangled herself quickly from Uncle Julian’s shawl and the leaves; “Oh, Merricat, poor baby,” she said. “We’ll hurry,” and she scrambled to her feet. “First you had better wash your face.” She went to the creek and wet her handkerchief and scrubbed at her face while I shook out Uncle Julian’s shawl and folded it, thinking how strange and backward everything was this morning; I had never touched Uncle Julian’s shawl before. I already saw that the rules were going to be different, but it was odd to be folding Uncle Julian’s shawl. Later, I thought, I would come back here to my hiding place and clean it, and put in fresh leaves. “Merricat, you’ll starve.” “We have to watch,” I said, taking her hand to slow her. “We have to go very quietly and carefully; some of them may still be around waiting.” I went first down the path, walking silently, with Constance and Jonas behind me. Constance could not step as silently as I could, but she made very little sound and of course Jonas made no sound at all. I took the path that would bring us out of the woods at the back of the house, near the vegetable garden, and when I came to the edge of the woods I stopped and held Constance back while we looked carefully to see if there were any of them left. For one first minute we saw only the garden and the kitchen door, looking just as always, and then Constance gasped and said, “Oh, Merricat, ” with a little moan, and I held myself very still, because the top of our house was gone.I remembered that I had stood looking at our house with love yesterday, and I thought how it had always been so tall, reaching up into the trees. Today the house ended above the kitchen doorway in a nightmare of black and twisted wood; I saw part of a window frame still holding broken glass and I thought: that was my window; I looked out that window from my room. There was no one there, and no sound. We moved together very slowly toward the house, trying to understand its ugliness and ruin and shame. I saw that ash had drifted among the vegetable plants; the lettuce would have to be washed before I could eat it, and the tomatoes. No fire had come this way, but everything, the grass and the apple trees and the marble bench in Constance’s garden, had an air of smokiness and everything was dirty. As we came closer to the house we saw more clearly that the fire had not reached the ground floor, but had had to be content with the bedrooms and the attic. Constance hesitated at the kitchen door, but she had opened it a thousand times before and it ought surely to recognize the touch of her hand, so she took the latch and lifted it. The house seemed to shiver when she opened the door, although one more draft could hardly chill it now. Constance had to push at the door to make it open, but no burned timber crashed down, and there was not, as I half thought there might be, a sudden rushing falling together, as a house, seemingly solid but really made only of ash, might dissolve at a touch. “My kitchen,” Constance said. “My kitchen.” She stood in the doorway, looking. I thought that we had somehow not found our way back correctly through the night, that we had somehow lost ourselves and come back through the wrong gap in time, or the wrong door, or the wrong fairy tale. Constance put her hand against the door frame to steady herself, and said again, “My kitchen, Merricat.” “My stool is still there,” I said. The obstacle which made the door hard to open was the kitchen table, turned on its side. I set it upright, and we went inside. Two of the chairs had been smashed, and the floor was horrible with broken dishes and glasses and broken boxes of food and paper torn from the shelves. Jars of jam and syrup and catsup had been shattered against the walls. The sink where Constance washed her dishes was filled with broken glass, as though glass after glass had been broken there methodically, one after another. Drawers of silverware and cooking ware had been pulled out and broken against the table and the walls,and silverware that had been in the house for generations of Blackwood wives was lying bent and scattered on the floor. Tablecloths and napkins hemmed by Blackwood women, and washed and ironed again and again, mended and cherished, had been ripped from the dining-room sideboard and dragged across the kitchen. It seemed that all the wealth and hidden treasure of our house had been found out and torn and soiled; I saw broken plates which had come from the top shelves in the cupboard, and our little sugar bowl with roses lay almost at my feet, handles gone. Constance bent down and picked up a silver spoon. “This was our grandmother’s wedding pattern,” she said, and set the spoon on the table. Then she said, “The preserves,” and turned to the cellar door; it was closed and I hoped that perhaps they had not seen it, or had perhaps not had time to go down the stairs. Constance picked her way carefully across the floor and opened the cellar door and looked down. I thought of the jars and jars so beautifully preserved lying in broken sticky heaps in the cellar, but Constance went down a step or two and said, “No, it’s all right; nothing here’s been touched.” She closed the cellar door again and made her way across to the sink to wash her hands and dry them on a dishtowel from the floor. “First, your breakfast,” she said. Jonas sat on the doorstep in the growing sunlight looking at the kitchen with astonishment; once he raised his eyes to me and I wondered if he thought that Constance and I had made this mess. I saw a cup not broken, and picked it up and set it on the table, and then thought to look for more things which might have escaped. I remembered that one of our mother’s Dresden figurines had rolled safely onto the grass and I wondered if it had hidden successfully and preserved itself; I would look for it later. Nothing was orderly, nothing was planned; it was not like any other day. Once Constance went into the cellar and came back with her arms full. “Vegetable soup,” she said, almost singing, “and strawberry jam, and chicken soup, and pickled beef.” She set the jars on the kitchen table and turned slowly, looking down at the floor. “There,” she said at last, and went to a corner to pick up a small saucepan. Then on a sudden thought she set down the saucepan and made her way into the pantry. “Merricat,” she called with laughter, “they didn’t find the flour in the barrel. Or the salt. Or the potatoes.” They found the sugar, I thought. The floor was gritty, and almost alive under my feet, and I thought of course; of course they would go looking for the sugar and have a lovely time; perhaps they had thrownhandfuls of sugar at one another, screaming, “Blackwood sugar, Blackwood sugar, want a taste?” “They got to the pantry shelves,” Constance went on, “the cereals and the spices and the canned food.” I walked slowly around the kitchen, looking at the floor. I thought that they had probably tumbled things by the armload, because cans of food were scattered and bent as though they had been tossed into the air, and the boxes of cereal and tea and crackers had been trampled under foot and broken open. The tins of spices were all together, thrown into a corner unopened; I thought I could still smell the faint spicy scent of Constance’s cookies and then saw some of them, crushed on the floor. Constance came out of the pantry carrying a loaf of bread. “Look what they didn’t find,” she said, “and there are eggs and milk and butter in the cooler.” Since they had not found the cellar door they had not found the cooler just inside, and I was pleased that they had not discovered eggs to mix into the mess on the floor. At one time I found three unbroken chairs and set them where they belonged around the table. Jonas sat in my corner, on my stool, watching us. I drank chicken soup from a cup without a handle, and Constance washed a knife to spread butter on the bread. Although I did",
      "density_breakdown": {
        "Metaphor": 2.131060202450719,
        "Simile": 1.9534718522464927,
        "Imagery": 14.56224471674658,
        "Symbolism": 6.038003906943704,
        "Dialogue": 0.0,
        "Foreshadowing": 7.4587107085775175,
        "Juxtaposition": 14.207068016338129,
        "Repetition": 13.496714615521222,
        "TOTAL_DENSITY": 59.847274018824365
      }
    },
    "falling_action": {
      "chapter_range": "9",
      "narrative_primary": 9,
      "optimized_primary": 9,
      "device_density_score": 57.716213816373646,
      "improvement_percent": 0.0,
      "optimization_applied": false,
      "chapter_text": "not perceive it then, time and the orderly pattern of our old days had ended; I do not know when I found the three chairs and when I ate buttered bread, whether I had found the chairs and then eaten bread, or whether I had eaten first, or even done both at once. Once Constance turned suddenly and put down her knife; she started for the closed door to Uncle Julian’s room and then turned back, smiling a little. “I thought I heard him waking,” she said, and sat down again. We had not yet been out of the kitchen. We still did not know how much house was left to us, or what we might find waiting beyond the closed doors into the dining room and the hall. We sat quietly in the kitchen, grateful for the chairs and the chicken soup and the sunlight coming through the doorway, not yet ready to go further. “What will they do with Uncle Julian?” I asked. “They will have a funeral,” Constance said with sadness. “Do you remember the others?” “I was in the orphanage.” “They let me go to the funerals of the others. I can remember. They will have a funeral for Uncle Julian, and the Clarkes will go, and the Carringtons, and certainly little Mrs. Wright. They will tell each otherhow sorry they are. They will look to see if we are there.” I felt them looking to see if we were there, and I shivered. “They will bury him with the others.” “I would like to bury something for Uncle Julian,” I said. Constance was quiet, looking at her fingers which lay still and long on the table. “Uncle Julian is gone, and the others,” she said. “Most of our house is gone, Merricat; we are all that is left.” “Jonas.” “Jonas. We are going to lock ourselves in more securely than ever.” “But today is the day Helen Clarke comes to tea.” “No,” she said. “Not again. Not here.” As long as we sat quietly together in the kitchen it was possible to postpone seeing the rest of the house. The library books were still on their shelf, untouched, and I supposed that no one had wanted to touch books belonging to the library; there was a fine, after all, for destroying library property. Constance, who was always dancing, seemed now unwilling to move; she sat on at the kitchen table with her hands spread before her, not looking around at the destruction, and almost dreaming, as though she never believed that she had wakened this morning at all. “We must neaten the house,” I said to her uneasily, and she smiled across at me. When I felt that I could not wait for her any longer I said, “I’m going to look,” and got up and went to the dining-room door. She watched me, not moving. When I opened the door to the dining room there was a shocking smell of wetness and burned wood and destruction, and glass from the tall windows lay across the floor and the silver tea service had been swept off the sideboard and stamped into grotesque, unrecognizable shapes. Chairs were broken here, too; I remembered that they had taken up chairs and hurled them at windows and walls. I went through the dining room and into the front hall. The front door stood wide open and early sunlight lay in patterns along the floor of the hall, touching broken glass and torn cloth; after a minute I recognized the cloth as the drawing-room draperies which our mother had once had made up fourteen feet long. No one was outside; I stood in the open doorway and saw that the lawn was marked with the tires of cars and the feet which had danced, and where the hoses had gone there were puddles and mud. The front porch was littered, and I remembered the neat pile of partly broken furniture which Harler the junk dealer had set together last night. I wondered if he planned to come today with a truck and gather up everything he could, or if he hadonly put the pile together because he loved great piles of broken things and could not resist stacking junk wherever he found it. I waited in the doorway to be sure that no one was watching, and then I ran down the steps across the grass and found our mother’s Dresden figurine unbroken where it had hidden against the roots of a bush; I thought to take it to Constance. She was still sitting quietly at the kitchen table, and when I put the Dresden figurine down before her she looked for a minute and then took it in her hands and held it against her cheek. “It was all my fault,” she said. “Somehow it was all my fault.” “I love you, Constance,” I said. “And I love you, Merricat.” “And will you make that little cake for Jonas and me? Pink frosting, with gold leaves around the edge?” She shook her head, and for a minute I thought she was not going to answer me, and then she took a deep breath, and stood up. “First,” she said, “I’m going to clean this kitchen.” “What are you going to do with that?” I asked her, touching the Dresden figurine with the very tip of my finger. “Put it back where it belongs,” she said, and I followed her as she opened the door to the hall and made her way down the hall to the drawing-room doorway. The hall was less littered than the rooms, because there had been less in it to smash, but there were fragments carried from the kitchen, and we stepped on spoons and dishes which had been thrown here. I was shocked when we came into the drawing room to see our mother’s portrait looking down on us graciously while her drawing room lay destroyed around her. The white wedding-cake trim was blackened with smoke and soot and would never be clean again; I disliked seeing the drawing room even more than the kitchen or the dining room, because we had always kept it so tidy, and our mother had loved this room. I wondered which of them had pushed over Constance’s harp and I remembered that I had heard it cry out as it fell. The rose brocade on the chairs was torn and dirty, smudged with the marks of wet feet that had kicked at the chairs and stamped on the sofa. The windows were broken here too, and with the drapes torn down we were clearly visible from outside. “I think I can close the shutters,” I said, as Constance hesitated in the doorway, unwilling to come further into the room. I stepped out onto the porch through the broken window, thinking that no one had ever come this way before, and found that I could unhook the shutterseasily. The shutters were as tall as the windows; originally it was intended that a man with a ladder would close the shutters when the summers were ended and the family went away to a city house, but so many years had passed since the shutters were closed that the hooks had rusted and I needed only to shake the heavy shutters to pull the hooks away from the house. I swung the shutters closed, but I could only reach the lower bolt to hold them; there were two more bolts high above my head; perhaps some night I might come out here with a ladder, but the lower bolt would have to hold them now. After I had closed the shutters on both tall drawing-room windows I went along the porch and in, formally, through the front door and into the drawing room where Constance stood in dimness now, without the sunlight. Constance went to the mantel and set the Dresden figurine in its place below the portrait of our mother and for one quick minute the great shadowy room came back together again, as it should be, and then fell apart forever. We had to walk carefully because of the broken things on the floor. Our father’s safe lay just inside the drawing-room door, and I laughed and even Constance smiled, because it had not been opened and it had clearly not been possible to carry it any farther than this. “Foolishness,” Constance said, and touched the safe with her toe. Our mother had always been pleased when people admired her drawing room, but now no one could come to the windows and look in, and no one would ever see it again. Constance and I closed the drawing-room door behind us and never opened it afterwards. Constance waited just inside the front door while I went onto the porch again and closed the shutters over the tall dining-room windows, and then I came inside and we shut and locked the front door and we were safe. The hall was dark, with two narrow lines of sunlight coming through the two narrow glass panels set on either side of the door; we could look outside through the glass, but no one could see in, even by putting their eyes up close, because the hall inside was dark. Above us the stairs were black and led into blackness or burned rooms with, incredibly, tiny spots of sky showing through. Until now, the roof had always hidden us from the sky, but I did not think that there was any way we could be vulnerable from above, and closed my mind against the thought of silent winged creatures coming out of the trees above to perch on the broken burnt rafters of our house, peering down. I thought it might be wise to barricade the stairs by putting something— a broken chair, perhaps—across. A mattress, soaked and dirty, layhalfway down the stairs; this was where they had stood with the hoses and fought the fire back and out. I stood at the foot of the stairs, looking up, wondering where our house had gone, the walls and the floors and the beds and the boxes of things in the attic; our father’s watch was burned away, and our mother’s tortoise-shell dressing set. I could feel a breath of air on my cheek; it came from the sky I could see, but it smelled of smoke and ruin. Our house was a castle, turreted and open to the sky. “Come back to the kitchen,” Constance said. “I can’t stay out here.” Like children hunting for shells, or two old ladies going through dead leaves looking for pennies, we shuffled along the kitchen floor with our feet, turning over broken trash to find things which were still whole, and useful. When we had been along and across and diagonally through the kitchen we had gathered together a little pile of practical things on the kitchen table, and there was quite enough for the two of us. There were two cups with handles, and several without, and half a dozen plates, and three bowls. We had been able to rescue all the cans of food undamaged, and the cans of spice went neatly back onto their shelf. We found most of the silverware and straightened most of it as well as we could and put it back into its proper drawers. Since every Blackwood bride had brought her own silverware and china and linen into the house we had always had dozens of butter knives and soup ladles and cake servers; our mother’s best silverware had been in a tarnish-proof box in the dining-room sideboard, but they had found it and scattered it on the floor. One of our whole cups was green with a pale yellow inside, and Constance said that one could be mine. “I never saw anyone use it before,” she said. “I suppose a grandmother or a great-great-aunt brought that set to the house as her wedding china. There once were plates to match.” The cup which Constance chose was white with orange flowers, and one of the plates matched that. “I remember when we used those dishes,” Constance said; “they were the everyday china when I was very small. The china we used for best then was white, with gold edges. Then Mother bought new best china and the white and gold china was used for everyday and these flowered dishes went onto the pantry shelf with the other half-broken sets. These last few years I have always used Mother’s everyday china, except when Helen Clarke came to tea. We will take our meals like ladies,” she said, “using cups with handles.”When we had taken out everything we wanted and could use, Constance got the heavy broom and swept all the rubble into the dining room. “Now we won’t have to look at it,” she said. She swept the hall clear so we could go from the kitchen to the front door without passing through the dining room, and then we closed all the doors to the dining room and never opened them again. I thought of the Dresden figurine standing small and courageous under our mother’s portrait in the dark drawing room and I remembered that we would never dust it again. Before Constance swept away the torn cloth that had been the drawing-room drapes I asked her to cut me off a piece of the cord which had once drawn them open and shut, and she cut me a piece with a gold tassel on the end; I wondered if it might be the right thing to bury for Uncle Julian. When we had finished and Constance had scrubbed the kitchen floor our house looked clean and new; from the front door to the kitchen door everything was clear and swept. So many things were gone from the kitchen that it looked bare, but Constance put our cups and plates and bowls on a shelf, and found a pan to give Jonas milk, and we were quite safe. The front door was locked, and the kitchen door was locked and bolted, and we were sitting at the kitchen table drinking milk from our two cups and Jonas was drinking from his pan when a knocking started on the front door. Constance ran to the cellar, and I stopped just long enough to be sure that the kitchen door was bolted, and then followed her. We sat on the cellar stairs in the darkness, and listened. Far away, at the front door, the knocking went on and on, and then a voice called, “Constance? Mary Katherine?” “It’s Helen Clarke,” Constance said in a whisper. “Do you think she has come for her tea?” “No. Never again.” As we had both known she would, she came around the house, calling us. When she knocked on the kitchen door we held our breath, neither of us moving, because the top half of the kitchen door was glass, and we knew she could see in, but we were safely on the cellar stairs and she could not open the door. “Constance? Mary Katherine? Are you in there?” She shook the door handle as people do when they want a door to open and think to catch it unaware and slip in before the lock can hold. “Jim,” she said, “I know they’re in there. I can see something cooking on the stove. You’ve got to open the door,” she said, raising her voice. “Constance, come and talk to me; I want to see you. Jim,” she said, “they’re in there andthey can hear me, I know it.” “I’m sure they can hear you,” Jim Clarke said. “They can probably hear you in the village.” “But I’m sure they misunderstood the people last night; I’m sure Constance was upset, and I must tell them that nobody meant any harm. Constance, listen to me, please. We want you and Mary Katherine to come to our house until we can decide what to do with you. Everything’s all right, really it is; we’re going to forget all about it.” “Do you think she will push over the house?” I whispered to Constance, and Constance shook her head wordlessly. “Jim, do you think you could break down the door?” “Certainly not. Leave them alone, Helen, they’ll come out when they’re ready.” “But Constance takes these things so seriously. I’m sure she’s frightened now.” “Leave them alone.” “They cannot be left alone, that is absolutely the worst possible thing for them. I want them out of there and home with me where I can take care of them.” “They don’t seem to want to come,” Jim Clarke said. “Constance? Constance? I know you’re in there; come and open the door.” I was thinking that we might very well put a cloth or a piece of cardboard over the window in the kitchen door; it simply would not do to have Helen Clarke constantly peering in to watch pots cooking on the stove. We could pin the curtains together across the kitchen windows, and perhaps if the windows were all covered we could sit quietly at the table when Helen Clarke came pounding outside and not have to hide on the cellar stairs. “Let’s leave,” Jim Clarke said. “They’re not going to answer you.” “But I want to take them home with me.” “We did what we could. We’ll come back another time, when they’ll feel more like seeing you.” “Constance? Constance, please answer me.” Constance sighed, and tapped her fingers irritably and almost noiselessly on the stair rail. “I wish she’d hurry,” she said into my ear, “my soup is going to boil over.” Helen Clarke called again and again, going back around the house to their car, calling “Constance? Constance?” as though we might be somewhere in the woods, up a tree perhaps, or under the lettuceleaves, or waiting to spring out at her from behind a bush. When we heard their car start, distantly, we came up out of the cellar and Constance turned off her soup and I went along the hall to the front door to be sure they had gone and that the door was safely locked. I saw their car turn out of the driveway and thought I could still hear Helen Clarke calling “Constance? Constance?” “She certainly wanted her tea,” I said to Constance when I came back to the kitchen. “We have only two cups with handles,” Constance said. “She will never take tea here again.” “It’s a good thing Uncle Julian’s gone, or one of us would have to use a broken cup. Are you going to neaten Uncle Julian’s room?” “Merricat.” Constance turned from the stove to look at me. “What are we going to do?” “We’ve neatened the house. We’ve had food. We’ve hidden from Helen Clarke. What are we going to do?” “Where are we going to sleep? How are we going to know what time it is? What will we wear for clothes?” “Why do we need to know what time it is?” “Our food won’t last forever, even the preserves.” “We can sleep in my hiding place by the creek.” “No. That’s all right for hiding, but you must have a real bed.” “I saw a mattress on the stairs. From my own old bed, perhaps. We can pull it down and clean it and dry it in the sun. One corner is burned.” “Good,” said Constance. We went together to the stairs and took hold of the mattress awkwardly; it was unpleasantly wet and dirty. We dragged it, pulling together, along the hall, with little scraps of wood and glass coming with it, and got it across Constance’s clean kitchen floor to the kitchen door. Before unlocking the door I looked out carefully, and even when the door was opened I went out first to look around in every direction, but it was safe. We dragged the mattress out onto the lawn, and put it in the sun near our mother’s marble bench. “Uncle Julian used to sit right here,” I said. “It would be a good day, today, for Uncle Julian to sit in the sun.” “I hope he was warm when he died. Perhaps he remembered the sun for a minute.” “I had his shawl; I hope he didn’t wish for it. Merricat, I am going to plant something here, where he used to sit.” “I am going to bury something for him. What will you plant?”“A flower.” Constance leaned, and touched the grass softly. “Some kind of a yellow flower.” “It’s going to look funny, right in the middle of the lawn.” “We’ll know why it’s there, and no one else will ever see it.” “And I will bury something yellow, to keep Uncle Julian warm.” “First, however, my lazy Merricat, you will get a pot of water and scrub that mattress clean. And I will wash the kitchen floor again.” We were going to be very happy, I thought. There were a great many things to do, and a whole new pattern of days to arrange, but I thought we were going to be very happy. Constance was pale, and still saddened by what they had done to her kitchen, but she had scrubbed every shelf, and washed the table again and again, and washed the windows and the floor. Our dishes were bravely on their shelf, and the cans and unbroken boxes of food we had rescued made a substantial row in the pantry. “I could train Jonas to bring back rabbits for stew,” I told her, and she laughed, and Jonas looked back at her blandly. “That cat is so used to living on cream and rum cakes and buttered eggs that I doubt if he could catch a grasshopper,” she said. “I don’t think I could care for a grasshopper stew.” “At any rate, right now I am making an onion pie.” While Constance washed the kitchen I found a heavy cardboard carton which I took apart carefully, and so had several large pieces of cardboard to cover the glass window in the kitchen door. The hammer and the nails were in the tool shed where Charles Blackwood had put them after trying to mend the broken step, and I nailed cardboard across the kitchen door until the glass was completely covered and no one could see in. I nailed more cardboard across the two kitchen windows, and the kitchen was dark, but safe. “It would be safer to let the kitchen windows get dirty,” I told Constance, but she was shocked, and said, “I wouldn’t live in a house with dirty windows.” When we had finished the kitchen was very clean but could not sparkle because there was so little light, and I knew that Constance was not pleased. She loved sunshine and brightness and cooking in a light lovely kitchen. “We can keep the door open,” I said, “if we watch carefully all the time. We’ll hear if any cars stop in front of the house. When I can,” I said, “I will try to think of a way to build barricades along the sides of the house so no one will be able to come around here to the back.” “I am sure Helen Clarke will try again.”“At any rate she cannot look in now.” The afternoon was drawing in; even with the door open the sunlight came only a short way across the floor, and Jonas came to Constance at the stove, asking for his supper. The kitchen was warm and comfortable and familiar and clean. It would be nice to have a fireplace in here, I thought; we could sit beside a fire, and then I thought no, we have already had a fire. “I will go and make sure that the front door is locked,” I said. The front door was locked and no one was outside. When I came back into the kitchen Constance said, “Tomorrow I will clean Uncle Julian’s room. We have so little house left that it should all be very clean.” “Will you sleep in there? In Uncle Julian’s bed?” “No, Merricat. I want you to sleep in there. It’s the only bed we have.” “I am not allowed in Uncle Julian’s room.” She was quiet for a minute, looking at me curiously, and then asked, “Even though Uncle Julian’s gone, Merricat?” “Besides, I found the mattress, and cleaned it, and it came from my bed. I want it on the floor in my corner.” “Silly Merricat. Anyway, I’m afraid we’ll both have the floor tonight. The mattress will not dry before tomorrow, and Uncle Julian’s bed is not clean.” “I can bring branches from my hiding place, and leaves.” “On my clean kitchen floor?” “I’ll get the blanket, though, and Uncle Julian’s shawl.” “You’re going out? Now? All that way?” “No one’s outside,” I said. “It’s almost dark and I can go very safely. If anyone comes, close the door and lock it; if I see that the door is closed I will wait by the creek until I can come safely home. And I will take Jonas for protection.” I ran all the way to the creek, but Jonas was faster, and was waiting for me when I got to my hiding place. It was good to run, and good to come back again to our house and see the kitchen door standing open and the warm light inside. When Jonas and I came in I shut the door and bolted it and we were ready for the night. “It’s a good dinner,” Constance said, warm and happy from cooking. “Come and sit down, Merricat.” With the door shut she had had to turn on the ceiling light, and our dishes on the table were neatly set. “Tomorrow I will try to polish the silverware,” she said, “and we mustbring in things from the garden.” “The lettuce is full of ashes.” “Tomorrow, too,” Constance said, looking at the black squares of cardboard which covered the windows, “I am going to try to think of some kind of curtains to hide your cardboard.” “Tomorrow I will barricade the sides of the house. Tomorrow Jonas will catch us a rabbit. Tomorrow I will guess for you what time it is.” Far away, in the front of the house, a car stopped, and we were silent, looking at one another; now, I thought, now we will know how safe we are, and I got up and made sure that the kitchen door was bolted; I could not see out through the cardboard and I was sure that they could not see in. The knocking started at the front door, but there was no time to make sure that the front door was locked. They knocked only for a moment, as though certain that we would not be in the front of the house, and then we heard them stumbling in the darkness as they tried to find their way around the side of the house to the back. I heard Jim Clarke’s voice, and another which I remembered was the voice of Dr. Levy. “Can’t see a thing,” Jim Clarke said. “Black as sin out here.” “There’s a crack of light at one of the windows.” Which one, I wondered; which window still showed a crack? “They’re in there, all right,” Jim Clarke said. “No place else they could be.” “I just want to know if they’re hurt, or sick; don’t like to think of them shut up in there needing help.” “I’m supposed to bring them home with me,” Jim Clarke said. They came to the back door; their voices were directly outside, and Constance reached out her hand across the table to me; if it seemed that they might be able to look in we could run together for the cellar. “Damn place is all boarded up,” Jim Clarke said, and I thought, good, oh, that’s good. I had forgotten that there would be real boards in the tool shed; I never thought of anything but cardboard which is much too weak. “Miss Blackwood?” the doctor called, and one of them knocked on the door. “Miss Blackwood? It’s Dr. Levy.” “And Jim Clarke. Helen’s husband. Helen’s very worried about you.” “Are you hurt? Sick? Do you need help?” “Helen wants you to come to our house; she’s waiting there for you.” “Listen,” the doctor said, and I thought he had his face up very close to the glass, almost touching it. He talked in a very friendly voice, andquietly. “Listen, no one’s going to hurt you. We’re your friends. We came all the way over here to help you and make sure you were all right and we don’t want to bother you. As a matter of fact, we promise not to bother you at all, ever again, if you’ll just once say that you’re well and safe. Just one word.” “You can’t just let people go on worrying and worrying about you,” Jim Clarke said. “Just one word,” the doctor said. “All you have to do is say you’re all right.” They waited; I could feel them pressing their faces close to the glass, longing to see inside. Constance looked at me across the table and smiled a little, and I smiled back; our safeguards were good and they could not see in. “Listen,” the doctor said, and he raised his voice a little; “listen, Julian’s funeral is tomorrow. We thought you’d want to know.” “There are a lot of flowers already,” Jim Clarke said. “You’d be really pleased to see all the flowers. We sent flowers, and the Wrights, and the Carringtons. I think you’d feel a little different about your friends if you could see the flowers we all sent Julian.” I wondered why we would feel different if we saw who sent Uncle Julian flowers. Certainly Uncle Julian buried in flowers, swarmed over by flowers, would not resemble the Uncle Julian we had seen every day. Perhaps masses of flowers would warm Uncle Julian dead; I tried to think of Uncle Julian dead and could only remember him asleep. I thought of the Clarkes and the Carringtons and the Wrights pouring armfuls of flowers down onto poor old Uncle Julian, helplessly dead. “You’re not gaining anything by driving away your friends, you know. Helen said to tell you—” “Listen.” I could feel them pushing against the door. “No one’s going to bother you. Just tell us, are you all right?” “We’re not going to keep coming, you know. There’s a limit to how much friends can take.” Jonas yawned. In silence Constance turned, slowly and carefully, back to face her place at the table, and took up a buttered biscuit and took a tiny silent bite. I wanted to laugh, and put my hands over my mouth; Constance eating a biscuit silently was funny, like a doll pretending to eat. “ Damn it,” Jim Clarke said. He knocked on the door. “ Damn it,” he said. “For the last time,” the doctor said, “we know you’re in there; for thelast time will you just—” “Oh, come away,” Jim Clarke said. “It’s not worth all the yelling.” “Listen,” the doctor said, and I thought he had his mouth against the door, “one of these days you’re going to need help. You’ll be sick, or hurt. You’ll need help. Then you’ll be quick enough to—” “Leave them be,” Jim Clarke said. “Come on.” I heard their footsteps going around the side of the house and wondered if they were tricking us, pretending to walk away and then coming silently back to stand without sound outside the door, waiting. I thought of Constance silently eating a biscuit inside and Jim Clarke silently listening outside and a little cold chill went up my back; perhaps there would never be noise in the world again. Then the car started at the front of the house and we heard it drive away and Constance put her fork down on her plate with a little crash and I breathed again and said, “Where have they got Uncle Julian, do you suppose?” “At that same place,” Constance said absently, “in the city. Merricat,” she said, looking up suddenly. “Yes, Constance?” “I want to say I’m sorry. I was wicked last night.” I was still and cold, looking at her and remembering. “I was very wicked,” she said. “I never should have reminded you of why they all died.” “Then don’t remind me now.” I could not move my hand to reach over and take hers. “I wanted you to forget about it. I never wanted to speak about it, ever, and I’m sorry I did.” “I put it in the sugar.” “I know. I knew then.” “You never used sugar.” “No.” “So I put it in the sugar.” Constance sighed. “Merricat,” she said, “we’ll never talk about it again. Never.” I was chilled, but she smiled at me kindly and it was all right. “I love you, Constance,” I said. “And I love you, my Merricat.” Jonas sat on the floor and slept on the floor and I thought it ought not to be so difficult for me. Constance should have had leaves and softmoss under her blanket but we could not dirty the kitchen floor again. I put my blanket in the corner near my stool because it was the place I knew best, and Jonas got up onto the stool and sat there, looking down on me. Constance lay on the floor near the stove; it was dark, but I could see the paleness of her face across the kitchen. “Are you comfortable?” I asked her, and she laughed. “I’ve spent a lot of time in",
      "density_breakdown": {
        "Metaphor": 1.0655301012253595,
        "Simile": 0.887941751021133,
        "Imagery": 12.60877286450009,
        "Symbolism": 6.570768957556385,
        "Dialogue": 0.0,
        "Foreshadowing": 9.41218256082401,
        "Juxtaposition": 11.188066062866277,
        "Repetition": 15.982951518380393,
        "TOTAL_DENSITY": 57.716213816373646
      }
    },
    "resolution": {
      "chapter_range": "10",
      "narrative_primary": 10,
      "optimized_primary": 10,
      "device_density_score": 56.11791866453561,
      "improvement_percent": 0.0,
      "optimization_applied": false,
      "chapter_text": "this kitchen,” she said, “but I never before tried lying on its floor. I’ve taken such good care of it that it has to make me welcome, I think.” “Tomorrow we bring in lettuce.”10 Slowly the pattern of our days grew, and shaped itself into a happy life. In the mornings when I awakened I would go at once down the hall to make sure the front door was locked. We were most active in the very early morning because no one was ever around. We had not realized that, with the gates opened and the path exposed to public use, the children would come; one morning I stood beside the front door, looking out through the narrow pane of glass, and saw children playing on our front lawn. Perhaps the parents had sent them to explore the way and make sure it was navigable, or perhaps children can never resist playing anywhere; they seemed a little uneasy playing in front of our house, and their voices were subdued. I thought that perhaps they were only pretending to play, because they were children and were supposed to play, but perhaps they were actually sent here to look for us, thinly disguised as children. They were not really convincing, I decided as I watched them; they moved gracelessly, and never once glanced, that I could see, at our house. I wondered how soon they would creep onto the porch, and press their small faces against the shutters, trying to see through cracks. Constance came up behind me and looked out over my shoulder. “They are the children of the strangers,” I told her. “They have no faces.” “They have eyes.” “Pretend they are birds. They can’t see us. They don’t know it yet, they don’t want to believe it, but they won’t ever see us again.” “I suppose that now they’ve come once, they’ll come again.” “All the strangers will come, but they can’t see inside. And now may I please have my breakfast?” The kitchen was always dark in the mornings until I unbolted the kitchen door and opened it to let the sunlight in. Then Jonas went to sit on the step and bathe and Constance sang while she made our breakfast. After breakfast I sat on the step with Jonas while Constance washed the kitchen. Barricading the sides of the house had been easier than I expected; I managed it in one night with Constance holding a flashlight for me. At either side of our house there was a spot where the trees and bushes grew close to the house, sheltering the back and narrowing the path which was the only way around. I brought piece after piece from the pile of junk Mr. Harler had made on our front porch, and heaped thebroken boards and furniture across the narrowest spot. It would not really keep anyone out, of course; the children could climb over it easily, but if anyone did try to get past there would be enough noise and falling of broken boards to give us plenty of time to close and bolt the kitchen door. I had found some boards around the tool shed, and nailed them rudely across the glass of the kitchen door, but I disliked putting them across the sides of the house as a barricade, where anyone might see them and know how clumsily I built. Perhaps, I told myself, I might try my hand at mending the broken step. “What are you laughing about now?” Constance asked me. “I am thinking that we are on the moon, but it is not quite as I supposed it would be.” “It is a very happy place, though.” Constance was bringing breakfast to the table: scrambled eggs and toasted biscuits and blackberry jam she had made some golden summer. “We ought to bring in as much food as we can,” she said. “I don’t like to think of the garden waiting there for us to come and gather growing things. And I’d feel much better if we had more food put securely away in the house.” “I will go on my winged horse and bring you cinnamon and thyme, emeralds and clove, cloth of gold and cabbages.” “And rhubarb.” We were able to leave the kitchen door open when we went down to the vegetable garden, because we could see clearly whether anyone was approaching my barricades and run back to the house if we needed to. I carried the basket and we brought back lettuce, still grey with ash, and radishes, and tomatoes and cucumbers and, later, berries, and melons. Usually I ate fruit and vegetables still moist from the ground and the air, but I disliked eating anything while it was still dirty with the ash from our burned house. Most of the dirt and the soot had blown away and the air around the garden was fresh and clean, but the smoke was in the ground and I thought it would always be there. As soon as we were safely settled Constance had opened Uncle Julian’s room and cleaned it. She brought out the sheets from Uncle Julian’s bed, and the blankets, and washed them in the kitchen sink and set them outside to dry in the sunlight. “What are you going to do with Uncle Julian’s papers?” I asked her, and she rested her hands against the edge of the sink, hesitating. “I suppose I’ll keep them all in the box,” she said at last. “I suppose I’ll put the box down in the cellar.” “And preserve it?”“And preserve it. He would like to think that his papers were treated respectfully. And I would not want Uncle Julian to suspect that his papers were not preserved.” “I had better go and see that the front door is locked.” The children were often outside on our front lawn, playing their still games and not looking at our house, moving awkwardly in little dashing runs, and slapping one another without cause. Whenever I checked to make sure that the front door was locked I looked out to see if the children were there. Very often I saw people walking on our path now, using it to go from one place to another, and putting their feet down where once only my feet had gone; I thought they used the path without wanting to, as though each of them had to travel it once to show that it could be done, but I thought that only a few, the defiant hating ones, came by more than once. I dreamed away the long afternoon while Constance cleaned Uncle Julian’s room; I sat on the doorsill with Jonas asleep beside me, and looked out on the quiet safe garden. “Look, Merricat,” Constance said, coming to me with an armful of clothes, “look, Uncle Julian had two suits, and a topcoat and a hat.” “He walked upright once; he told us so himself.” “I can just barely remember him, years ago, going off one day to buy a suit, and I suppose it was one of these suits he bought; they are neither of them much worn.” “What would he have been wearing on the last day with them? What tie did he have on at dinner? He would surely like to have it remembered.” She looked at me for a minute, not smiling. “It would hardly have been one of these; when I came to get him afterwards, at the hospital, he was wearing pajamas and a robe.” “Perhaps he should have one of these suits now.” “He was probably buried in an old suit of Jim Clarke’s.” Constance started for the cellar, and then stopped. “Merricat?” “Yes, Constance?” “Do you realize that these things of Uncle Julian’s are the only clothes left in our house? All of mine burned, and all of yours.” “And everything of theirs in the attic.” “I have only this pink dress I have on.” I looked down. “And I am wearing brown.” “And yours needs washing, and mending; how can you tear your clothes so, my Merricat?”“I shall weave a suit of leaves. At once. With acorns for buttons.” “Merricat, be serious. We will have to wear Uncle Julian’s clothes.” “I am not allowed to touch Uncle Julian’s things. I shall have a lining of moss, for cold winter days, and a hat made of bird feathers.” “That may be all very well for the moon, Miss Foolishness. On the moon you may wear a suit of fur like Jonas, for all of me. But right here in our house you are going to be clothed in one of your Uncle Julian’s old shirts, and perhaps his trousers too.” “Or Uncle Julian’s bathrobe and pajamas, I suppose. No; I am not allowed to touch Uncle Julian’s things; I will wear leaves.” “But you are allowed. I tell you that you are allowed.” “No.” She sighed. “Well,” she said, “you’ll probably see me wearing them.” Then she stopped, and laughed, and looked at me, and laughed again. “Constance?” I said. She put Uncle Julian’s clothes over the back of a chair, and, still laughing, went into the pantry and opened one of the drawers. I remembered what she was after and I laughed too. Then she came back and put an armload of tablecloths down beside me. “These will do you very nicely, elegant Merricat. Look; how will you feel in this, with a border of yellow flowers? Or this handsome red and white check? The damask, I am afraid, is too stiff for comfort, and besides it has been darned.” I stood up and held the red and white checked tablecloth against me. “You can cut a hole for my head,” I said; I was pleased. “I have no sewing things. You will simply have to tie it around your waist with a cord or let it hang like a toga.” “I will use the damask for a cloak; who else wears a damask cloak?” “Merricat, oh, Merricat.” Constance dropped the tablecloth she was holding and put her arms around me. “What have I done to my baby Merricat?” she said. “No house. No food. And dressed in a tablecloth; what have I done ?” “Constance,” I said, “I love you, Constance.” “Dressed in a tablecloth like a rag doll.” “Constance. We are going to be very happy, Constance.” “Oh, Merricat,” she said, holding me. “Listen to me, Constance. We are going to be very happy.” I dressed at once, not wanting to give Constance more time to think. I chose the red and white check, and when Constance had cut a hole formy head I took my gold cord with the tassel that Constance had cut from the drawing-room drapes and tied it around me for a belt and looked, I thought, very fine. Constance was sad at first, and turned away sadly when she saw me, and scrubbed furiously at the sink to get my brown dress clean, but I liked my robe, and danced in it, and before long she smiled again and then laughed at me. “Robinson Crusoe dressed in the skins of animals,” I told her. “He had no gay cloths with a gold belt.” “I must say you never looked so bright before.” “You will be wearing the skins of Uncle Julian; I prefer my tablecloth.” “I believe the one you are wearing now was used for summer breakfasts on the lawn many years ago. Red and white check would never be used in the dining room, of course.” “Some days I shall be a summer breakfast on the lawn, and some days I shall be a formal dinner by candlelight, and some days I shall be —” “A very dirty Merricat. You have a fine gown, but your face is dirty. We have lost almost everything, young lady, but at least we still have clean water and a comb.” One thing was most lucky about Uncle Julian’s room: I persuaded Constance to bring out his chair and wheel it through the garden to reinforce my barricade. It looked strange to see Constance wheeling the empty chair, and for a minute I tried to see Uncle Julian again, riding with his hands in his lap, but all that remained of Uncle Julian’s presence were the worn spots on the chair, and a handkerchief tucked under the cushion. The chair would be powerful in my barricade, however, staring out always at intruders with a blank menace of dead Uncle Julian. I was troubled to think that Uncle Julian might vanish altogether, with his papers in a box and his chair on the barricade and his toothbrush thrown away and even the smell of Uncle Julian gone from his room, but when the ground was soft Constance planted a yellow rosebush at Uncle Julian’s spot on the lawn, and one night I went down to the creek and buried Uncle Julian’s initialled gold pencil by the water, so the creek would always speak his name. Jonas took to going into Uncle Julian’s room, where he had never gone before, but I did not go inside. Helen Clarke came to our door twice more, knocking and calling and begging us to answer, but we sat quietly, and when she found that shecould not come around the house because of my barricade she told us from the front door that she would not come back, and she did not. One evening, perhaps the evening of the day Constance planted Uncle Julian’s rosebush, we heard a very soft knock at our front door while we sat at the table eating dinner. It was far too soft a knock for Helen Clarke, and I left the table and hurried silently down the hall to be sure that the front door was locked, and Constance followed me, curious. We pressed silently against the door and listened. “Miss Blackwood?” someone said outside, in a low voice; I wondered if he suspected we were so close to him. “Miss Constance? Miss Mary Katherine?” It was not quite dark outside, but inside where we stood we could only see one another dimly, two white faces against the door. “Miss Constance?” he said again. “Listen.” I thought that he was moving his head from side to side to make sure that he was not seen. “Listen,” he said, “I got a chicken here.” He tapped softly on the door. “I hope you can hear me,” he said. “I got a chicken here. My wife fixed it, roasted it nice, and there’s some cookies and a pie. I hope you can hear me.” I could see that Constance’s eyes were wide with wonder. I stared at her and she stared at me. “I sure hope you can hear me, Miss Blackwood. I broke one of your chairs and I’m sorry.” He tapped against the door again, very softly. “Well,” he said. “I’ll just set this basket down on your step here. I hope you heard me. Goodbye.” We listened to quiet footsteps going away, and after a minute Constance said, “What shall we do? Shall we open the door?” “Later,” I said. “I’ll come when it’s really dark.” “I wonder what kind of pie it is. Do you think it’s as good as my pies?” We finished our dinner and waited until I was sure that no one could possibly see the front door opening, and then we went down the hall and I unlocked the door and looked outside. The basket sat on the doorstep, covered with a napkin. I brought it inside and locked the door while Constance took the basket from me and carried it to the kitchen. “Blueberry,” she said when I came. “Quite good, too; it’s still warm.” She took out the chicken, wrapped in a napkin, and the little package of cookies, touching each lovingly and with gentleness. “Everything’s still warm,” she said. “She must have baked them right after dinner, sohe could bring them right over. I wonder if she made two pies, one for the house. She wrapped everything while it was still warm and told him to bring them over. These cookies are not crisp enough.” “I’ll take the basket back and leave it on the porch, so he’ll know we found it.” “No, no.” Constance caught me by the arm. “Not until I’ve washed the napkins; what would she think of me?” Sometimes they brought bacon, home-cured, or fruit, or their own preserves, which were never as good as the preserves Constance made. Mostly they brought roasted chicken; sometimes a cake or a pie, frequently cookies, sometimes a potato salad or coleslaw. Once they brought a pot of beef stew, which Constance took apart and put back together again according to her own rules for beef stew, and sometimes there were pots of baked beans or macaroni. “We are the biggest church supper they ever had,” Constance said once, looking at a loaf of homemade bread I had just brought inside. These things were always left on the front doorstep, always silently and in the evenings. We thought that the men came home from work and the women had the baskets ready for them to carry over; perhaps they came in darkness not to be recognized, as though each of them wanted to hide from the others, and bringing us food was somehow a shameful thing to do in public. There were many women cooking, Constance said. “Here is one,” she explained to me once, tasting a bean, “who uses ketchup, and too much of it; and the last one used more molasses.” Once or twice there was a note in the basket: “This is for the dishes,” or “We apologize about the curtains,” or “Sorry for your harp.” We always set the baskets back where we had found them, and never opened the front door until it was completely dark and we were sure that no one was near. I always checked carefully afterwards to make certain that the front door was locked. I discovered that I was no longer allowed to go to the creek; Uncle Julian was there, and it was much too far from Constance. I never went farther away than the edge of the woods, and Constance went only as far as the vegetable garden. I was not allowed to bury anything more, nor was I allowed to touch stone. Every day I looked over the boards across the kitchen windows and when I found small cracks I nailed on more boards. Every morning I checked at once to make sure the front door was locked, and every morning Constance washed the kitchen. We spent a good deal of time at the front door, particularly during theafternoons, when most people came by; we sat, one on either side of the front door, looking out through the narrow glass panels which I had covered almost entirely with cardboard so that we had each only a small peephole and no one could possibly see inside. We watched the children playing, and the people walking past, and we heard their voices and they were all strangers, with their wide staring eyes and their evil open mouths. One day a group came by bicycle; there were two women and a man, and two children. They parked their bicycles in our driveway and lay down on our front lawn, pulling at the grass and talking while they rested. The children ran up and down our driveway and over and around the trees and bushes. This was the day that we learned that the vines were growing over the burned roof of our house, because one of the women glanced sideways at the house and said that the vines almost hid the marks of burning. They rarely turned squarely to look at our house face to face, but looked from the corners of their eyes or from over a shoulder or through their fingers. “It used to be a lovely old house, I hear,” said the woman sitting on our grass. “I’ve heard that it was quite a local landmark at one time.” “Now it looks like a tomb,” the other woman said. “Shh,” the first woman said, and gestured toward the house with her head. “I heard,” she said loudly, “that they had a staircase which was very fine. Carved in Italy, I heard.” “They can’t hear you,” the other woman said, amused. “And who cares if they do, anyway?” “Shhh.” “No one knows for sure if there’s anyone inside or not. The local people tell some tall tales.” “Shh. Tommy,” she called to one of the children, “don’t you go near those steps.” “Why?” said the child, backing away. “Because the ladies live in there, and they don’t like it.” “Why?” said the child, pausing at the foot of the steps and giving a quick look backward at our front door. “The ladies don’t like little boys,” the second woman said; she was one of the bad ones; I could see her mouth from the side and it was the mouth of a snake. “What would they do to me?” “They’d hold you down and make you eat candy full of poison; I heard that dozens of bad little boys have gone too near that house and never been seen again. They catch little boys and they—”“Shh. Honestly, Ethel.” “Do they like little girls?” The other child drew near. “They hate little boys and little girls. The difference is, they eat the little girls.” “Ethel, stop. You’re terrifying the children. It isn’t true, darlings; she’s only teasing you.” “They never come out except at night,” the bad woman said, looking evilly at the children, “and then when it’s dark they go hunting little children.” “Just the same,” the man said suddenly, “I don’t want to see the kids going too near that house.” Charles Blackwood came back only once. He came in a car with another man late one afternoon when we had been watching for a long time. All the strangers had gone, and Constance had just stirred and said, “Time to put on the potatoes,” when the car turned into the driveway and she settled back to watch again. Charles and the other man got out of the car in front of the house and walked directly to the foot of the steps, looking up, although they could not see us inside. I remembered the first time Charles had come and stood looking up at our house in just the same manner, but this time he would never get in. I reached up and touched the lock on the front door to make sure it was fastened, and on the other side of the doorway Constance turned and nodded to me; she knew, too, that Charles would never get in again. “See?” Charles said, outside, at the foot of our steps. “There’s the house, just like I said. It doesn’t look as bad as it did, now the vines have grown so. But the roof’s been burned away, and the place was gutted inside.” “Are the ladies in there?” “Sure.” Charles laughed, and I remembered his laughter and his big staring white face and from inside the door I wished him dead. “They’re in there all right,” he said. “And so is a whole damn fortune.” “You know that?” “They’ve got money in there’s never even been counted. They’ve got it buried all over, and a safe full, and God knows where else they’ve hidden it. They never come out, just hide away inside with all that money.” “Look,” the other man said, “they know you, don’t they?” “Sure. I’m their cousin. I came here on a visit once.”“You think there’s any chance you might get one of them to talk to you? Maybe come to the window or something, so I could get a picture?” Charles thought. He looked at the house and at the other man, and thought. “If you sell this, to the magazine or somewhere, do I get half?” “Sure, it’s a promise.” “I’ll try it,” Charles said. “You get back behind the car, out of sight. They certainly won’t come out if they see a stranger.” The other man went back to the car and took out a camera and settled himself on the other side of the car where we could not see him. “Okay,” he called, and Charles started up the steps to our front door. “Connie?” he called. “Hey, Connie? It’s Charles; I’m back.” I looked at Constance and thought she had never seen Charles so truly before. “Connie?” She knew now that Charles was a ghost and a demon, one of the strangers. “Let’s forget all that happened,” Charles said. He came close to the door and spoke pleasantly, with a little pleading tone. “Let’s be friends again.” I could see his feet. One of them was tapping and tapping on the floor of our porch. “I don’t know what you’ve got against me,” he said, “and I’ve been waiting and waiting for you to let me know I could come back again. If I did anything to offend you, I’m really sorry.” I wished Charles could see inside, could see us sitting on the floor on either side of the front door, listening to him and looking at his feet, while he talked beggingly to the door three feet above our heads. “Open the door,” he said very softly. “Connie, will you open the door for me, for Cousin Charles?” Constance looked up to where his face must be and smiled unpleasantly. I thought it must be a smile she had been saving for Charles if he ever came back again. “I went to see old Julian’s grave this morning,” Charles said. “I came back to visit old Julian’s grave and to see you once more.” He waited a minute and then said with a little break in his voice, “I put a couple of flowers— you know—on the old fellow’s grave; he was a fine old guy, and he was always pretty good to me.” Beyond Charles’ feet I saw the other man coming out from behind the car with his camera. “Look,” he called, “you’re wasting your breath. And I haven’t got all day.”“Don’t you understand?” Charles had turned away from the door, but his voice still had the little break in it. “I’ve got to see her once more. I was the cause of it all.” “What?” “Why do you suppose two old maids shut themselves up in a house like this? God knows,” Charles said, “I didn’t mean it to turn out this way.” I thought Constance was going to speak then, or at least laugh out loud, and I reached across and touched her arm, warning her to be quiet, but she did not turn her head to me. “If I could just talk to her,” Charles said. “You can get some pictures of the house, anyway, with me standing here. Or knocking at the door; I could be knocking frantically at the door.” “You could be stretched across the doorsill dying of a broken heart, for all of me,” the other man said. He went to the car and put his camera inside. “Waste of time.” “And all that money. Connie,” Charles called loudly, “will you for heaven’s sake open that door?” “You know,” the other man said from the car, “I’ll just bet you’re never going to see those silver dollars again.” “Connie,” Charles said, “you don’t know what you’re doing to me; I never deserved to be treated like this. Please, Connie.” “You want to walk back to town?” the other man said. He closed the car door. Charles turned away from the door and then turned back. “All right, Connie,” he said, “this is it. If you let me go this time, you’ll never see me again. I mean it, Connie.” “I’m leaving,” the other man said from the car. “I mean it, Connie, I really do.” Charles started down the steps, talking over his shoulder. “Take a last look,” he said. “I’m going. One word could make me stay.” I did not think he was going to go in time. I honestly did not know whether Constance was going to be able to contain herself until he got down the steps and safely into the car. “Goodbye, Connie,” he said from the foot of the steps and then turned away and went slowly toward the car. He looked for a minute as though he might wipe his eyes or blow his nose, but the other man said, “Hurry up, ” and Charles looked back once more, raised his hand sadly, and got into the car. Then Constance laughed, and I laughed, and for a minute I saw Charles in the car turn his head quickly, as though he had heard uslaughing, but the car started, and drove off down the driveway, and we held each other in the dark hall and laughed, with the tears running down our cheeks and echoes of our laughter going up the ruined stairway to the sky. “I am so happy,” Constance said at last, gasping. “Merricat, I am so happy.” “I told you that you would like it on the moon.” The Carringtons stopped their car in front of our house one Sunday after church and sat quietly in the car looking at our house, as though supposing that we would come out if there was anything the Carringtons could do for us. Sometimes I thought of the drawing room and the dining room, forever closed away, with our mother’s lovely broken things lying scattered, and the dust sifting gently down to cover them; we had new landmarks in the house, just as we had a new pattern for our days. The crooked, broken-off fragment which was all that was left of our lovely stairway was something we passed every day and came to know as intimately as we had once known the stairs themselves. The boards across the kitchen windows were ours, and part of our house, and we loved them. We were very happy, although Constance was always in terror lest one of our two cups should break, and one of us have to use a cup without a handle. We had our well- known and familiar places: our chairs at the table, and our beds, and our places beside the front door. Constance washed the red and white tablecloth and the shirts of Uncle Julian’s which she wore, and while they were hanging in the garden to dry I wore a tablecloth with a yellow border, which looked very handsome with my gold belt. Our mother’s old brown shoes were safely put away in my corner of the kitchen, since in the warm summer days I went barefoot like Jonas. Constance disliked picking many flowers, but there was always a bowl on the kitchen table with roses or daisies, although of course she never picked a rose from Uncle Julian’s rosebush. I sometimes thought of my six blue marbles, but I was not allowed to go to the long field now, and I thought that perhaps my six blue marbles had been buried to protect a house which no longer existed and had no connection with the house where we lived now, and where we were very happy. My new magical safeguards were the lock on the front door, and the boards over the windows, and the barricades along the sides of the house. In the evenings sometimes we saw movement in the darkness on the lawn, and heard whispers.“Don’t; the ladies might be watching.” “You think they can see in the dark?” “I heard they see everything that goes on.” Then there might be laughter, drifting away into the warm darkness. “They will soon be calling this Lover’s Lane,” Constance said. “After Charles, no doubt.” “The least Charles could have done,” Constance said, considering seriously, “was shoot himself through the head in the driveway.” We learned, from listening, that all the strangers could see from outside, when they looked at all, was a great ruined structure overgrown with vines, barely recognizable as a house. It was the point halfway between the village and the highway, the middle spot on the path, and no one ever saw our eyes looking out through the vines. “You can’t go on those steps,” the children warned each other; “if you do, the ladies will get you.” Once a boy, dared by the others, stood at the foot of the steps facing the house, and shivered and almost cried and almost ran away, and then called out shakily, “Merricat, said Constance, would you like a cup of tea?” and then fled, followed by all the others. That night we found on the doorsill a basket of fresh eggs and a note reading, “He didn’t mean it, please.” “Poor child,” Constance said, putting the eggs into a bowl to go into the cooler. “He’s probably hiding under the bed right now.” “Perhaps he had a good whipping to teach him manners.” “We will have an omelette for breakfast.” “I wonder if I could eat a child if I had the chance.” “I doubt if I could cook one,” said Constance. “Poor strangers,” I said. “They have so much to be afraid of.” “Well,” Constance said, “I am afraid of spiders.” “Jonas and I will see to it that no spider ever comes near you. Oh, Constance,” I said, “we are so happy.” Table of Contents WE HAVE ALWAYS LIVED IN THE CASTLE Title Page Copyright Page Introduction Dedication Chapter 1 Chapter 2 Chapter 3 Chapter 4 Chapter 5 Chapter 6 Chapter 7 Chapter 8 Chapter 9 Chapter 10",
      "density_breakdown": {
        "Metaphor": 1.775883502042266,
        "Simile": 1.420706801633813,
        "Imagery": 12.786361214704314,
        "Symbolism": 6.570768957556385,
        "Dialogue": 0.0,
        "Foreshadowing": 8.879417510211331,
        "Juxtaposition": 12.253596164091636,
        "Repetition": 12.431184514295863,
        "TOTAL_DENSITY": 56.11791866453561
      }
    }
  },
  "narrative_position_mapping": {
    "exposition": {
      "chapter_range": "1-2",
      "narrative_primary": 1,
      "optimized_primary": 2,
      "device_density_score": 58.959332267803234,
      "optimization_applied": true,
      "pages": ""
    },
    "rising_action": {
      "chapter_range": "3-7",
      "narrative_primary": 5,
      "optimized_primary": 4,
      "device_density_score": 59.325044404973355,
      "optimization_applied": true,
      "pages": ""
    },
    "climax": {
      "chapter_range": "8",
      "narrative_primary": 8,
      "optimized_primary": 8,
      "device_density_score": 59.847274018824365,
      "optimization_applied": false,
      "pages": ""
    },
    "falling_action": {
      "chapter_range": "9",
      "narrative_primary": 9,
      "optimized_primary": 9,
      "device_density_score": 57.716213816373646,
      "optimization_applied": false,
      "pages": ""
    },
    "resolution": {
      "chapter_range": "10",
      "narrative_primary": 10,
      "optimized_primary": 10,
      "device_density_score": 56.11791866453561,
      "optimization_applied": false,
      "pages": ""
    }
  },
  "macro_variables": {
    "narrative": {
      "voice": {
        "pov": "FP",
        "pov_description": "First person narration from Merricat's perspective throughout",
        "focalization": "INT",
        "focalization_description": "Limited to Merricat's internal perceptions and thoughts",
        "reliability": "UNREL",
        "reliability_description": "Merricat's mental state and selective perceptions make her unreliable",
        "temporal_distance": "IMM",
        "temporal_distance_description": "Events narrated as they occur or shortly after",
        "mode_dominance": "BAL",
        "mode_dominance_description": "Balance of showing through dialogue and telling through internal thoughts",
        "free_indirect": "NONE",
        "free_indirect_description": "Direct first person prevents free indirect discourse",
        "stream_consciousness": "SOME",
        "stream_consciousness_description": "Occasional passages of fragmented thoughts and associations",
        "character_revelation": "IND",
        "character_revelation_description": "Characters revealed through actions, dialogue, and Merricat's interpretations",
        "narrative_intrusion": "NONE",
        "narrative_intrusion_description": "No external narrative commentary beyond Merricat's perspective",
        "voice_consistency": "CONS",
        "voice_consistency_description": "Merricat's distinctive voice remains consistent throughout"
      },
      "structure": {
        "chronology": "LIN",
        "chronology_description": "Events proceed chronologically with occasional brief flashbacks",
        "framing": "NONE",
        "framing_description": "No frame narrative structure",
        "plot_architecture": "MONO",
        "plot_architecture_description": "Single plot focused on the Blackwood family's isolation and crisis",
        "pacing": "VAR",
        "pacing_description": "Slow domestic scenes punctuated by moments of intense action",
        "temporal_span": "BRIEF",
        "temporal_span_description": "Story spans several days to weeks",
        "beginning_type": "MEDIAS",
        "beginning_type_description": "Opens in the middle of established routine and isolation",
        "ending_type": "CLOSED",
        "ending_type_description": "Resolves with new equilibrium of deeper isolation",
        "scene_summary_ratio": "SCENE",
        "scene_summary_ratio_description": "Heavy emphasis on detailed scenes over summary",
        "chapter_structure": "TRAD",
        "chapter_structure_description": "Traditional numbered chapters of varying length",
        "causation": "STRONG",
        "causation_description": "Clear cause-effect relationships drive plot progression"
      }
    },
    "rhetoric": {
      "voice": {
        "tone": "Darkly whimsical with undercurrents of menace and childlike wonder",
        "register": "COLL",
        "register_description": "Colloquial language reflecting Merricat's isolated yet observant perspective",
        "stance": "SUBJ",
        "stance_description": "Highly subjective narration filtered through Merricat's unique worldview",
        "ethos": "WEAK",
        "ethos_description": "Narrator's credibility undermined by unreliability and isolation",
        "pathos": "STRONG",
        "pathos_description": "Strong emotional engagement through Gothic atmosphere and family tragedy",
        "logos": "WEAK",
        "logos_description": "Logic subordinated to psychological and emotional truth",
        "irony": "DRAM",
        "irony_description": "Dramatic irony as readers understand more than Merricat reveals",
        "figurative_density": "MOD",
        "figurative_density_description": "Moderate use of metaphor and symbolism woven into realistic detail"
      },
      "structure": {
        "alignment_type": "TRANS",
        "alignment_type_description": "Challenges reader assumptions about family, normalcy, and social isolation",
        "narrative_rhetoric_relationship": "TIGHT",
        "narrative_rhetoric_relationship_description": "Narrative voice and rhetorical effects tightly integrated",
        "primary_mechanism": "CHAR",
        "primary_mechanism_description": "Character-driven alignment through Merricat's unique perspective",
        "device_density": "MOD",
        "device_density_description": "Moderate density with devices integrated into naturalistic prose",
        "device_distribution": "EVEN",
        "device_distribution_description": "Literary devices distributed evenly throughout sections",
        "mediation_strategy": "REPETITION",
        "mediation_strategy_description": "Recurring patterns of ritual, protection, and isolation reinforce themes"
      }
    },
    "device_mediation": {
      "summary": "Literary devices mediate alignment by establishing Merricat's isolated perspective as both protective and limiting, using repetition of protective rituals and dramatic irony to reveal the gap between her perception and reality, while Gothic elements transform domestic spaces into sites of both comfort and confinement."
    }
  },
  "alignment_pattern": {
    "pattern_name": "Insular Perception",
    "core_dynamic": "First-person unreliable narration creates a subjective lens that filters all information through a damaged psyche, using dramatic irony to reveal the gap between Merricat's perception and reality.",
    "reader_effect": "The reader experiences both intimacy with and alienation from the narrator, simultaneously drawn into her worldview while recognizing its distortions and omissions.",
    "device_priorities": [
      "Juxtaposition",
      "Repetition",
      "Imagery",
      "Foreshadowing",
      "Symbolism",
      "Unreliable Narrator",
      "First-Person Narration",
      "Dramatic Irony"
    ]
  },
  "micro_devices": [
    {
      "name": "Unreliable Narrator",
      "anchor_phrase": "I wish you were all dead",
      "location_percent": 15,
      "scene": "Merricat shopping in the grocery store while villagers make hostile comments",
      "effect": "Reveals Merricat's violent fantasies and disturbed mental state, establishing the gap between her perspective and normal social interaction",
      "assigned_section": "exposition",
      "chapter": 2,
      "chapter_range": "1-2",
      "pedagogical_tier": 5
    },
    {
      "name": "Juxtaposition",
      "anchor_phrase": "yellow dishes, I thought, feeling the eyes",
      "location_percent": 40,
      "scene": "Merricat walking past hostile villagers while mentally planning a peaceful garden lunch",
      "effect": "Contrasts Merricat's serene domestic fantasies with the threatening external reality, showing her psychological escape mechanism",
      "assigned_section": "exposition",
      "chapter": 2,
      "chapter_range": "1-2",
      "pedagogical_tier": 3
    },
    {
      "name": "Repetition",
      "anchor_phrase": "Merricat, Merricat",
      "location_percent": 60,
      "scene": "Village children chanting at Merricat as she passes their fence",
      "effect": "Emphasizes the ritualized nature of the village's persecution and Merricat's isolation from normal social bonds",
      "assigned_section": "exposition",
      "chapter": 2,
      "chapter_range": "1-2",
      "pedagogical_tier": 2
    },
    {
      "name": "Imagery",
      "anchor_phrase": "I am living on the moon",
      "location_percent": 50,
      "scene": "Merricat creating mental escape while enduring the children's taunts",
      "effect": "Creates a vivid alternate reality that reveals Merricat's need to psychologically distance herself from traumatic social interactions",
      "assigned_section": "exposition",
      "chapter": 2,
      "chapter_range": "1-2",
      "pedagogical_tier": 1
    },
    {
      "name": "Symbolism",
      "anchor_phrase": "the crack in the sidewalk that looked",
      "location_percent": 45,
      "scene": "Merricat noting the pointing crack as a permanent landmark",
      "effect": "The crack represents the unchanging nature of the village's hostility and serves as a physical marker of Merricat's traumatic journey",
      "assigned_section": "exposition",
      "chapter": 2,
      "chapter_range": "1-2",
      "pedagogical_tier": 3
    },
    {
      "name": "Foreshadowing",
      "anchor_phrase": "they tell me you're moving away",
      "location_percent": 55,
      "scene": "Jim Donell persistently questioning Merricat about leaving the village",
      "effect": "Hints at future disruption to the Blackwood isolation while showing how the village projects their desires onto the family",
      "assigned_section": "exposition",
      "chapter": 2,
      "chapter_range": "1-2",
      "pedagogical_tier": 3
    },
    {
      "name": "Dramatic Irony",
      "anchor_phrase": "Never can tell what'll grow on",
      "location_percent": 48,
      "scene": "Villagers making veiled comments about the Blackwood property",
      "effect": "The reader understands the dark implications of what 'grows' on Blackwood land while Merricat filters it through her distorted perception",
      "assigned_section": "exposition",
      "chapter": 2,
      "chapter_range": "1-2",
      "pedagogical_tier": 4
    },
    {
      "name": "First-Person Narration",
      "anchor_phrase": "I was never sorry when I had",
      "location_percent": 20,
      "scene": "Merricat reflecting on her violent fantasies about the villagers",
      "effect": "Provides direct access to Merricat's disturbed thought processes, creating intimacy with an unreliable perspective that filters all exposition",
      "assigned_section": "exposition",
      "chapter": 2,
      "chapter_range": "1-2",
      "pedagogical_tier": 5
    },
    {
      "name": "Foreshadowing",
      "anchor_phrase": "A change was coming, and nobody knew it but me",
      "location_percent": 45,
      "scene": "Merricat reflects after the tea party visitors leave",
      "effect": "Creates ominous anticipation while filtering through Merricat's unreliable perception of what constitutes 'change'",
      "assigned_section": "rising_action",
      "chapter": 4,
      "chapter_range": "3-7",
      "pedagogical_tier": 3
    },
    {
      "name": "Dramatic Irony",
      "anchor_phrase": "But if she is a homicidal maniac",
      "location_percent": 15,
      "scene": "Mrs. Wright discussing Constance during the tea party",
      "effect": "Reader sees visitors' horrified fascination with Constance while Merricat presents it as normal social interaction",
      "assigned_section": "rising_action",
      "chapter": 4,
      "chapter_range": "3-7",
      "pedagogical_tier": 4
    },
    {
      "name": "Symbolism",
      "anchor_phrase": "All our land was enriched with my treasures buried in it",
      "location_percent": 60,
      "scene": "Merricat describes her burial rituals and protective objects",
      "effect": "Buried items symbolize Merricat's psychological need for control, presented as rational protection through her distorted lens",
      "assigned_section": "rising_action",
      "chapter": 4,
      "chapter_range": "3-7",
      "pedagogical_tier": 3
    },
    {
      "name": "Repetition",
      "anchor_phrase": "it was their last",
      "location_percent": 85,
      "scene": "Uncle Julian recounting the morning of the murders",
      "effect": "Emphasizes the tragedy's finality while showing how different characters process the same traumatic event",
      "assigned_section": "rising_action",
      "chapter": 4,
      "chapter_range": "3-7",
      "pedagogical_tier": 2
    },
    {
      "name": "Juxtaposition",
      "anchor_phrase": "I can't help it when people are frightened; I always want to frighten them more",
      "location_percent": 25,
      "scene": "Merricat explaining her behavior toward Mrs. Wright",
      "effect": "Contrasts Merricat's cruel impulse with her matter-of-fact tone, revealing her damaged psychology as normal to herself",
      "assigned_section": "rising_action",
      "chapter": 4,
      "chapter_range": "3-7",
      "pedagogical_tier": 3
    },
    {
      "name": "Imagery",
      "anchor_phrase": "the grass was moving in the breeze and the cloud shadows passed back and forth",
      "location_percent": 95,
      "scene": "Merricat walking through the long field",
      "effect": "Creates peaceful natural imagery that contrasts with underlying tension, filtered through Merricat's selective perception",
      "assigned_section": "rising_action",
      "chapter": 4,
      "chapter_range": "3-7",
      "pedagogical_tier": 1
    },
    {
      "name": "First-Person Narration",
      "anchor_phrase": "I was laughing when I came back into the drawing room",
      "location_percent": 20,
      "scene": "Merricat's reaction after the visitors leave",
      "effect": "Maintains subjective filter showing Merricat's amusement at others' discomfort, revealing her disconnection from normal empathy",
      "assigned_section": "rising_action",
      "chapter": 4,
      "chapter_range": "3-7",
      "pedagogical_tier": 5
    },
    {
      "name": "Motif",
      "anchor_phrase": "MELODY GLOUCESTER PEGASUS",
      "location_percent": 70,
      "scene": "Merricat's magical protective words",
      "effect": "Recurring magical thinking motif shows Merricat's psychological coping mechanisms presented as logical protective measures",
      "assigned_section": "rising_action",
      "chapter": 4,
      "chapter_range": "3-7",
      "pedagogical_tier": 3
    },
    {
      "name": "First-Person Narration",
      "anchor_phrase": "I am on the moon, I thought",
      "location_percent": 45,
      "scene": "Merricat's psychological escape during the mob's destruction",
      "effect": "Filters the climactic destruction through Merricat's damaged psyche, showing her retreat into fantasy when reality becomes unbearable",
      "assigned_section": "climax",
      "chapter": 8,
      "chapter_range": "8",
      "pedagogical_tier": 5
    },
    {
      "name": "Dramatic Irony",
      "anchor_phrase": "The way you did before?",
      "location_percent": 85,
      "scene": "Constance and Merricat's first direct acknowledgment of the murders",
      "response": "Creates gap between reader understanding and character delusion - we know Merricat was the poisoner while she maintains her protective fantasy",
      "assigned_section": "climax",
      "chapter": 8,
      "chapter_range": "8",
      "pedagogical_tier": 4
    },
    {
      "name": "Juxtaposition",
      "anchor_phrase": "Let it burn",
      "location_percent": 35,
      "scene": "Villagers calling for destruction while firemen work to save the house",
      "effect": "Contrasts civilized duty with mob mentality, revealing the community's true violent nature beneath social facades",
      "assigned_section": "climax",
      "chapter": 8,
      "chapter_range": "8",
      "pedagogical_tier": 3
    },
    {
      "name": "Repetition",
      "anchor_phrase": "Merricat, said Constance, would you like",
      "location_percent": 50,
      "scene": "Mob chanting the poisoning rhyme while destroying the house",
      "effect": "Creates rhythmic mob mentality while forcing Merricat to confront the reality of her crime through communal memory",
      "assigned_section": "climax",
      "chapter": 8,
      "chapter_range": "8",
      "pedagogical_tier": 2
    },
    {
      "name": "Imagery",
      "anchor_phrase": "finger of flame reach out to touch",
      "location_percent": 8,
      "scene": "Fire spreading through the house",
      "effect": "Personifies the destructive force as organic and alive, filtering the destruction through Merricat's animistic perception of the world",
      "assigned_section": "climax",
      "chapter": 8,
      "chapter_range": "8",
      "pedagogical_tier": 1
    },
    {
      "name": "Symbolism",
      "anchor_phrase": "We are on the moon at last",
      "location_percent": 92,
      "scene": "Merricat and Constance in their forest hideout",
      "effect": "The moon represents complete isolation from society - Merricat's fantasy of escape becomes literal reality as they retreat from the world",
      "assigned_section": "climax",
      "chapter": 8,
      "chapter_range": "8",
      "pedagogical_tier": 3
    },
    {
      "name": "Situational Irony",
      "anchor_phrase": "There has been a death in this house",
      "location_percent": 75,
      "scene": "Jim Clarke dispersing the destructive mob after Uncle Julian's death",
      "effect": "The natural death stops the mob violence, when previous unnatural deaths had created it - death becomes both destroyer and savior",
      "assigned_section": "climax",
      "chapter": 8,
      "chapter_range": "8",
      "pedagogical_tier": 4
    },
    {
      "name": "Foreshadowing",
      "anchor_phrase": "I am going to put death in all their food",
      "location_percent": 88,
      "scene": "Merricat's threat after witnessing the village destruction",
      "effect": "Previews the sisters' future isolation and Merricat's unchanged murderous nature, suggesting the cycle of violence will continue",
      "assigned_section": "climax",
      "chapter": 8,
      "chapter_range": "8",
      "pedagogical_tier": 3
    },
    {
      "name": "First-Person Narration",
      "anchor_phrase": "I do not know when I found",
      "location_percent": 5,
      "scene": "Merricat's confusion about the sequence of events in the aftermath",
      "effect": "Establishes the subjective, damaged lens through which all events are filtered, showing temporal disorientation that reveals psychological fragmentation",
      "assigned_section": "falling_action",
      "chapter": 9,
      "chapter_range": "9",
      "pedagogical_tier": 5
    },
    {
      "name": "Imagery",
      "anchor_phrase": "shocking smell of wetness and burned wood",
      "location_percent": 25,
      "scene": "Merricat opens the dining room door to survey damage",
      "effect": "Creates visceral sensory details filtered through Merricat's selective perception, emphasizing destruction while maintaining her detached, observational tone",
      "assigned_section": "falling_action",
      "chapter": 9,
      "chapter_range": "9",
      "pedagogical_tier": 1
    },
    {
      "name": "Juxtaposition",
      "anchor_phrase": "our mother's portrait looking down on us graciously",
      "location_percent": 40,
      "scene": "The undamaged portrait overlooking the destroyed drawing room",
      "effect": "Contrasts the intact past with present destruction, revealing Merricat's fixation on preserving family legacy despite reality",
      "assigned_section": "falling_action",
      "chapter": 9,
      "chapter_range": "9",
      "pedagogical_tier": 3
    },
    {
      "name": "Symbolism",
      "anchor_phrase": "Dresden figurine standing small and courageous",
      "location_percent": 60,
      "scene": "Constance places the rescued figurine under their mother's portrait",
      "effect": "The figurine represents their fragile but persistent insularity, maintaining dignity within their shrinking world as filtered through Merricat's romanticizing perspective",
      "assigned_section": "falling_action",
      "chapter": 9,
      "chapter_range": "9",
      "pedagogical_tier": 3
    },
    {
      "name": "Dramatic Irony",
      "anchor_phrase": "I put it in the sugar",
      "location_percent": 85,
      "scene": "Merricat and Constance's confession about the poisoning",
      "effect": "Reveals the truth readers suspected while showing how Merricat's narration has filtered this crucial information, demonstrating the gap between her perception and reality",
      "assigned_section": "falling_action",
      "chapter": 9,
      "chapter_range": "9",
      "pedagogical_tier": 4
    },
    {
      "name": "Repetition",
      "anchor_phrase": "we closed the drawing-room door behind us",
      "location_percent": 45,
      "scene": "Systematic closing off of damaged rooms",
      "effect": "Emphasizes their ritual of containment and isolation, reinforcing the pattern of psychological withdrawal presented through Merricat's matter-of-fact narration",
      "assigned_section": "falling_action",
      "chapter": 9,
      "chapter_range": "9",
      "pedagogical_tier": 2
    },
    {
      "name": "Metaphor",
      "anchor_phrase": "Our house was a castle, turreted",
      "location_percent": 50,
      "scene": "Merricat viewing the fire-damaged upper floors",
      "effect": "Transforms destruction into romantic imagery, showing how Merricat's damaged psyche reframes trauma into fairy-tale terms that preserve her insular worldview",
      "assigned_section": "falling_action",
      "chapter": 9,
      "chapter_range": "9",
      "pedagogical_tier": 1
    },
    {
      "name": "First-Person Narration",
      "anchor_phrase": "I would go at once down the hall",
      "location_percent": 5,
      "scene": "Merricat describing her morning routine of checking the front door",
      "effect": "Maintains the subjective lens filtering all experiences through Merricat's damaged psyche, allowing her to rationalize their isolation as protective rather than tragic",
      "assigned_section": "resolution",
      "chapter": 10,
      "chapter_range": "10",
      "pedagogical_tier": 5
    },
    {
      "name": "Unreliable Narrator",
      "anchor_phrase": "they seemed a little uneasy playing in front of our house",
      "location_percent": 8,
      "scene": "Merricat observing children playing on their lawn",
      "effect": "Creates dramatic irony as Merricat's paranoid interpretation of innocent children playing reveals the gap between her perception and reality",
      "assigned_section": "resolution",
      "chapter": 10,
      "chapter_range": "10",
      "pedagogical_tier": 5
    },
    {
      "name": "Dramatic Irony",
      "anchor_phrase": "I wondered how soon they would creep onto the porch",
      "location_percent": 12,
      "scene": "Merricat watching children play and imagining threatening behavior",
      "effect": "Reader understands the children are harmless while Merricat sees them as threatening, highlighting her distorted worldview through the insular perception pattern",
      "assigned_section": "resolution",
      "chapter": 10,
      "chapter_range": "10",
      "pedagogical_tier": 4
    },
    {
      "name": "Symbolism",
      "anchor_phrase": "I am thinking that we are on the moon",
      "location_percent": 25,
      "scene": "Merricat explaining her happiness to Constance over breakfast",
      "effect": "The moon symbolizes complete isolation from the world, showing how Merricat's damaged psyche transforms their tragic situation into a fantasy of escape",
      "assigned_section": "resolution",
      "chapter": 10,
      "chapter_range": "10",
      "pedagogical_tier": 3
    },
    {
      "name": "Juxtaposition",
      "anchor_phrase": "We are going to be very happy",
      "location_percent": 65,
      "scene": "Merricat comforting Constance who is distressed about their reduced circumstances",
      "effect": "Contrasts Merricat's delusional optimism with their actual dire situation, emphasizing how her unreliable narration filters tragedy into perceived happiness",
      "assigned_section": "resolution",
      "chapter": 10,
      "chapter_range": "10",
      "pedagogical_tier": 3
    },
    {
      "name": "Repetition",
      "anchor_phrase": "We are so happy",
      "location_percent": 95,
      "scene": "Final moments of the chapter with Merricat and Constance settled in their new routine",
      "effect": "The repeated insistence on happiness reinforces Merricat's need to convince herself and others of their contentment, revealing the psychological defense mechanism of her unreliable narration",
      "assigned_section": "resolution",
      "chapter": 10,
      "chapter_range": "10",
      "pedagogical_tier": 2
    },
    {
      "name": "Imagery",
      "anchor_phrase": "great ruined structure overgrown with vines",
      "location_percent": 90,
      "scene": "Description of how outsiders view their house",
      "effect": "Visual imagery creates the gothic atmosphere while showing how Merricat's insular perception transforms their ruined home into a protective fortress rather than a symbol of destruction",
      "assigned_section": "resolution",
      "chapter": 10,
      "chapter_range": "10",
      "pedagogical_tier": 1
    },
    {
      "name": "Motif",
      "anchor_phrase": "I checked to make sure that the front door was locked",
      "location_percent": 85,
      "scene": "Recurring action throughout the chapter of Merricat checking the door",
      "effect": "The locked door motif represents Merricat's psychological barriers, showing how her damaged psyche creates rituals that reinforce their isolation while she perceives them as protective measures",
      "assigned_section": "resolution",
      "chapter": 10,
      "chapter_range": "10",
      "pedagogical_tier": 3
    }
  ]
}