{
  "metadata": {
    "title": "Regeneration",
    "author": "Pat Barker",
    "edition": "Penguin Books, 1992",
    "creation_date": "2025-12-10T20:06:56.087133",
    "protocol_version": "4.0",
    "kernel_version": "5.0",
    "chapter_aware": true,
    "structure_alignment_protocol": "v1.1",
    "device_density_optimization": true
  },
  "text_structure": {
    "has_chapters": true,
    "total_chapters_estimate": 23,
    "notes": "Chapter breaks identified during kernel creation"
  },
  "structure_detection": {
    "structure_type": "NEST",
    "total_units": 23,
    "special_elements": [],
    "notes": "Nested structure with four parts containing numbered chapters (Part One: 1-7, Part Two: 8-13, Part Three: 14-16, Part Four: 17-23)"
  },
  "chapter_alignment": {
    "exposition": {
      "chapter_range": "1-3",
      "chapters": [
        1,
        2,
        3
      ],
      "primary_chapter": 1,
      "percentage": 13
    },
    "rising_action": {
      "chapter_range": "4-13",
      "chapters": [
        4,
        5,
        6,
        7,
        8,
        9,
        10,
        11,
        12,
        13
      ],
      "primary_chapter": 8,
      "percentage": 43
    },
    "climax": {
      "chapter_range": "14-15",
      "chapters": [
        14,
        15
      ],
      "primary_chapter": 14,
      "percentage": 9
    },
    "falling_action": {
      "chapter_range": "16-21",
      "chapters": [
        16,
        17,
        18,
        19,
        20,
        21
      ],
      "primary_chapter": 19,
      "percentage": 26
    },
    "resolution": {
      "chapter_range": "22-23",
      "chapters": [
        22,
        23
      ],
      "primary_chapter": 23,
      "percentage": 9
    }
  },
  "chapter_optimization": {
    "exposition": {
      "chapter_range": "1-3",
      "narrative_primary": 1,
      "optimized_primary": 2,
      "device_density_score": 54.03745778323611,
      "improvement_percent": 2.3255813953488387,
      "optimization_applied": true,
      "chapter_text": "inthat last scrap.” You don’t talk like that if you’ve watched them die.’‘No intelligent or sensitive person would talk like that anyway.’A slightly awkward pause. ‘I’m not saying there are no exceptions.’Rivers laughed. ‘The point is you hate civilians, don’t you? The“callous”, the “complacent”, the “unimaginative”. Or is “hate” too strong aword?’‘No.’‘So. What you felt for the Germans, rather briefly, in the spring of lastyear, you now feel for the overwhelming majority of your fellow-countrymen?’‘Yes.’‘You know, I think you were quite right not to say too much to theBoard.’‘That wasn’t my idea, it was Graves’s. He was afraid I’d sound too sane.’‘When you said the Board was “rigged”, what did you mean?’‘I meant the decision to send me here, or or somewhere similar, had beentaken before I went in.’‘And this had all been fixed by Captain Graves?’‘Yes.’ Sassoon leant forward. ‘The point is they weren’t going to court-martial me. They were just going to lock me up somewhere …’ He lookedround the room. ‘Worse than this.’Rivers smiled. ‘There are worse places, believe me.’‘I’m sure there are,’ Sassoon said politely.‘They were going to certify you, in fact?’‘I suppose so.’‘Did anybody on the Board say anything to you about this?’‘No, because it was –’‘All fixed beforehand. Yes, I see.’Sassoon said, ‘May I ask you a question?’‘Go ahead’‘Do you think I’m mad?’‘No, of course you’re not mad. Did you think you were going mad?’‘It crossed my mind. You know when you’re brought face to face withthe fact that, yes, you did see corpses on the pavement …’‘Hallucinations in the half-waking state are surprisingly common, youknow. They’re not the same thing as psychotic hallucinations. Childrenhave them quite frequently.’Sassoon had started pulling at a loose thread on the breast of his tunic.Rivers watched him for a while. ‘You must’ve been in agony when you didthat.’Sassoon lowered his hand. ‘No-o. Agony’s lying in a shell-hole with yourlegs shot off. I was upset.’ For a moment he looked almost hostile, then herelaxed. ‘It was a futile gesture. I’m not particularly proud of it.’‘You threw it in the Mersey, didn’t you?’‘Yes. It wasn’t heavy enough to sink, so it just’ – a glint of amusement –‘bobbed around. There was a ship sailing past, quite a long way out, in theestuary, and I looked at this little scrap of ribbon floating and I looked at theship, and I thought that me trying to stop the war was a bit like trying tostop the ship would have been. You know, all they’d’ve seen from the deckwas this little figure jumping up and down, waving its arms, and theywouldn’t’ve known what on earth it was getting so excited about.’‘So you realized then that it was futile?’Sassoon lifted his head. ‘It still had to be done. You can’t just acquiesce.’Rivers hesitated. ‘Look, I think we’ve … we’ve got about as far as wecan get today. You must be very tired.’ He stood up. ‘I’ll see you tomorrowmorning at ten. Oh, and could you ask Captain Graves to see me as soon ashe arrives?’Sassoon stood up. ‘You said a bit back you didn’t think I was mad.’‘I’m quite sure you’re not. As a matter of fact I don’t even think you’vegot a war neurosis.’Sassoon digested this. ‘What have I got, then?’‘You seem to have a very powerful anti-war neurosis.’They looked at each other and laughed. Rivers said, ‘You realize, don’tyou, that it’s my duty to … to try to change that? I can’t pretend to beneutral.’Sassoon’s glance took in both their uniforms. ‘No, of course not.’Rivers made a point of sitting next to Bryce at dinner.‘Well,’ Bryce said, ‘what did you make of him?’‘I can’t find anything wrong. He doesn’t show any sign of depression,he’s not excited –’‘Physically?’‘Nothing.’‘Perhaps he just doesn’t want to be killed.’‘Oh, I think he’d be most insulted if you suggested that. To be fair, he didhave a job lined up in Cambridge, training cadets – so it isn’t a question ofavoiding being sent back. He could’ve taken that if he’d wanted to save hisskin.’‘Any trace of … er … religious enthusiasm?’‘No, I’m afraid not. I was hoping for that too.’They looked at each other, amused. ‘You know, the curious thing is Idon’t think he’s even a pacifist? It seems to be entirely a matter of horror atthe extent of the slaughter, combined with a feeling of anger that thegovernment won’t state its war aims and impose some kind of limitation onthe whole thing. That, and an absolutely corrosive hatred of civilians. Andnon-combatants in uniform.’‘What an uncomfortable time you must’ve had.’‘No-o, I rather gather I was seen as an exception.’Bryce looked amused. ‘Did you like him?’‘Yes, very much. And I found him … much more impressive than Iexpected.’Sassoon, at his table under the window, sat in silence. The men on eitherside of him stammered so badly that conversation would have beenimpossible, even if he had wished for it, but he was content to withdrawinto his own thoughts.He remembered the day before Arras, staggering from the outpost trenchto the main trench and back again, carrying boxes of trench mortar bombs,passing the same corpses time after time, until their twisted and blackenedshapes began to seem like old friends. At one point he’d had to pass twohands sticking up out of a heap of pocked and pitted chalk, like the roots ofan overturned tree. No way of telling if they were British or German hands.No way of persuading himself it mattered.‘Do you play golf?’‘I’m sorry?’‘I asked if you played golf.’Small blue eyes, nibbled gingery moustache, an RAMC badge. He heldout his hand. ‘Ralph Anderson.’Sassoon shook hands and introduced himself. ‘Yes, I do.’‘What’s your handicap?’Sassoon told him. After all, why not? It seemed an entirely suitable topicfor Bedlam.‘Ah, then we might have a game.’‘I’m afraid I haven’t brought my clubs.’‘Send for them. Some of the best courses in the country round here.’Sassoon had opened his mouth to reply when a commotion started nearthe door. As far as he could tell, somebody seemed to have been sick. Atany rate, a thin, yellow-skinned man was on his feet, choking and gagging.A couple of VADs ran across to him, clucking, fussing, flappingineffectually at his tunic with a napkin, until eventually they had the senseto get him out of the room. The swing doors closed behind them. Amoment’s silence, and then, as if nothing had happened, the buzz ofconversation rose again.Rivers stood up and pushed his plate away. ‘I think I’d better go.’‘Why not wait till you’ve finished?’ Bryce said. ‘You eat little enough asit is.’Rivers patted his midriff. ‘Oh, I shan’t fade away just yet.’Whenever Rivers wanted to get to the top floor without being stoppedhalf a dozen times on the way, he used the back staircase. Pipes lined thewalls, twisting with the turning of the stair, gurgling from time to time likelengths of human intestine. It was dark, the air stuffy, and sweat began toprickle in the roots of his hair. It was a relief to push the swing door openand come out on to the top corridor, where the air was cool at least, thoughhe never failed to be depressed by the long narrow passage with its doublerow of brown doors and the absence of natural light. ‘Like a trench withoutthe sky’ had been one patient’s description, and he was afraid it was onlytoo accurate.Burns was sitting on his bed, while two VADs helped him off with histunic and shirt. His collar bones and ribs were clearly visible beneath theyellowish skin. The waistband of his breeches gaped.One of the VADs tugged at it. ‘There’s room for two in there,’ she said,smiling, coaxing. ‘Have I to get in with you?’ The other VAD’s frozenexpression warned her of Rivers’s presence. ‘I’ll get this sponged down foryou, Captain.’They hurried past Rivers, bursting into nervous giggles as they reachedthe end of the corridor.Burns’s arms were goose-pimpled, though the room was not cold. Thesmell of vomit lingered on his breath. Rivers sat down beside him. Hedidn’t know what to say, and thought it better to say nothing. After a whilehe felt the bed begin to shake and put his arm round Burns’s shoulders. ‘Itdoesn’t get any better, does it?’ he said.Burns shook his head. After a while Rivers got up, fetched Burns’s coatfrom the peg behind the door and wrapped it round his shoulders. ‘Would itbe easier to eat in your own room?’‘A bit. I wouldn’t have to worry about upsetting other people.’Yes, Burns would worry about upsetting other people. Perhaps the mostdistressing feature of his case was the occasional glimpse of the cheerfuland likeable young man he must once have been.Rivers looked down at Burns’s forearms, noting that the groove betweenradius and ulna was even deeper than it had been a week ago. ‘Would ithelp to have a bowl of fruit in your room?’ he asked. ‘So you could justpick something up when you felt like it?’‘Yes, that might help.’Rivers got up and walked across to the window. He’s agreeing to makeme feel useful, he thought. ‘All right, I’ll get them to send something up.’The shadows of the beech trees had begun to creep across the tennis courts,which were empty now. Rivers turned from the window. ‘What kind ofnight did you have?’‘Not too good.’‘Have you made any progress with what we talked about?’‘Not really.’ He looked up at Rivers. ‘I can’t make myself think about it.’‘No, well, it’s early days.’‘You know, the worst thing is …’ – Burns was scanning Rivers’s face –‘that it’s a … a joke.’‘Yes.’After leaving Burns, Rivers went up a further short flight of stairs andunlocked the door to the tower. Apart from his own bedroom, this was theonly place in Craiglockhart he could hope to be alone for more than a fewminutes. The patients weren’t allowed out here, in case the hundred-footdrop to the path below should prove too tempting an exit from the war. Herested his arms on the iron balustrade and looked out towards the hills.Burns. Rivers had become adept at finding bearable aspects to unbearableexperiences, but Burns defeated him. What had happened to him was sovile, so disgusting, that Rivers could find no redeeming feature. He’d beenthrown into the air by the explosion of a shell and had landed, head-first, ona German corpse, whose gas-filled belly had ruptured on impact. BeforeBurns lost consciousness, he’d had time to realize that what filled his noseand mouth was decomposing human flesh. Now, whenever he tried to eat,that taste and smell recurred. Nightly, he relived the experience, and fromevery nightmare he awoke vomiting. Burns on his knees, as Rivers hadoften seen him, retching up the last ounce of bile, hardly looked like ahuman being at all. His body seemed to have become merely the skin-and-bone casing for a tormented alimentary canal. His suffering was withoutpurpose or dignity, and yes, Rivers knew exactly what Burns meant whenhe said it was a joke.Rivers became aware that he was gripping the edge of the parapet andconsciously relaxed his hands. Whenever he spent any time with Burns, hefound himself plagued by questions that in Cambridge, in peacetime, hemight have wanted to pursue, but which in wartime, in an overcrowdedhospital, were no use to him at all. Worse than useless, since they drainedhim of energy that rightly belonged to his patients. In a way, all this hadnothing to do with Burns. The sheer extremity of his suffering set him apartfrom the rest, but the questions were evoked by almost every case.He looked down and saw a taxi turn into the drive. Perhaps this was theerrant Captain Graves arriving at last? Yes, there was Sassoon, tooimpatient to wait indoors, running down the steps to meet him.THREEGraves, his mouth slightly open, stared up at the massive yellow-greyfaçade of Craiglockhart. ‘My God.’Sassoon followed the direction of his gaze. ‘That’s what I thought.’Graves picked up his bag and together they went up the steps, throughthe black and white tiled entrance hall on to the main corridor. Sassoonbegan to smile. ‘Fine prisoner’s escort you turned out to be.’‘I know, I’m sorry. God, what a day. Do you know, the train stopped atevery station?’‘Well, you’re here now. Thank God.’Graves looked sideways at him. ‘As bad as that?’‘Hm. So-so.’‘I don’t suppose you’ve seen anybody yet?’‘I’ve seen Rivers. Which reminds me, he wants to see you, but I imagineit’ll be all right if you dump your bag first.’Graves followed Sassoon up the marble staircase to the first floor.‘Here we are.’ Sassoon opened a door and stood aside to let Graves enter.‘The guest room. You’ve even got a lock on your door.’‘You haven’t?’‘No. Nor in the bathroom either.’‘Poor old Sass, you’ll just have to fight the VADs off.’ Graves swung hisbag on to the nearest chair. ‘No, seriously, what’s it like?’‘Seriously, it’s awful. Come on, the sooner you’ve seen Rivers the soonerwe can talk.’‘Sassoon asked me to give you this.’Rivers took the envelope without comment and placed it unopened on hisdesk. ‘How did you find him?’The net curtains breathed in the draught from the open window, and ascent of lime trees invaded the room. A sweet smell. Graves, to whom allsweet smells were terrible, wiped the sweat from his upper lip. ‘Calmer. Ithink it’s a relief to have things sorted out.’‘I don’t know how sorted out they are. You do realize, don’t you, that hecan walk out of here at any time?’‘He won’t do that,’ Graves said definitely. ‘He’ll be all right now. Aslong as the pacifists leave him alone.’‘I had quite a long talk with him this afternoon, but I don’t think I’mquite clear what happened. I suspect there was a lot going on behind thescenes?’Graves smiled. ‘You could say that.’‘What exactly?’‘Sassoon sent me a copy of his Declaration. I was in a convalescent homeon the Isle of Wight at the time –’‘He hadn’t talked to you about it?’‘No, I haven’t seen him since January. I was absolutely horrified. I couldsee at once it wouldn’t do any good, nobody would follow his example.He’d just destroy himself, for no reason.’ He stopped. When he spokeagain, his voice was very clear and precise. ‘Sassoon’s the best platooncommander I’ve ever known. The men worship him – if he wanted Germanheads on a platter they’d get them. And he loves them. Being separatedfrom them would kill him. And that’s exactly what a court-martial would’vedone.’‘He’s separated from them here.’‘Yes, but there’s a way back. People can accept a breakdown. There’s noway back from being a conchie.’‘So you decided he –’‘Had to be stopped? Yes. I wrote to the CO, asking him to get Siegfriedanother Board. He’d already skipped one. Then I contacted various people Iknow and managed to persuade them to treat it as a nervous breakdown.That left Siegfried. I knew it was no use writing. I had to see him, so I gotmyself passed fit and went back to Litherland. He was in a shocking state.He’d just thrown his MC into the Mersey. Did he tell you that?’Rivers hesitated. ‘I believe it was in the Board’s report.’‘Anyway, it took a long time, but he saw sense in the end.’‘What made him give in, do you think?’‘He just couldn’t go on denying he was ill.’Rivers didn’t reply. The silence deepened, like a fall of snow,accumulating second by second, flake by flake, each flake by itselfinconsiderable, until everything is transformed.‘No, it wasn’t that.’ Graves’s knobbly, broken-nosed boxer’s facetwitched. ‘I lied to him.’Rivers’s glasses flashed as he lifted his head. ‘Yes, I thought perhaps youhad.’‘I swore on the Bible they wouldn’t court-martial him, but I didn’t knowthat. I think if he’d held out, they might’ve done.’‘They might. But you know the advantages of treating this as a nervousbreakdown would have been quite apparent to the authorities, even withoutyour pointing them out.’‘The fact remains I lied, and he gave in because he believed the lie. Hewouldn’t have believed it from anybody else.’ He paused. ‘Do you think Iwas wrong?’Rivers said gently, ‘I think you did the best you could for your friend.Not the best thing for his cause, but then the cause is lost anyway. Did youfind the Board difficult to convince?’‘Quite. There was one youngish man who was sympathetic. The othertwo … Well. I got the impression they didn’t believe in shell-shock at all.As far as they were concerned, it was just cowardice. I made up my mindright from the start they weren’t going to think that. I told them about lastyear when he took a German trench single-handed and got recommendedfor the VC. I’d like to see them do it. And this April. You know, thatbombing expedition of his was fantastic. Everybody I’ve spoken to whowas there thinks he should’ve got the VC for that.’ He paused. ‘I justwanted them to know what kind of man they were dealing with.’ He smiled.‘I kept bursting into tears. I think that helped in a way. I could see themthinking, My God, if this one’s fit for duty what can the other one be like?’‘And you told them that he had hallucinations?’‘Yes.’ Graves looked slightly uncomfortable. ‘I had to convince them.There were a lot of things I didn’t tell them. I didn’t tell them he’dthreatened to kill Lloyd George.’‘And you persuaded him to say nothing?’‘Yes. The last thing we needed was Siegfried talking sense about thewar.’‘Sense? You mean you agree with him?’‘Well, yes. In theory. In theory the war should stop tomorrow, but itwon’t. It’ll go on till there isn’t a cat or a dog left to enlist.’‘So you agree with his views, but not his actions? Isn’t that rather anartificial distinction?’‘No, I don’t think it is. The way I see it, when you put the uniform on, ineffect you sign a contract. And you don’t back out of a contract merelybecause you’ve changed your mind. You can still speak up for yourprinciples, you can argue against the ones you’re being made to fight for,but in the end you do the job. And I think that way you gain more respect.Siegfried isn’t going to change people’s minds like this. It may be in him tochange people’s minds about the war, but this isn’t the way to do it.’Rivers took his clasped hands away from his mouth. ‘I couldn’t agreewith you more.’‘What’s infuriating is that basically he knows it better than anybody. He’sthe one who can communicate with the ordinary soldier. It’s just that he gottaken over by Bertrand Russell and Ottoline Morrell. You know, I used toadmire them. I used to think, well, I don’t agree with you, but, on the otherhand, I can see it takes courage …’ He shook his head. ‘Not any more. Iknow Russell’s over military age, Ottoline’s a woman, fair enough, neitherof them can understand what he’s been through, but they could see the statehe was in, and they still went ahead. They were quite prepared to destroyhim for the sake of propagating their views. I don’t forgive them for it.’ Hemade a visible effort to calm down. ‘Anyway, it’s over now. But I must sayit gave me great pleasure to write to Russell and tell him Sassoon was onhis way here, and he could just bloody well leave him alone in future.’‘And what about you?’ Rivers asked, after a pause. ‘Do you think they’llsend you back?’‘No, I don’t think so. In fact, the battalion doctor told me if he ever foundmy lungs in France again, he’d shoot me himself. I’m hoping for Palestine.’A pause. ‘I’m glad he’s here. At least I can go back to Litherland knowinghe’s safe.’‘I hope he is.’ Rivers stood up. ‘And now I think I should let you getback to him. He’ll need company on his first evening.’After Graves had gone, Rivers sat for a while resting his eyes, thenopened the envelope Graves had",
      "density_breakdown": {
        "Metaphor": 3.3773411114522567,
        "Simile": 3.3773411114522567,
        "Imagery": 9.2109303039607,
        "Symbolism": 10.13202333435677,
        "Dialogue": 0.0,
        "Foreshadowing": 12.588271415412958,
        "Juxtaposition": 10.13202333435677,
        "Repetition": 5.219527172244397,
        "TOTAL_DENSITY": 54.03745778323611
      }
    },
    "rising_action": {
      "chapter_range": "4-13",
      "narrative_primary": 8,
      "optimized_primary": 8,
      "device_density_score": 64.14978514426028,
      "improvement_percent": 0.0,
      "optimization_applied": false,
      "chapter_text": "have.’A long silence. ‘I suppose you haven’t heard from the CO?’‘No, I’d tell you if I had.’Prior sat brooding for a while. ‘Well, I suppose we go on waiting.’ Heleant forward to stub his cigarette out. ‘You know, you once told me I had towin.’ He shook his head. ‘You’re the one who has to win.’‘This may come as a shock, Mr Prior, but I had been rather assuming wewere on the same side.’Prior smiled. ‘This may come as a shock, Dr Rivers, but I had beenrather assuming that we were not.’Silence. Rivers caught and held a sigh. ‘That does make the relationshipof doctor and patient rather difficult.’Prior shrugged. Obviously he didn’t think that was his problem. ‘Youthink you know what happened, don’t you?’ Rivers said.‘I’ve told you I don’t remember.’The antagonism was startling. They might’ve been back at the beginning,when it had been almost impossible to get a civil word out of him. ‘I’msorry, I didn’t make myself clear. I wasn’t suggesting you knew, only thatyou might have a theory.’Prior shook his head. ‘No. No theory.’A short, dark-haired man sidled round the door, blinking in the suddenblaze of sunlight. Sassoon, sitting on the bed, looked up from the golf clubhe’d been cleaning. ‘Yes?’‘I’ve b-brought these.’A stammer. Not as bad as some, but bad enough. Sassoon exerted himselfto be polite. ‘What is it? I can’t see.’Books. His book. Five copies, no less. ‘My God, a reader.’‘I wondered if you’d b-be k-kind enough to s-sign them?’‘Yes, of course.’ Sassoon put the golf club down and reached for his pen.He could have dispatched the job in a few moments, but he sensed that hisvisitor wanted to talk, and he had after all bought five copies. Sassoon wascurious. ‘Why five? Has the War Office put it on a reading list?’‘They’re f-for m-my f-family.’Oh, dear. Sassoon transferred himself from bed to table and opened thefirst book. ‘What name shall I write?’‘Susan Owen. M-y m-mother.’Sassoon began to write. Paused. ‘Are you … quite sure your motherwants to be told that “Bert’s gone syphilitic?” I had trouble getting them toprint that.’‘It w-won’t c-come as a sh-shock.’‘Won’t it?’ One could only speculate on the nature of Mrs Owen’sprevious acquaintance with Bert.‘I t-tell her everything. In m-my l-letters.’‘Good heavens,’ Sassoon said lightly, and turned back to the book.Owen looked down at the back of Sassoon’s neck, where a thin line ofkhaki was just visible beneath the purple silk of his dressing gown. ‘Don’tyou?’Sassoon opened his mouth and shut it again. ‘My brother died atGallipoli,’ he said, at last. ‘I think my mother has enough on her platewithout any searing revelations from me.’‘I s-suppose she m-must b-be c-concerned about your b-being here.’‘Oh, I don’t think so. On the contrary. I believe the thought of myinsanity is one of her few consolations.’ He glanced up, briefly. ‘Better madthan a pacifist.’ When Owen continued to look blank, he added, ‘You doknow why I’m here?’‘Yes.’‘And what do you think about that?’‘I agreed with every w-word.’Sassoon smiled. ‘So did my friend Graves.’ He opened the next book.‘Who’s this one for?’Owen, feeding the names, would have given anything to say one sentencewithout stammering. No hope of that – he was far too nervous. Everythingabout Sassoon intimidated him. His status as a published poet, his height,his good looks, the clipped aristocratic voice, sometimes quick, sometimeshalting, but always cold, the bored expression, the way he had of notlooking at you when you spoke – shyness, perhaps, but it seemed likearrogance. Above all, his reputation for courage. Owen had his own reasonsfor being sensitive about that.Sassoon reached the last book. Owen felt the meeting begin to slip awayfrom him. Rather desperately, he said, ‘I l-liked “The D-Death B-Bed” b-best.’ And suddenly he relaxed. It didn’t matter what this Sassoon thoughtabout him, since the real Sassoon was in the poems. He quoted, frommemory, ‘ “He’s young; he hated War, how should he die/When cruel oldcampaigners win safe through?/But death replied: ‘I choose him.’ So hewent.” That’s beautiful.’Sassoon paused in his signing. ‘Yes, I – I was quite pleased with that.’‘Oh, and “The Redeemer”. “He faced me, reeling in hisweariness,/Shouldering his load of planks, so hard to bear./I say that He wasChrist, who wrought to bless …” ’ He broke off. ‘I’ve been wanting to writethat for three years.’‘Perhaps you should be glad you didn’t.’The light faded from Owen’s face. ‘Sorry?’‘Well, don’t you think it’s rather easily said? “I say that He was Christ”?’‘You m-mean you d-didn’t m-mean it?’‘Oh, I meant it. The book isn’t putting one point of view, it’s charting the– the evolution of a point of view. That’s probably the first poem that evenattempts to look at the war realistically. And that one doesn’t go nearly farenough.’ He paused. ‘The fact is Christ isn’t on record as having lobbedmany Mills bombs.’‘No, I s-see what you m-mean. I’ve been thinking about that quite a b-bitrecently.’Sassoon scarcely heard him. ‘I got so sick of it in the end. All thoseCalvaries at crossroads just sitting there waiting to be turned into symbols. Iknew a man once, Potter his name was. You know the miraculous crucifixstories? “Shells falling all around, but the figure of Our Lord was spared”?Well, Potter was so infuriated by them he decided to start a one-mancampaign. Whenever he saw an undamaged crucifix, he used it for targetpractice. You could hear him for miles. “ONE, TWO, THREE, FOUR,Bastard on the Cross, FIRE!” There weren’t many miraculous crucifixes inPotter’s section of the front.’ He hesitated. ‘But perhaps I shouldn’t besaying this? I mean for all I know, you’re –’‘I don’t know what I am. But I do know I wouldn’t want a f-faith thatcouldn’t face the facts.’Sassoon became aware that Owen was standing at his elbow, almost likea junior officer. ‘Why don’t you sit down?’ he said, waving him towards thebed. ‘And tell me your name. I take it this one’s for you?’‘Yes. Wilfred. Wilfred Owen.’Sassoon blew on his signature and closed the book. ‘You say you’ve beenthinking about it?’Owen looked diffident. ‘Yes.’‘To any effect? I mean, did you reach any conclusions?’‘Only that if I were going to call myself a Christian, I’d have to callmyself a pacifist as well. I don’t think it’s possible to c-call yourself a C-Christian and … and j-just leave out the awkward bits.’‘You’ll never make a bishop.’‘No, well, I think I can live with that.’‘And do you call yourself a pacifist?’A long pause. ‘No. Do you?’‘No.’‘It’s funny, you know, I never thought about it at all in France.’‘No, well, you don’t. Too busy, too tired.’ Sassoon smiled. ‘Too healthy.’‘It’s not just that, though, is it? Sometimes when you’re alone, in thetrenches, I mean, at night you get the sense of something ancient. As if thetrenches had always been there. You know one trench we held, it had skullsin the side. You looked back along and … Like mushrooms. And do youknow, it was actually easier to believe they were men from Marlborough’sarmy than to to to think they’d been alive two years ago. It’s as if all otherwars had somehow … distilled themselves into this war, and that makes itsomething you … almost can’t challenge. It’s like a very deep voice saying,Run along, little man. Be thankful if you survive.’For a moment the nape of Sassoon’s neck crawled as it had the first timeCampbell talked about German spies; but this was not madness. ‘I had asimilar experience. Well, I don’t know whether it is similar. I was going upwith the rations one night and I saw the limbers against the skyline, and theflares going up. What you see every night. Only I seemed to be seeing itfrom the future. A hundred years from now they’ll still be ploughing upskulls. And I seemed to be in that time and looking back. I think I saw ourghosts.’Silence. They’d gone further than either of them had intended, and for amoment they didn’t know how to get back. Gradually, they stirred, theylooked round, at sunlight streaming over beds and chairs, at Sassoon’s razorglinting on the washstand, its handle smeared with soap. Sassoon looked athis watch. ‘I’m going to be late for golf.’Immediately Owen stood up. ‘Well, thanks for these,’ he said, taking thebooks. He laughed. ‘Thanks for writing it.’Sassoon followed him to the door. ‘Did you say you wrote?’‘I didn’t, but I do.’‘Poetry?’‘Yes. Nothing in print yet. Oh, which reminds me. I’m editor of theHydra. The hospital magazine? I was wondering if you could let us havesomething. It needn’t be –’‘Yes, I’ll look something out.’ Sassoon opened the door. ‘Give me a fewdays. You could bring your poems.’This was said with such determined courtesy and such transparent lack ofenthusiasm that Owen burst out laughing. ‘No, I –’‘No, I mean it.’‘All right.’ Owen was still laughing. ‘They are quite short.’‘No, well, it doesn’t lend itself to epics, does it?’‘Oh, they’re not about the war.’ He hesitated. ‘I don’t write about that.’‘Why ever not?’‘I s-suppose I’ve always thought of p-poetry as the opposite of all that.The ugliness.’ Owen was struggling to articulate a point of view he wasabandoning even as he spoke. ‘S-Something to to t-take refuge in.’Sassoon nodded. ‘Fair enough.’ He added mischievously, ‘Though itdoes seem a bit like having a faith that daren’t face the facts.’ He sawOwen’s expression change. ‘Look, it doesn’t matter what they’re about.Bring them anyway.’‘Yes, I will. Thank you.’Anderson, following Sassoon into the bar of the golf club, knew he owedhim an apology. At the seventeenth hole, afraid he was losing, he’d misseda vital shot and in the heat of the moment had not merely sworn at Sassoon,but actually raised the club and threatened to hit him with it. Sassoon hadlooked startled, even alarmed, but he’d laughed it off. At the eighteenthhole, he’d been careful to ask Anderson’s advice about which iron heshould use. Now, he turned to Anderson and said, ‘Usual?’Anderson nodded. The trouble was, Anderson thought, it looked so muchlike bad sportsmanship, whereas in reality the apology was being delayed,not by any unwillingness on his part to admit he was wrong, but by theextent of the horror he felt at his own behaviour. He’d behaved like a spoiltchild. So do something about it, he told himself. ‘Sorry about that,’ he said,nodding towards the course.‘’S all right.’ Sassoon turned from the bar and smiled. ‘We all have baddays.’‘Here’s your half-crown.’Sassoon grinned and pocketed it. He was thinking, as he turned back tothe bar, that if the club had landed on his head he would have been far moreseriously injured than he’d been at Arras. He conjured Rivers up in hismind and asked, What was that you were saying about ‘safety’? Nothingmore dangerous than playing golf with lunatics. ‘Lunatic’ was a wordSassoon would never have dared use to Rivers’s face, so it gave him anadditional pleasure to yell it at his image.They took their drinks, found a quiet corner, and began their usualinquest on the game. Under cover of the familiar chat, Anderson watchedSassoon – a good-looking, rather blank face, big hands curved round hisglass – and. thought how little he knew about him. Or wanted to know. Itwas a matter of tacit agreement that they talked about nothing but golf.Anderson had read the Declaration, but he wouldn’t have dreamt ofdiscussing Sassoon’s attitude to the war, mainly because some return ofintimacy would then have been required. He might have had to disclose hisown reasons for being at Craiglockhart. His horror of blood. He had amomentary picture of the way Sassoon’s head would have looked if he’d hithim, and his hand tightened on the glass. ‘You’re still not taking your time,’he said. ‘You’re rushing your shots.’There were other reasons too why he didn’t want to talk about the war.Inevitably such talk would have strengthened his own doubts, and theywere bad enough already. He even dreamt about the bloody war, not justnightmares, he was used to those; he’d dreamt he was speaking at a debateon whether it should go on or not. In his dream he’d spoken in favour ofcontinuing to the point of German collapse, but Rivers’s analysis had lefthim in no doubt as to how far his horror at the whole business went. He feltsafe with Rivers, because he knew Rivers shared the horror, and shared toothe conviction that, in spite of everything, it had to go on.‘I don’t know whether to spend that half-crown or frame it,’ Sassoon wassaying. ‘I don’t suppose I’ll ever win another.’That was to make Anderson feel better about losing his temper on thecourse. Sassoon was a pleasant companion, there was no doubt about that.He was friendly, modest. But the Declaration hadn’t been modest. What hadchiefly struck Anderson about that was its arrogance, its totally outrageousassumption that everybody who disagreed with him was ‘callous’. Do youthink I’m callous? he wanted to ask. Do you think Rivers is callous? Butthere was no point getting worked up. Rivers would soon sort him out.‘I shan’t be seeing you tomorrow, shall I?’ Sassoon was saying. ‘Yourwife’s coming up.’‘No, I’m afraid she’s had to cancel. So it’s business as usual.’ He tookSassoon’s empty glass and stood up. ‘You can try to make it five bob, if youlike.’Prior watched the amber lights winking in his beer. He was sitting in theshadowy corner of a pub in some sleazy district of Edinburgh. He didn’tknow where he was. He’d walked miles that evening, not admitting even tohimself what he was looking for, and gradually the winding, insidiousstreets had led him deeper and deeper into a neighbourhood where washinghung, grey-white, from stacked balconies, and the smell of steak fryingreminded him of home.Remembering the smell, his stomach rumbled. He’d had nothing to eatall evening, except a packet of peanuts. Crumbs of salt still clung to his lips,stinging the cracks where the skin had dried during his asthma attack. It wasworth it, though, just to sit quietly, to listen to voices that didn’t stammer, tohave his eyes freed from the ache of khaki.No theory. He’d lied to Rivers about that. It was a point of honour withhim to lie to Rivers at least once during every meeting. He drained his glassand went out into the night.A little way down the street was a café. He’d passed it on his way to thepub and been tempted to go in, but the door had opened and the breath ofhot, damp, dirty, dishwater-smelling air had decided him against it. Now,though, he was too hungry to care. He went in, noticing how the innerwindows dripped from condensation, how the damp air insinuated itself intothe spaces between his uniform and his skin. A short silence fell. Nobody inan officer’s uniform was likely to be inconspicuous or welcome here. Hewould eat something, fish and chips, quickly and then go.A group of women was sitting at the next table. Three of them wereyoung, one older, thirty-five, forty perhaps, with blackened stumps forteeth. As far as he could make out from the conversation her name wasLizzie, and the others were Madge, the blonde, pretty one, Betty, who wasdark and thin, and Sarah, who had her back to him. Since they all had aslightly yellow tinge to their skin, he assumed they were munitions workers.Munitionettes, as the newspapers liked to call them. Lizzie was keeping theyounger girls entertained with a string of stories.‘There’s this lass and she’s a bit simple and she lived next door to a pro –well you know what a pro is.’ Lizzie glanced at him and lowered her voice.‘So she’s standing at the door this day, and the pro’s coming up the street,you know, dressed to death. So she says, “Eeh,” she says, “you’re alwayslovely dressed.” She says, “You’ve got beautiful clothes.” And she says, “Ilove your hats.” So the pro says, “Well, why don’t you get yourself downthe town like I do?” She says, “If a man winks at you, wink back and gowith him and let him have what he wants and charge him 7/6. And go toR&K Modes and get yourself a hat.” So the next day the pro’s coming upthe street again. “Hello.” “Hello.” She says, “D’ y’ get a hat?” She says,“Nah.” “Well, did you not do as I telled you?” She says, “Why of course Idid.” She says, “I went down the town and there was a man winked at usand I winked back. He says, ‘Howay over the Moor.’ ” So she says, “I gansover the Moor with him,” she says, “and I let him have what he wanted. Hesays, ‘How much is that?’ I says, ‘7/6.’ He says, ‘Hadaway and shite,’ andwhen I come back he’d gone.” ’The girls shrieked with laughter. He looked at them again. The one calledMadge was very pretty, but there was no hope of winkling her out of thegroup, and he thought he might as well be moving on. As soon as his mealarrived, he began stuffing limp chips and thickly battered fish into hismouth, wiping the grease away on the back of his hand.‘You’ll get hiccups.’He looked up. It was Sarah, the one who’d been sitting with her back tohim. ‘You’ll have to give us a surprise, then, won’t you?’‘Drop me key down your back if you like.’‘That’s nose bleeds, Sarah,’ Betty said.‘She knows what it is,’ said Lizzie.Madge said, ‘Hiccups, you’re supposed to drink from the other side ofthe cup.’She and Prior stared at each other across the table.‘But it’s a con, isn’t it?’ he said. ‘You can’t do it.’‘ ’Course you can.’‘Go on, then, let’s see you.’She dipped her small, straight nose into her cup, lapped, spluttered andcame up laughing and wiping her chin. Betty, obviously jealous, gave her adig in the ribs. ‘Hey up you, you’re gonna gerrus slung out.’The café owner was eyeing them from behind the till, slowly polishing aglass on a distinctly grubby-looking tea towel. The girls went back to theirtea, bursting into minor explosions of giggles, their shoulders shaking,while Prior turned back and finished his meal. He was aware of Sarahbeside him. She had very heavy, very thick, dark-brown hair, but all overthe surface, in a kind of halo, were other hairs, auburn, copper, chestnut.He’d never seen hair like that before. He looked at her, and she turnedaround and stared at him, a cool, amused stare from greenish eyes. He said,‘Would you like a drink?’She looked at her cup.‘No, I meant a proper drink.’‘Pubs round here don’t let women in.’‘Isn’t there a hotel?’‘Well, there’s the Cumberland, but …’The other women looked at each other. Lizzie said, ‘Howay, lasses, Ithink our Sarah’s clicked.’The three of them got up, said a good-natured ‘goodnight’ and trippedout of the café, only bursting into giggles again after they’d reached thepavement.‘Shall we go, then?’ said Prior.Sarah looked at him. ‘Aye, all right.’Outside, she turned to him. ‘I still don’t know your name.’‘Prior,’ he said automatically.She burst out laughing. ‘Don’t you lot have Christian names?’‘Billy.’ He wanted to say, and I’m not ‘you lot’.‘Mine’s Sarah. Sarah Lumb.’ She held out her hand to him in a direct,almost boyish way. It intrigued him, since nothing else about her wasboyish.‘Well, Sarah Lumb, lead on.’Her preferred drink was port and lemon. Prior was startled at the rate sheknocked them back. A flush spread across her cheeks in a different placefrom the rouge, so that she looked as if her face had slid out of focus. Sheworked in a factory, she said, making detonators. Twelve-hour shifts, sixdays a week, but she liked the work, she said, and it was well paid. ‘Fiftybob a week.’‘I suppose that’s something.’‘Too bloody right it is. I was earning ten bob before the war.’He thought what the detonators she made could do to flesh and bone, andhis mind bulged as a memory threatened to surface. ‘You’re",
      "density_breakdown": {
        "Metaphor": 3.3763044812768572,
        "Simile": 3.0693677102516883,
        "Imagery": 13.198281154082258,
        "Symbolism": 9.515039901780233,
        "Dialogue": 0.0,
        "Foreshadowing": 17.188459177409456,
        "Juxtaposition": 12.89134438305709,
        "Repetition": 4.910988336402701,
        "TOTAL_DENSITY": 64.14978514426028
      }
    },
    "climax": {
      "chapter_range": "14-15",
      "narrative_primary": 14,
      "optimized_primary": 14,
      "device_density_score": 52.19527172244397,
      "improvement_percent": 0.0,
      "optimization_applied": false,
      "chapter_text": "France notknowing how to load a rifle. He saw them now, his little band, sitting onbales of straw in a sun-chinked barn, while he knelt to inspect their raw andblistered feet, and wondered how many of them were still alive.The windows banged and rattled, and again, in a brief lull, he thought heheard tapping. There were no trees close enough to touch the glass. Hesupposed there might be rats, but then whoever heard of rats tapping? Hetossed and turned, thinking how stupid it was not to be able to sleep here, insafety and comfort, when in France he’d been able to sleep anywhere. If hecould sleep on a firestep in drenching rain, surely he could sleep now …He woke to find Orme standing immediately inside the door. He wasn’tsurprised, he assumed Orme had come to rouse him for his watch. What didsurprise him, a little, was that he seemed to be in bed. Orme was wearingthat very pale coat of his. Once, in ‘C’ company mess, the CO had said,‘Correct me if I’m wrong, Orme, but I have always assumed that the colourof the British Army uniform is khaki. Not … beige.’ ‘Beige’ was said insuch Lady Bracknellish tones that Sassoon had wanted to laugh. He wantedto laugh now, but his chest muscles didn’t seem to work. After a while heremembered that Orme was dead.This clearly didn’t worry Orme, who continued to stand quietly by thedoor, but Sassoon began to think it ought to worry him. Perhaps if he turnedhis head it would be all right. He stared at the window’s pale square of light,and when he looked back Orme had gone.Fothersgill was awake. ‘Did you see anybody come in?’ Sassoon asked.‘No, nobody’s been in.’ He turned over and within a few minutes wassnoring again.Sassoon waited for the rhythm to be firmly established, then got out ofbed and walked across to the window. The storm had blown itself out,though twigs, leaves and even one or two larger branches, scattered acrossthe tennis courts, bore witness to its power. The palms of his hands weresweating and his mouth was dry.He needed to talk to Rivers, though he’d have to be careful what he said,since Rivers was a thorough-going rationalist who wouldn’t take kindly totales of the supernatural, and might even decide the symptoms of a warneurosis were manifesting themselves at last. Perhaps they were. Perhapsthis was the kind of hallucination he’d had in the 4th London, but no, hedidn’t believe that. His nocturnal visitors there had come trailing gore,pointing to amputations and head wounds, rather like the statues ofmedieval saints pointing to the instruments of their martyrdom. This hadbeen so restrained. Dignified. And it hadn’t followed on from a nightmareeither. He thought back, wanting to be sure, because he knew this was thefirst question Rivers would ask. No, no nightmare. Only that tapping at thewindow before he went to sleep.He got dressed and sat on the bed. At last eight o’clock came, and thehospital became noisy as the shifts changed. Sassoon ran downstairs. Hefelt certain Rivers would go to his office to check the post before he left,and there might just be time for a few words. But when he tapped on thedoor, a passing orderly said, ‘Captain Rivers’s gone, sir. He left on the sixo’clock train.’So that was that. Sassoon went slowly upstairs, unable to account for hissense of loss. After all, he’d known Rivers was going. And he was onlygoing for three weeks. Fothersgill was still asleep. Sassoon collected hiswashbag and went along to the bathroom. He felt almost dazed. As usual heturned to lock the door, and as usual remembered there were no locks. Attimes like this the lack of privacy was almost intolerable. He filled thebasin, and splashed his face and neck. Birds, sounding a little stunned as ifthey too needed to recover from the night, were beginning, cautiously, tosing. He looked at his face in the glass. In this half-light, against white tiles,it looked scarcely less ghostly than Orme’s. A memory tweaked the edgesof his mind. Another glass, on the top landing at home, a dark, oval mirrorframing the face of a small, pale child. Himself. Five years old, perhaps.Now why did he remember that? Birds had been singing, then, too.Sparrows, twittering in the ivy. A day of shouts and banged doors and tearsin rooms he was not allowed to enter. The day his father left home. Or theday he died? No, the day he left. Sassoon smiled, amused at the link he’ddiscovered, and then stopped smiling. He’d joked once or twice to Riversabout his being his father confessor, but only now, faced with this secondabandonment, did he realize how completely Rivers had come to take hisfather’s place. Well, that didn’t matter, did it? After all, if it came tosubstitute fathers, he might do a lot worse. No, it was all right. Slowly, helathered his face and began to shave.Part Three FOURTEEN‘Hymn No. 373.’With a rustling of paper the maroon-backed hymn books blossomed intowhite. The congregation struggled to its feet. Children at the front under thewatchful eye of Sunday-school teachers, the rest, middle-aged or elderlymen, and women. A preliminary wheeze from the organ, then:God moves in a mysterious wayHis wonders to perform …Since the Somme, this seemed to have become the nation’s most popularhymn. Rivers had lost count of the number of times he’d heard it sung. Helifted his eyes to the flag-draped altar, and then to the east window. Acrucifixion. The Virgin and St John on either side, the Holy Ghostdescending, God the Father beaming benignly down. Beneath it, and muchsmaller, Abraham’s sacrifice of his son. Behind Abraham was the ramcaught in a thicket by his horns and struggling to escape, by far the bestthing in the window. You could see the fear. Whereas Abraham, if heregretted having to sacrifice his son at all, was certainly hiding it well andIsaac, bound on a makeshift altar, positively smirked.Obvious choices for the east window: the two bloody bargains on whicha civilization claims to be based. The bargain, Rivers thought, looking atAbraham and Isaac. The one on which all patriarchal societies are founded.If you, who are young and strong, will obey me, who am old and weak,even to the extent of being prepared to sacrifice your life, then in the courseof time you will peacefully inherit, and be able to exact the same obediencefrom your sons. Only we’re breaking the bargain, Rivers thought. All overnorthern France, at this very moment, in trenches and dugouts and floodedshell-holes, the inheritors were dying, not one by one, while old men, andwomen of all ages, gathered together and sang hymns.Blind unbelief is sure to err,And scan His works in vain;He is His own interpreterAnd He will make it plain. Amen.The congregation, having renounced reason, looked rather the happier forit, and sat down to await the sermon. Charles leant towards Rivers andwhispered, ‘He doesn’t usually go on very long.’That whisper brought back the Sunday mornings of their childhood whenthey’d drive to church in a pony and trap, and spent the sermon looking upthe naughty bits in the Old Testament, a task made easier by the grubbyfingerprints of those who had gone before. He remembered Michal’s bride-price: an hundred foreskins of the Philistines. As an anthropologist, he stillfound that fascinating. He remembered the smell of hassocks, and fastenedhis eyes on the flag-draped altar. They would never come back, those times.The vicar had reached the top of the pulpit steps. A faint light flashed onhis glasses as he made the sign of the cross. ‘In the name of the Father andof the Son and of the Holy Ghost …’Charles was busy with a great rehousing of the hens. They were to betransferred from deep litter in the barn to the new coops in Two-acre Field.This was best done after dusk when the hens were drowsy and less likely torebel. The brothers lingered over tea in the living room, and then went outacross the black, sodden, dismal mud of the yard towards the large, lowbarn. Rivers was wearing a pair of old cord breeches kept up with one of hisbrother’s belts, visible proof that Bertha’s strictures on his loss of weightwere justified. ‘It isn’t as if,’ she said at every mealtime, piling his platehigh, ‘you had it to lose.’ ‘He’s all right, Bertha, leave him alone,’ Charlesalways said, though it made no difference. Rivers still staggered away fromthe table feeling that he’d been force-fed.Charles carried the hens easily, his arms binding the wings fast to hissides. Rivers, less expert, picked up two birds and set off after him. Hisfingers dug through the fluffiness into the surprisingly hard quills, andtouched clammy flesh. The blood-red combs jiggled as he walked, ambereyes looked up with a kind of bright vacuity. As he tried to nudge thefarmyard gate open with his elbow, one of them got its wings free andflapped frantically until he managed to subdue it again. God, I hate hens, hethought.The chicken farm had been his idea, after Charles came back from theEast with malaria. Work in the open air, Rivers had advised. He was payingfor it now. As he left the shelter of the hedge and set off across Two-acreField, a great gust of ‘open air’ almost lifted him off his feet. He feltresponsible for the farm idea, and it wasn’t paying. At the moment theywere only just breaking even. Mainly it was the effect of the war. Feed wasscarce and expensive, male help impossible to get. The last land girl hadstayed only long enough to work out the distance to the nearest town,before discovering that some domestic crisis required her immediate returnhome. But even without the war it might not have been easy. Hens had acurious way of not thriving. They seemed to be subject to a trulyphenomenal range of diseases and to take a perverse pleasure in workingtheir way down the list.It was almost completely dark now, a few faint stars pricking through theclear sky. One hen, weaker than the rest, was being picked on by the others.Its chest was bare of feathers and raw where they’d pecked at it.‘I’ll have to get that one out and wring its neck,’ Charles said.‘Can’t you just isolate her and then put her back in?’‘No. Once they start they never stop.’They turned and walked back. McTavish, the farm cat, a black, batteredtorn, met them at the corner of the yard and preceded them across it. Anotably morose cat, McTavish, a defect of temperament Rivers attributed tohis being perpetually surrounded by forbidden flesh. He was fond ofMcTavish and slipped him titbits from his plate whenever he thought Berthawasn’t looking.They moved hens for an hour; slow, tedious work and then, as realdarkness set in, went back to the house. Bertha had been baking. Anearthenware pot full of bread dough stood by the kitchen range, and thewhole firelit room was full of the smell of warm yeast. ‘You’ll be all right,won’t you?’ Bertha said, driving a hat pin neatly into her hat, and craningtowards the mirror to make sure it was on straight. She and Charles wereusing Rivers as a chicken-sitter while they enjoyed a rare night out.‘Don’t fuss, Bertha,’ Charles said.‘There’s two loaves in the oven. They’ll be done at ten past eight. Turnthem out, tap the base. If it sounds hollow, they’re done. Do you think youcan manage that?’‘He’s not a complete idiot, Bertha,’ Charles called in from the hall.Bertha looked doubtful. ‘All right, then. Are we off?’Charles came in wearing his hat and coat.Rivers said, ‘I’ll see if I can get those accounts finished, Charles.’‘I wish you would,’ Bertha murmured as she went past.Once they’d gone, Rivers sat in the rocking chair by the fire, andconcentrated on not dozing off. He hadn’t dared not eat at dinner, and theunaccustomed heavy meal and the firelight were making his eyelids droop.Last spring when he’d been here, boxes of chicks had been put to warmbefore the fire, and then the room had been full of the pecking andscratching of tiny beaks and feet. He remembered them struggling out of theeggs, how exhausted, wet and miserable they looked, and yet curiouslypowerful, little Atlases struggling to hold up the world. Now the samechicks were scruffy, bedraggled things running in the coops, and the onlysound in the room was the roar of flame.He stretched out his legs and looked at the account book on the edge ofthe kitchen table. He had letters he ought to write, the most urgent beingone to David Burns, who’d invited him to spend the last few days of hisleave at the family’s holiday cottage on the Suffolk coast. As far as Riverscould make out, Burns’s parents wanted to talk about his future, andalthough Rivers was not particularly anxious to do this – he found itdifficult to envisage any future for Burns – he thought it his duty to accept.And then there was a half-completed letter to Sassoon, but the accountswould have to come first. Ten past eight. He got the loaves from the oven,tipped them out, and tapped the bases. Since he’d never done this before, hehad no way of knowing whether this particular sound was ‘hollow’ or not.He decided they looked done, and set them to cool on the tray. Then hefetched the shoe box in which Charles stored his receipts and set to work onfinishing the accounts. At intervals as he worked he looked up. The windwhich had been blowing a gale all day was beginning to die down. Once heheard an owl hoot from the copse at the other side of Two-acre Field, acold, shivery sound that made him glad of the fire and the smell of warmbread.When he’d finished, he took the oil lamp and went along to the frontroom, intending to have another go at finishing his letter to Siegfried. Heput the lamp down on the desk. Ranged at intervals around the walls, bigheavy pieces of furniture squatted on their own shadows. Most of them heremembered from his childhood home: Knowles Bank. They were too bigto fit into his sisters’ cottage, he had no need of them, and so Charles andBertha had inherited them all. Their presence here in different places, atdifferent angles to the walls and to each other, gave him an odd feeling ofslipping back into an out-of-focus version of his childhood.A cold, unused room. All the farm paperwork was done in the kitchen.He decided to take his letter along and finish it there, but then lingered,fingering the leather of the desk top and looking at the picture that hungabove the empty grate. At Knowles Bank it had hung in the same position,above the fireplace, in his father’s study. As a picture it could hardly havebeen more appropriate to his father’s dual role as priest and speechtherapist, since it showed the Apostles at Pentecost immediately after theyhad received the gift of tongues. There they sat, each under his ownpersonal flame, rendered in an instant fluent, persuasive and articulate, notmerely in their own language but in all known tongues. Rivers rememberedthe bishop’s sermon one Pentecost when he’d explained that the gift oftongues as bestowed upon the Apostles had absolutely nothing to do with‘the gift of tongues’ as bestowed regularly every Sunday on uneducatedriff-raff in various tin-roofed chapels about the diocese. The gift ofPentecost had made the Apostles comprehensible in all known languages.And there they sat still, looking, Rivers couldn’t help thinking, mostunchristianly smug about it all.He’d sat with other boys – his father’s pupils – underneath that picturefor many a long hour, stumbling over the consonants of his own language,remembering to hold down the back of his tongue, project his breath in aneven flow, etc., etc. Sometimes his father would walk with him up anddown the room, since he believed the measured pace helped to regulate theflow of breath. Rivers hadn’t been the star pupil in those classes, not by anymeans. If anything he’d made rather less progress than the rest, in spite of –or because of? – having his teacher with him all the time. The house wasfull of stammering boys, any age from ten to nineteen, and at least it meanthe was not the only one. It had had another advantage too, he remembered.While the boys were there, the Reverend Charles Dodgson stayed away. MrDodgson didn’t like boys. As soon as they left at Christmas or in thesummer holidays, he arrived, taking lessons every evening after dinner.Rivers, from long exposure to other people’s speech impediments, couldsum up the main features of a stammer almost as quickly as his father.Dodgson found m difficult, and p in consonant combinations, particularly inthe middle of words, but his arch enemy was hard c.During the day there were boating trips on the river. Dodgson and thefour Rivers children, himself, Charles, Ethel and – Dodgson’s favourite –Katharine. He’d never enjoyed those trips much, and neither, he thought,had Charles, though probably that was no more than the slight pique of twoVictorian schoolboys, finding themselves, for the first time in their lives,not of the preferred sex. Afterwards, during those apparently endlesssummer evenings, there would be croquet on the lawn, Rivers’s father andDodgson playing, the children watching. There was a photograph of themon the desk, doing just that, he and Charles leaning back against the gardenroller, no doubt getting grass stains on their white shirts, the two little girls,his sisters, under the shade of the beech tree. If he tried hard, he could recallthe feel of the roller against his shoulder blades, the heat of the sun on theback of his neck.He had one other memory of Dodgson. One evening he’d crept close tothe open window of his father’s study, sat down with his back to the walland listened to the lesson in progress. Why he’d done this he couldn’t nowremember, except that it hadn’t felt like eavesdropping, since he knewnothing private was likely to be said. Perhaps he’d just wanted to hearDodgson put through the same routine he and the other boys were putthrough. Perhaps he’d wanted to see him cut down to size. Dodgson hadjust embarked on the sentence about the careful cat catching the mouse – asimple enough tale, but already, in Dodgson’s mouth, threatening to becomean epic. Rivers listened to his father’s advice, the same advice, basically,that he got, though conveyed without that peculiar note of fraught patience.He thought suddenly, this is nonsense. It doesn’t help to remember to keepyour tongue down, it doesn’t help to think about the flow of breath. So he’dthought, sweeping away his father’s life work in a single minute as twelve-year-old boys are apt to do. He’d raised his head very cautiously above thewindow sill, and seen his father sitting behind the desk – this desk – hisback to the window, clean pink neck showing above clean white collar,broad shoulders straining the cloth of his jacket. He stared at the back of hisneck, at the neck of the man whom he had, in a way, just killed, and hedidn’t feel sad or guilty about it at all. He felt glad.Later that summer he’d given a talk to the speech therapy group onmonkeys. M was to him what c was to Dodgson, but he was interested inmonkeys, and still more interested in Darwin’s theory of evolution, whichby this time had achieved acceptance in some circles. Knowles Bank wasnot among them. His father had been furious, not because Rivers hadstumbled over every single m without exception – though indeed he had –but because he’d dared suggest that Genesis was no more than the creationmyth of a Bronze Age people. Dinner that night was a strained occasion.Father angry, mother upset, Charles covertly sympathetic, sisters goggle-eyed and making the most of it, Rivers",
      "density_breakdown": {
        "Metaphor": 3.070310101320233,
        "Simile": 1.84218606079214,
        "Imagery": 16.57967454712926,
        "Symbolism": 9.824992324224747,
        "Dialogue": 0.0,
        "Foreshadowing": 7.061713233036537,
        "Juxtaposition": 12.588271415412958,
        "Repetition": 1.2281240405280933,
        "TOTAL_DENSITY": 52.19527172244397
      }
    },
    "falling_action": {
      "chapter_range": "16-21",
      "narrative_primary": 19,
      "optimized_primary": 16,
      "device_density_score": 54.02087170042971,
      "improvement_percent": 4.1100468214790356,
      "optimization_applied": true,
      "chapter_text": "was so keen on the Heath.’‘I imagine you’d find it interesting? Apparently there are some quitestriking differences between the rate of breakdown in pilots and in otherbranches of the service.’‘It sounds marvellous.’ He raised his hands and let them drop. ‘I justdon’t see how I can.’‘Why not? You’d be closer to your family, your friends, your researchcontacts, you’d be able to get back to Cambridge at weekends. And … Idon’t suppose it matters, but we’d be able to work together again.’Rivers buried his face in his hands. ‘O-o-o-oh. “Get thee behind me,Satan.” ’‘I am behind you. I was thinking of giving you a shove.’‘I couldn’t leave Bryce.’Head looked incredulous. ‘You mean, your CO?’‘He’s in a difficult situation. We’re in for a general inspection, and … itall goes back a long way. Bryce is determined this time he’s not going toplay their game. He’s not going to parade the patients, or polish the bottomsof the frying-pans, or pretend to be anything other than just an extremelybusy, overcrowded and I think bloody good hospital.’‘What do they want?’‘They want a barracks. It’s got all the makings of a really nastyconfrontation. I think Bryce may have to go.’‘Well, I hate to sound harsh, but wouldn’t that rather solve the problem?Your problem, I mean.’‘If it happened. Meanwhile, I think I can be … of some use to him.’‘When is this inspection?’‘End of the month.’‘We’d need to know about the job … Well. Three weeks?’‘I’ll think about it.’‘Good. And don’t be too altruistic, will you? You’re isolated up there, it’snot good for you.’‘I don’t know about isolated. I never have a minute to myself.’‘Precisely. Come on, let’s find Ruth.’FIFTEENAldeburgh was the end of the line, but. the train, as if reluctant to acceptthis, produced, as Rivers stepped down on to the platform, an amazing burstof steam. He stood, looking up and down, as the train’s hissing subsidedinto grunts, and the steam cleared. Burns had promised to meet him, but hismemory wasn’t good, and, faced with the empty platform, Rivers was gladhe had the address. But then, just as Rivers was resigning himself to findingthe house on his own, Burns appeared, a tall, emaciated figure wearing acoat of stiff herringbone tweed that reached almost to the ground. He’dobviously been running, and was out of breath. ‘Hello,’ he said. Rivers triedto judge whether Burns looked better or worse. It was hard to tell. His facein the light of the naphtha flares was as expressionless as beaten bronze.‘How are you?’ they asked simultaneously, and then laughed.Rivers decided he should be the one to answer. ‘A lot better, thanks.’‘Good,’ Burns said. ‘It’s walking distance,’ he added across his shoulder,already striding off. ‘We don’t need a taxi.’They came out of the station and began walking downhill, through thequiet cold fringes of the town, past the church, through streets of huddledhouses, and out on to the front.The sea was calm, almost inaudible, a toothless mouth mumbling pebblesin the darkness. Instead of walking along the path, Burns struck out acrossthe shingle and Rivers followed, to where the tide had laid bare a thin stripof sand. The crunch and slither of shingle under their feet blotted out allother sounds. Rivers turned, and saw the bones of Burns’s face gleaming inthe moonlight. He wondered what he made of the tangles of barbed wirethat ran along the beach, with only two narrow channels left for fishingboats and for the lifeboat to come and go. But Burns seemed not to see thewire.They stood together at the water’s edge, two black shadows on the paleshingle, and small waves creamed over at their feet. Then the moon cameout from behind a bank of dark cloud, and the fishermen’s huts, the boatslined up in two short rows behind the wire, and the heaped nets, castshadows behind them almost as sharply edged as day.They returned to the path and began walking along the terrace of houses,which here and there had gaps. Many of the houses were shuttered and hadsandbags piled against the front doors. ‘The sea’s been known to pay visits,’Burns said, following the direction of Rivers’s gaze. ‘I was here once whenit flooded.’ Evidently sandbags brought back no other memories.‘This is it,’ he said a few minutes later, stopping in front of a tall butextremely narrow house. At this end of the foreshore the sea was muchcloser, turning and turning in the darkness. Rivers looked out and caught aglint of white. ‘What’s along there?’‘The marshes. More shingle. I’ll show you tomorrow.’They groped their way into the hall, closing the door carefully behindthem before Burns switched on the light. His face, deeply shadowed fromthe unshaded bulb, peered anxiously at Rivers. ‘I expect you’d like to goupstairs,’ he said. ‘I think I’ve given you a towel …’ He looked like a childtrying to remember what it was that grown-ups said to newly arrived guests.He also looked, for the first time, deranged.Rivers followed him up the narrow stairs and into a small bedroom.Burns pointed out the bathroom and then went downstairs. Rivers put hisbag down, bounced on the bed to test the mattress, and looked round. Thewalls were covered with paper of an indeterminate and confusing pattern,the background colour faded to the yellow of an old bruise. Everythingsmelled of the sea, as if the furniture had soaked it in. It reminded him ofchildhood holidays in Brighton. He splashed his face in the bowl, then,turning off the light, opened the shutters. His room overlooked the sea. Thewind was rising, and with each gust the coils of wire twitched as if theywere alive.No sign of Burns’s parents. Rivers had mistakenly assumed he was beinginvited to meet them, since a large part of Burns’s letter had dealt with theiranxieties about his future. But apparently not. This was probably theirroom. The house was so narrow there couldn’t be more than one, or at themost, two small rooms on each floor.The evening passed pleasantly enough. No mention of Burns’s illness, nomention of the war. These were evidently taboo topics, but they talkedabout a great range of other things. Whatever else the war had done toBurns, it had certainly deepened his love for his native county. Suffolkflowers, birds, churches, he was knowledgeable about them all. Morerecently, he’d become interested in the preservation of country crafts. ‘OldClegg’, who was apparently something of a local character, had promised toteach him flint-knapping, and he seemed to be looking forward to that.Even before the war he’d been very much a countryman in his interests,rather like Siegfried in a way, though without Siegfried’s passion forhunting.When the conversation turned to other matters, Burns was very much thebright sixth former, idealistic, intolerant, naïve, inclined to offer sweepinggeneralizations as fact, attractive in the freshness of his vision as such boysoften are. Rivers thought how misleading it was to say that the war had‘matured’ these young men. It wasn’t true of his patients, and it certainlywasn’t true of Burns, in whom a prematurely aged man and a fossilizedschoolboy seemed to exist side by side. It did give him a curiously agelessquality, but ‘maturity’ was hardly the word. Still, he was better than he’dbeen at Craiglockhart, so perhaps his conviction that if he could only getback to Suffolk and forget the war he would be all right had been provedcorrect. But then why am I here? Rivers thought. Despite Burns’s reluctanceto mention his illness, Rivers didn’t believe he’d been invited to Suffolk totalk about church architecture. But it would be quite wrong to force thepace. Whatever was bothering him, he would raise the matter in his owntime.Rivers woke the following morning to find the beach shrouded in mist. Heleant on the window sill, and watched the fishing boats return. The pebbleson the beach were wet, though not from rain or tide. The mist clung to themlike sweat, and the air tasted of iron. Everything was so quiet. When a gullflew in from the sea and passed immediately overhead, he heard the creakof its wings.Burns was already up, in the kitchen by the sound of things, but not,Rivers thought, preparing breakfast. Nothing in the way of dinner or supperhad appeared the night before, and Rivers had hesitated, on his firstevening, to go into the kitchen and forage for food, though he suspected thatmight be the only way of getting any.He washed, dressed, shaved, and went downstairs. By this time the miston the beach had begun to thin, but it was cold for the time of year, and thesight of a fire in the first floor living room was welcome. He went down afurther flight of stairs into the kitchen and found Burns at the kitchen tablewith a pot of tea.‘There’s some cereal,’ he said, pointing.He sounded shy again, though last night he’d begun to talk quite freelyby the end of the evening, just as Rivers, caught between the roar of the fireand the roar of the sea, had started nodding off to sleep. ‘I’m sorry I had togo to bed so early,’ Rivers said, reaching for the cereal packet.‘ ’S all right.’ Visibly, he remembered what it was he was supposed toask next. ‘Did you have a good night?’‘Fine.’ Rivers bit the reciprocal question back. He’d heard part of Burns’snight. Obviously, however hard Burns tried to thrust memories of the warbehind him, the nightmare followed.The doorbell rang, and Burns got up to answer it. ‘This is Mrs Burril’sday for sorting me out,’ he said.Mrs Burril was a remarkably silent person, but she managed, withoutwords, to make it clear their presence was superfluous.Burns said, ‘I thought we might go for a walk.’The mist had thinned but not cleared. It moved in slow, cold currentsover the marshes, where drainage ditches and sump holes reflected a steelylight at the sky. Reeds whispered, with a noise like the palms of hands beingrubbed together. It was difficult to breathe, difficult even to move, and theyspoke in low voices when they spoke at all.They walked along a narrow raised path that divided the marshes fromthe river. Small yachts rode at anchor, the breeze just strong enough to maketheir rigging rattle, not a loud sound, but persistent and rather disturbing,like an irregular heart beat. Nothing else here could disturb. The estuary layflat and peaceful under a shrunken, silver sun, and nothing moved, exceptthe reeds, until a flight of ducks whistled past.Rivers had begun to realize how remarkable the area was. A strip of land,at times no more than a hundred yards wide, divided the estuary from theNorth Sea. Walking out along this strip, away from the town, into thebleached shingle distances, you became aware of two separate sounds: theroar and suck of waves on shingle, and the lulling sound of the river amongits reeds. If you moved to the left, the crunch and chop of boots on shinglecut out the gentler river sounds. If to the right, the tapping of rigging andthe lapping of water dominated, though you could still hear that the sea wasthere.They turned and looked back at the huddled town. ‘You know, I love thisplace,’ Burns said. ‘I wouldn’t like you to think I’d left London just becauseof the raids. Actually it wasn’t the raids, it was the regular meal-times. Youknow, everybody sitting down to eat. Waiting for food to be put in front ofthem. And father going on about the war. He’s a great believer in the war,my father.’‘Will they be coming to Suffolk at all?’‘No, I shouldn’t think so. They’re both very busy in London.’ Theyturned and walked on. ‘It’s best we don’t see too much of each other at themoment. I am not a sight for sore eyes.’A squat, circular building had begun to loom up out of the mist. It lookedrather like a Martello tower, Rivers thought, but he hadn’t known they’dbeen built as far north as this.‘This is the most northerly,’ Burns said, slithering down the slope on tothe beach. Rivers followed him across the shingle and down into the dankhigh moat that surrounded the tower. In its shadow, all water sounds,whether hissing waves or lapping water, abruptly ceased. Ferns grew fromthe high walls of the moat; and the tower, where the lookout turret hadcrumbled away, was thronged with bindweed, but the overall impressionwas of a dead place.The sea must flood the moat at high tide, for all kinds of debris had beenwashed up and left. Driftwood, the torn-off wing of a gull, bits of blue andgreen glass. A child would have loved it, picking over these pieces.‘We used to play here,’ Burns said. ‘Daring each other, you know. Whocould go all the way up?’There was a door, but it had planks nailed across it. Rivers peeredthrough a crack and saw stone steps going down.‘Strictly forbidden. They were always afraid we’d get trapped in thecellars.’‘I suppose they flood, don’t they? At high tide?’‘Yes. There’s all kinds of stories told about it. People chained up and leftto drown. I think we rather liked that. We used to sit down there and pretendwe could see ghosts.’‘It feels like a place where people have died. I mean, violent deaths.’‘You feel that, do you? Yes. I expect that’s why we liked it. Bloodthirstylittle horrors, boys.’Rivers wasn’t sorry when they climbed the bank of shingle and stood onthe beach in the strengthening sunlight again.‘Do you feel up to a longish walk?’ Burns asked.‘Yes.’‘All right. We can follow that path.’They walked four or five miles inland, and came out into a wood wheregreat golden tongues of fungus lapped the trees, and a mulch of dead leavessquelched underfoot. Rather to Rivers’s surprise they stopped at a pub onthe way back, though no food was available. Burns could drink apparently,and did, becoming in the process quite flushed and talkative, thoughnothing was said about his illness.They arrived back in the late afternoon with every bone and muscleaching. Mrs Burril had obviously built up the fire before she left, and it wasrescuable, just about. Rivers knelt in front of it, sticking strips of cerealpacket through the bars, and blowing when he got a flame. ‘Have you anynewspapers?’‘No,’ Burns said.No, Rivers thought, silly question. Once the fire was burning well, Riverswent out and bought cakes and biscuits for tea, which he served in front ofthe fire, tucking in himself and not looking to see whether Burns ate or not.He ate, sitting on the hearth rug, his wind-reddened arms clasped about hisknees, and the firelight playing on his face.After the plates were cleared away, Rivers asked if he might work for acouple of hours. He was writing a paper on the Repression of WarExperience which he was due to give to the British Medical Association inDecember, and he knew, once he got back to Craiglockhart, there would bevery little time. He worked at the table in the window, with his back to theroom. He began by reading through what he’d written so far on the evileffects that followed from patients trying to suppress their memories of warexperience, and was about to start writing when it occurred to him he was inthe same room as a man who was doing just that.Why do I go along with it? he thought. One answer, the easy answer, wasthat he was no longer Burns’s doctor. It was up to Burns now how he choseto manage his illness. But then he’d gone along with the suppression inCraiglockhart too. Whenever he’d tried to apply to Burns the same methodsof treatment he used with everybody else, and used, for the most part,successfully, his nerve had failed him. He’d told himself this was becauseof the peculiar nature of Burns’s experience, the utter lack of any redeemingfeature the mind could grasp and hold on to while it steadied itself to facethe full horror. But was Burns’s experience really worse than that of others?Worse than Jenkins’s, crawling between the dismembered pieces of hisfriend’s body to collect personal belongings to send back to the family?Worse than Prior’s? What shall I do with this gob-stopper?Corpses were everywhere in the trenches. Used to strengthen parapets, toprop up sagging doorways, to fill in gaps in the duckboards. Many of hispatients treading on a dead body had been startled by the release of gas.Surely what had happened to Burns was merely an unusually disgustingversion of a common experience. And I’ve let him, Rivers thought – no,that was unfair, that was completely unfair – I’ve let myself turn it into …some kind of myth. And that was unforgivable. He wasn’t dealing withJonah in the belly of the whale, still less with Christ in the belly of theearth, he was dealing with David Burns, who’d got his head stuck in thebelly of a dead German soldier, and somehow had to be helped to live withthe memory.He turned and looked at Burns, who was still sitting on the hearth rug,though now he’d found himself a book and was reading, his tongueprotruding slightly between his teeth. As he felt Rivers’s gaze, he looked upand smiled. Twenty-two. He should be worrying about the Tripos andscrewing up his courage to ask a girl to the May ball. And yet even nowRivers was nervous of raising the subject of his illness. Burns’s instinctivereaction had been to get back to this house, to forget. And there had beensome improvement under this regime, by day at least, though evidently notby night. If he wants to talk, he’ll talk, Rivers thought, and turned back tohis paper.That evening, rather to Rivers’s surprise, they went to the pub. He wassurprised because he’d been assuming Burns was isolated here, butapparently all the locals knew him. They’d watched him growing up,summer by summer. The family had been staying here when war broke out.Burns had joined up along with most of the local lads. They all rememberedhim in his uniform, in the first days and weeks of the war, and perhaps thatmattered a great deal. In London, Burns said, on his first trip out in civilianclothes, he’d been handed two white feathers.Here, as soon as they pushed the bar door open, he was hailed by severalpeople, and by one man in particular: ‘Old Clegg’. Clegg had rheumy blueeyes, whose overflow had dried to a scurfy crust at his temples; three brownbut very strong teeth; unidentifiable stains on his abdomen, and other stains,only too identifiable, further down. His conversation was so encrusted withsalty Suffolk sayings that Rivers suspected him of deliberate self-parody.That, or leg-pulling. Once he’d discovered Rivers was interested in folklore,he was well away. Rivers spent a thoroughly enjoyable evening beinginitiated into the folklore of rural Suffolk. By closing time, he wasconvinced Clegg was possibly the most unreliable informant he’d ever had.For sheer imaginative flights of fancy none of the Melanesians cameanywhere near him. ‘That man is a complete fraud,’ he said as they left thepub.But Burns disagreed. ‘He’s not a fraud, he’s a rogue. Anyway as long ashe teaches me flint-knapping, I don’t care.’Next morning the weather had changed. At dawn there was a strip of clearblue on the horizon, fading to yellow, but the sky darkened rapidly, until, bymid morning, the clouds humped, liver-coloured, and the sea was dark asiron. The wind had risen during the night, sweeping away the last remnantsof mist. At first it came in little gusts, lifting the thin carpet in the hall,swirling dust in corners, then in blasts that made waves on the surface of theestuary, rocking the yachts until the rattle of their rigging became a frenzy,while on the beach great waves swelled like the muscles of an enormousanimal, rising to crests that hung and seethed along their full length, beforetoppling over in thunder and bursts of spray.Rivers worked on his paper all morning, looking up now and then to findthe window mizzled with rain. Burns slept late, having had another",
      "density_breakdown": {
        "Metaphor": 3.6832412523020257,
        "Simile": 3.0693677102516883,
        "Imagery": 16.267648864333946,
        "Symbolism": 7.980356046654389,
        "Dialogue": 0.0,
        "Foreshadowing": 3.6832412523020257,
        "Juxtaposition": 15.346838551258442,
        "Repetition": 3.9901780233271946,
        "TOTAL_DENSITY": 54.02087170042971
      }
    },
    "resolution": {
      "chapter_range": "22-23",
      "narrative_primary": 23,
      "optimized_primary": 22,
      "device_density_score": 59.256984955480505,
      "improvement_percent": 6.07651482689861,
      "optimization_applied": true,
      "chapter_text": "the sounds of the alphabet, though, again, only ‘ah’ wasproduced and that in a hoarse whisper, very far back in the throat. Callanstumbled as he walked, and Yealland supported him. Up and down theywent, up and down, in and out of the circle of light around the battery.Rebellion came at last. Callan wrenched his arm out of Yealland’s graspand ran to the door. Evidently he’d forgotten it was locked, though heremembered at once and turned on Yealland.Yealland said, ‘Such an idea as leaving me now is most ridiculous. Youcannot leave the room. The door is locked and the key is in my pocket. Youwill leave me when you are cured, remember, not before. I have no doubtyou are tired and discouraged, but that is not my fault; the reason is that youdo not understand your condition as I do, and the time you have alreadyspent with me is not long in comparison with the time I am prepared to staywith you. Do you understand me?’Callan looked at Yealland. For a second the thought of striking him wasclearly visible, but then Callan seemed to admit defeat. He pointed to thebattery and then to his mouth, miming: Get on with it.‘No,’ Yealland said. ‘The time for more electrical treatment has not yetcome; if it had, I should give it to you. Suggestions are not wanted fromyou; they are not needed. When the time comes for more electricity, youwill be given it whether you want it or not.’ He paused. Then added withgreat emphasis: ‘You must speak, but I shall not listen to anything you haveto say.’They walked up and down again, Callan still repeating ‘ah’, but makingno other sound. The ‘ah’ was produced by an almost superhuman effort, themuscles of the neck in spasm, the head raised in a series of jerks. Even thetorso and the arms were involved in the immense effort of pushing thissound across his lips. Rivers had to stop himself trying to make the soundfor him. He was himself very tense; all the worst memories of his stammercame crowding into his mind.Yealland said, ‘You are now ready for the next stage of treatment, whichconsists of the administration of strong shocks to the outside of the neck.These will be transmitted to your voice box and you will soon be able to sayanything you like in a whisper.’Callan was again placed in the chair and again strapped in. The keyelectrode was applied in short bursts to his neck in the region of the larynx,Yealland repeating ‘ah, bah, cah, dah’, etc. in time with the shocks. On thethird repetition of the alphabet, Callan suddenly said ‘ba’. Instead ofattempting the next sound, he went on repeating ‘ba’, not loudly, butvenomously. ‘Bah, bah’, and then, unmistakably ‘Baaaa! Baaaaa! Baaaaaa!’Yealland actually looked gratified. He said, ‘Are you not glad you havemade such progress?’Callan started to cry. For a while there was no other sound in the roomthan his sobbing. Then he wiped his eyes on the back of his hand andmimed a request for water.‘Yes, you will have water soon. Just as soon as you can utter a word.’Callan pushed Yealland aside and ran to the door, rattling the handle,beating on the wood with his clenched fists. Rivers couldn’t bear to go onwatching. He looked down at the backs of his clasped hands.Yealland said, ‘You will leave this room when you are speaking normally.I know you do not want the treatment suspended now you are making suchprogress. You are a noble fellow and these ideas which come into yourmind and make you want to leave me do not represent your true self. Iknow you are anxious to be cured and are happy to have recovered to suchan extent; now you are tired and cannot think properly, but you must makeevery effort to think in the manner characteristic of your true self: a hero ofMons.’Perhaps Callan remembered, as Yealland apparently did not, that Monshad been a defeat. At any rate he went back to the chair.‘You must utter a sound,’ Yealland said. ‘I do not care what the nature ofthe sound is. You will understand me when I say I shall be able to train anysound into the production of vowel sounds, then into letter sounds, andfinally into words and sentences. Utter a sound when you take a deepbreath, and as soon as I touch your throat.’Callan, although he appeared to be co-operating, could make noexpiratory sound.Yealland appeared to lose patience. He clamped his hands down on toCallan’s wrists and said, ‘This has gone on long enough. I may have to usea stronger current. I do not want to hurt you, but if necessary I must.’Rivers couldn’t tell whether the anger was acted or real, but there was nodoubt about the strength of the current being applied to the neck in shockafter shock. But it worked. Soon Callan was repeating ‘ah’ at a normalpitch, then other sounds, then words. At this point Yealland stopped the useof electricity, and Callan sagged forward in the chair. He looked as if hewere going to fall, but the straps held him in place. ‘Go on repeating thedays,’ Yealland said.‘S-s-s-sunday. M-m-m-m-m-monday. T-t-t-t-Tuesday …’Saturday came at last.Yealland said, ‘Remember there is no way out, except by the return ofyour proper voice and by that door. I have one key, you have the other.When you can talk properly, I shall open the door and you can go back tothe ward.’And so it went on, through the alphabet, the days of the week, the monthsof the year – the shocks sometimes mild, sometimes extremely strong –until he was speaking normally. As soon as he could say words clearly at anormal pitch, he developed a spasm or tremor – not unlike paralysis agitans– in his left arm. Yealland applied a roller electrode to the arm. The tremorthen reappeared in the right arm, then the left leg, and finally the right leg,each appearance being treated with the application of the electrode. Finallythe cure was pronounced complete. Callan was permitted to stand up. ‘Areyou not pleased to be cured?’ Yealland asked.Callan smiled.‘I do not like your smile,’ Yealland said. ‘I find it most objectionable. Sitdown.’Callan sat.‘This will not take a moment,’ Yealland said. ‘Smile.’Callan smiled and the key electrode was applied to the side of his mouth.When he was finally permitted to stand up again, he no longer smiled.‘Are you not pleased to be cured?’ Yealland repeated.‘Yes, sir.’‘Nothing else?’A fractional hesitation. Then Callan realized what was required and camesmartly to the salute. ‘Thank you, sir.’TWENTY-TWOThat evening after dinner Rivers tried to work on a paper he was due to giveto the Royal Society of Medicine in December. As he read through whathe’d written, he became aware that he was being haunted by images. Theman in the corridor at Queen Square, Yealland’s hands, Callan’s openmouth, the two figures, doctor and patient, walking up and down, in and outof the circle of light round the battery. It was unusual for Rivers to visualizeas intensely as this, indeed to visualize at all, but then the whole experience,from beginning to end, had had something … hallucinatory about it.Rivers left the typewriter and went to sit in his armchair by the fire. Assoon as he abandoned the attempt to concentrate on the paper, he knew hewas ill. He was sweating, his heart pounded, pulses all over his bodythrobbed, and he felt again that extraordinary sensation of blood squeezingthrough his veins. He thought he might have a slight temperature, but henever, as a matter of principle, took his own temperature or measured hispulse. There were depths of neuroticism to which he was not prepared tosink.His confrontation with Yealland had exhausted him, for, however politethey had each been to each other, it had been a confrontation. He was tootired to go on working, but he knew if he went to bed in this state hewouldn’t sleep, even if there was no disturbance from the guns. He decidedto take a turn on the Heath, fetched his greatcoat from the peg and creptdownstairs. Mrs Irving was a pleasant enough woman, but she was also avery lonely woman, and inclined to air her grievances about the excessivedemands of Belgian refugees. He reached the bottom of the stairs, listened amoment, then quietly let himself out of the house.He felt his way along the dark street. Shuttered windows, like blind eyes,watched from either side. It was something new this darkness, like the deepdarkness of the countryside. Even on the Heath, where normally Londonwas spread out before you in a blaze of light, there was only darkness, andagain darkness. Starlight lay on the pond, waking a dull gleam, like metal.Nothing else. He started to walk round the edge, trying to empty his mindof Queen Square, but the images floated before him like specks in the eye.Again and again he saw Callan’s face, heard his voice repeating simplewords, a grotesque parody of Adam naming created things. He felt pursued.There they were, the two of them, Yealland and his patient, walking up anddown inside his head. Uninvited. If this was what habitual visualizersexperienced, he could only say he found it most unpleasant.He stopped and looked at the pond. He was aware of rustling, draggingfootsteps. Somebody bumped into him and muttered something, but hemoved away. By the time he got back to his lodgings he felt much better,well enough to greet Mrs Irving in the hall and compliment her on a morethan adequate dinner.Back in his own rooms he went straight to bed. The sheets felt cold, socold he again wondered if he was running a temperature, but at least thepalpitations and the breathlessness had gone. He thought he might manageto sleep if the Zeppelins and the guns allowed it, and indeed he did fallasleep almost as soon as he turned off the light.He was walking down the corridor at Queen Square, an immensely longcorridor which elongated as he walked along it, like a strip of elastic at fullstretch. The swing doors at the far end opened and shut, flap-flapping anunnaturally long time, like the wings of an ominous bird. Clinging to therail, the deformed man watched him approach. The eyes swivelled to followhim. The mouth opened and out of it came the words: I am making thisprotest on behalf of my fellow-soldiers because I believe the war is beingdeliberately prolonged by those who have the power to end it.The words echoed along the white corridor. Abruptly the dream changed.He was in the electrical room, a pharyngeal electrode in his hand, a man’sopen mouth in front of him. He saw the moist, pink interior, the delicatelyquivering uvula, the yellowish, grainy surface of the tongue, and the tonsils,like great swollen, blue-purple eggs. He slipped the tongue depressor in,and tried to apply the electrode, but the electrode, for some reason,wouldn’t fit. He tried to force it. The man struggled and bucked beneathhim, and, looking down, he saw that the object he was holding was ahorse’s bit. He’d already done a lot of damage. The corners of the man’smouth were raw, flecked with blood and foam, but still he went on, trying toforce the bit into the mouth, until a cry from the patient woke him. He satup, heart pounding, and realized he had himself cried out. For a second thedream was so real that he went on seeing the chair, the battery, the torturedmouth. Then, nothing. Gradually, his heart beat returned to normal, thoughwhen he got out of bed and went across to sit by the window the smalleffort made it pound again.No raid tonight. It was ironic that on this one quiet night he should havewoken himself up with a nightmare. As with all nightmares, the horrorlingered. He was still inclined to accuse himself. That, he thought – self-reproach – had been the dominant affect. At first he was inclined to connectit with the quasi-sexual imagery of the dream, for the dream action hadbeen both an accurate representation of Yealland’s treatment anduncomfortably like an oral rape. He didn’t feel, however, that theunderlying conflict had been sexual.The manifest content came from his visit to Queen Square, and waspresent with relatively little transformation. There was no doubt that thevisit had been rife with opportunities for conflict. From the beginning he’dfelt a tension between, on the one hand, his sympathy for the patients, hisdoubts about the quality of the treatment they were receiving, and on theother, the social and professional demands on him to be reasonably polite.As the day had gone on, this conflict had certainly deepened. Over lunchYealland had told him about an officer patient of his who stammered badly,and whom Yealland had cured in – as usual – one session. Rivers – to hisown amusement and exasperation – had responded to the story bybeginning to stammer rather badly. And whenever he’d hesitated over aword, he’d sensed Yealland calculating the voltage. All nonsense of course.He’d been more amused by the situation than anything else, butnevertheless the worsening of his stammer did point to an underlyingconflict that might well find expression in a dream.The man in the corridor with the spinal contracture seemed to representSassoon, since he’d quoted the Declaration, though it was difficult toimagine anybody more physically unlike Sassoon than that deformed,pseudo-dwarf. And the expression of antagonism – that certainly didn’tcorrespond with anything in the real Sassoon’s attitude towards him. Butthen there was no reason why it should. The dream action is the creation ofthe dreamer. The mood of this dream, a mood so powerful he could still notshake it off, was one of the most painful self-accusation. The man’sexpression need reflect no more than his feeling that Sassoon, perhaps, hadgrounds for antagonism.He hadn’t been able to see the face of the second patient, and had noclear sense of who it was. The obvious candidate was Callan, since it wasCallan he’d watched being treated. And Callan had been working withhorses when he became mute, which might account for the bit. And yet hewas fairly certain the dream patient had not been Callan.On the wards he’d been struck by a slight facial resemblance betweenCallan and Prior, who had also been mute when he arrived at Craiglockhart.He remembered an incident shortly after Prior’s arrival when he’d draggeda teaspoon across the back of his throat, hoping that the choking reflexwould trigger the return of speech. This did sometimes happen. He’d seenmore than one patient recover his voice in that way. But he’d tried it whilein a state of acute irritation with Prior, and the choking had occasioned amomentary spasm of satisfaction. Very slight, but enough to make him feel,in retrospect, discontented with his own behaviour. Mute patients did arouseexasperation, particularly, as with both Prior and Callan, when theirsatisfaction with their condition was hardly at all disguised. Perhaps thedream patient was a composite figure, part Callan, part Prior, thecombination suggested by his application of a teaspoon to Prior’s throat andYealland’s application of an electrode to Callan’s.But there was no comparison in the amount of pain inflicted. On the faceof it he seemed to be congratulating himself on dealing with patients morehumanely than Yealland, but then why the mood of self-accusation? In thedream he stood in Yealland’s place. The dream seemed to be saying, indream language, don’t flatter yourself. There is no distinction.A horse’s bit. Not an electrode, not a teaspoon. A bit. An instrument ofcontrol. Obviously he and Yealland were both in the business of controllingpeople. Each of them fitted young men back into the role of warrior, a rolethey had – however unconsciously – rejected. He’d found himselfwondering once or twice recently what possible meaning the restoration ofmental health could have in relation to his work. Normally a cure impliesthat the patient will no longer engage in behaviour that is clearly self-destructive. But in present circumstances, recovery meant the resumption ofactivities that were not merely self-destructive but positively suicidal. Butthen in a war nobody is a free agent. He and Yealland were both locked in,every bit as much as their patients were.Bits. The scold’s bridle used to silence recalcitrant women in the MiddleAges. More recently, on American slaves. And yet on the ward, listening tothe list of Callan’s battles, he’d felt that nothing Callan could say couldhave been more powerful than his silence. Later, in the electrical room, asCallan began slowly to repeat the alphabet, walking up and down withYealland, in and out of the circle of light, Rivers had felt that he waswitnessing the silencing of a human being. Indeed, Yealland had come veryclose to saying just that. ‘You must speak, but I shall not listen to anythingyou have to say.’Silencing, then. The task of silencing somebody, with himself inYealland’s place and an unidentified patient in the chair. It was possible toescape still, to pretend the dream accusation was general. Just as Yeallandsilenced the unconscious protest of his patients by removing the paralysis,the deafness, the blindness, the muteness that stood between them and thewar, so, in an infinitely more gentle way, he silenced his patients; for thestammerings, the nightmares, the tremors, the memory lapses, of officerswere just as much unwitting protest as the grosser maladies of the men.But he didn’t believe in the general accusation. He didn’t believe this waswhat the dream was saying. Dreams were detailed, concrete, specific: thevoice of the protopathic heard at last, as one by one the higher centres of thebrain closed down. And he knew who the patient in the chair was. NotCallan, not Prior. Only one man was being silenced in the way the dreamindicated. He told himself that the accusation was unjust. It was Sassoon’sdecision to abandon the protest, not his. But that didn’t work. He knew theextent of his own influence.He went on sitting by the window as dawn grew over the Heath, and feltthat he was having to appeal against conviction in a courtroom where hehimself had been both judge and jury.TWENTY-THREEHead’s room was very quiet. The tall windows that overlooked the squarewere shrouded in white net. Outside was a day of moving clouds and fitfulsunlight, and whenever the sun shone, the naked branches of plane treespatterned the floor. So Head’s patients must sit, hour after hour, with thosebright, rather prominent eyes fixed on them, while elsewhere in the housedoors banged and a telephone started to ring. But there the normality of the‘consultation’ ended, for Head would never, not even under the mostextreme provocation, have told a patient that he was talking a load of self-indulgent rubbish. Rivers opened his mouth to protest and was waved intosilence.‘All right,’ Head swept on. ‘He’s muddle-headed, immature, liable to fitsof enthusiasm, inconsistent. All of that. But … And he virtually had nofather and he’s put you in his father’s place. But, he’s also’ – ticking off onhis fingers – ‘brave, capable of resisting any amount of pressure – the merefact he protested at all in the present climate tells us that – and above all –no, let me finish – he has integrity. Everything you’ve told me about himsuggests he was always going to go back, as soon as he knew the protestwas useless, simply because there’s no way he can honourably stay inCraiglockhart taking up a bed he doesn’t need.’Rivers smiled. ‘What are friends for if not letting you off the hook?’‘Well, let me get you off the other hook while I’m about it. You andYealland doing essentially the same thing. Good God, man, if you reallybelieve that it’s the first sign of dementia. I can’t imagine anybody less likeYealland – methods, attitudes, values – everything. The whole attitude tothe patient. And in spite of all this self-laceration, I can’t help thinking youknow that. Who would you rather be sent to if you were the patient?’‘You.’Head smiled.",
      "density_breakdown": {
        "Metaphor": 3.070310101320233,
        "Simile": 2.4562480810561866,
        "Imagery": 13.202333435677003,
        "Symbolism": 7.36874424316856,
        "Dialogue": 0.0,
        "Foreshadowing": 10.13202333435677,
        "Juxtaposition": 16.886705557261283,
        "Repetition": 6.140620202640466,
        "TOTAL_DENSITY": 59.256984955480505
      }
    }
  },
  "narrative_position_mapping": {
    "exposition": {
      "chapter_range": "1-3",
      "narrative_primary": 1,
      "optimized_primary": 2,
      "device_density_score": 54.03745778323611,
      "optimization_applied": true,
      "pages": ""
    },
    "rising_action": {
      "chapter_range": "4-13",
      "narrative_primary": 8,
      "optimized_primary": 8,
      "device_density_score": 64.14978514426028,
      "optimization_applied": false,
      "pages": ""
    },
    "climax": {
      "chapter_range": "14-15",
      "narrative_primary": 14,
      "optimized_primary": 14,
      "device_density_score": 52.19527172244397,
      "optimization_applied": false,
      "pages": ""
    },
    "falling_action": {
      "chapter_range": "16-21",
      "narrative_primary": 19,
      "optimized_primary": 16,
      "device_density_score": 54.02087170042971,
      "optimization_applied": true,
      "pages": ""
    },
    "resolution": {
      "chapter_range": "22-23",
      "narrative_primary": 23,
      "optimized_primary": 22,
      "device_density_score": 59.256984955480505,
      "optimization_applied": true,
      "pages": ""
    }
  },
  "macro_variables": {
    "narrative": {
      "voice": {
        "pov": "TPL",
        "pov_description": "Third person limited primarily through Rivers' perspective with occasional shifts to other characters",
        "focalization": "INT",
        "focalization_description": "Internal focalization through characters' consciousness, especially Rivers and Sassoon",
        "reliability": "REL",
        "temporal_distance": "IMM",
        "mode_dominance": "BAL",
        "free_indirect": "HEAVY",
        "stream_consciousness": "SOME",
        "character_revelation": "MIX",
        "narrative_intrusion": "SOME",
        "voice_consistency": "CONS"
      },
      "structure": {
        "chronology": "LIN",
        "framing": "NONE",
        "plot_architecture": "MONO",
        "plot_architecture_description": "Single plot following the treatment relationships at Craiglockhart Hospital",
        "pacing": "VAR",
        "temporal_span": "MEDIUM",
        "beginning_type": "MEDIAS",
        "ending_type": "OPEN",
        "scene_summary_ratio": "SCENE",
        "chapter_structure": "TRAD",
        "causation": "STRONG"
      }
    },
    "rhetoric": {
      "voice": {
        "tone": "Clinical yet empathetic, exploring psychological trauma with medical precision and human compassion",
        "register": "FORM",
        "stance": "OBJ",
        "ethos": "STRONG",
        "pathos": "STRONG",
        "logos": "STRONG",
        "irony": "SIT",
        "figurative_density": "MOD"
      },
      "structure": {
        "alignment_type": "TRANS",
        "narrative_rhetoric_relationship": "TIGHT",
        "primary_mechanism": "CHAR",
        "device_density": "MOD",
        "device_distribution": "EVEN",
        "mediation_strategy": "ACCUMULATION"
      }
    },
    "device_mediation": {
      "summary": "Devices mediate alignment through clinical observation and psychological realism, using dialogue, internal monologue, and symbolic imagery to reveal the complex dynamics between doctor and patient, challenging conventional notions of sanity, duty, and healing in wartime"
    }
  },
  "alignment_pattern": {
    "pattern_name": "Clinical Empathy",
    "core_dynamic": "Third-person limited access through medical perspective combines with objective yet compassionate stance to create therapeutic distance that enables deeper understanding of trauma.",
    "reader_effect": "Readers experience psychological wounds through both clinical observation and intimate consciousness, creating intellectual comprehension paired with emotional resonance.",
    "device_priorities": [
      "Juxtaposition",
      "Imagery",
      "Symbolism",
      "Foreshadowing",
      "Metaphor",
      "Repetition",
      "Dramatic Irony",
      "Interior Monologue"
    ]
  },
  "micro_devices": [
    {
      "name": "Third-Person Limited",
      "anchor_phrase": "Rivers watched him for a while",
      "location_percent": 15,
      "scene": "Rivers observing Sassoon during their therapeutic session",
      "effect": "Creates clinical empathy by filtering Sassoon's trauma through Rivers's medical perspective, maintaining therapeutic distance while enabling compassionate understanding",
      "assigned_section": "exposition",
      "chapter": 2,
      "chapter_range": "1-3",
      "pedagogical_tier": 5
    },
    {
      "name": "Metaphor",
      "anchor_phrase": "like trying to stop the ship would have been",
      "location_percent": 20,
      "scene": "Sassoon describing throwing his MC into the Mersey",
      "effect": "Transforms personal trauma into objective imagery that Rivers can clinically assess while preserving the emotional truth of Sassoon's futile gesture",
      "assigned_section": "exposition",
      "chapter": 2,
      "chapter_range": "1-3",
      "pedagogical_tier": 1
    },
    {
      "name": "Juxtaposition",
      "anchor_phrase": "You seem to have a very powerful anti-war neurosis",
      "location_percent": 25,
      "scene": "Rivers's diagnostic conclusion about Sassoon",
      "effect": "Places medical terminology against political conviction, demonstrating how clinical perspective reframes moral stance as psychological condition",
      "assigned_section": "exposition",
      "chapter": 2,
      "chapter_range": "1-3",
      "pedagogical_tier": 3
    },
    {
      "name": "Imagery",
      "anchor_phrase": "twisted and blackened shapes began to seem like old friends",
      "location_percent": 55,
      "scene": "Sassoon's memory of corpses before Arras",
      "effect": "Transforms horrific war imagery into familiar, almost comforting details, showing how clinical distance enables processing of unbearable trauma",
      "assigned_section": "exposition",
      "chapter": 2,
      "chapter_range": "1-3",
      "pedagogical_tier": 1
    },
    {
      "name": "Symbolism",
      "anchor_phrase": "Like a trench without the sky",
      "location_percent": 70,
      "scene": "Description of Craiglockhart's top corridor",
      "effect": "Hospital architecture becomes symbol of psychological entrapment, using clinical observation to reveal deeper truths about patient experience",
      "assigned_section": "exposition",
      "chapter": 2,
      "chapter_range": "1-3",
      "pedagogical_tier": 3
    },
    {
      "name": "Dialogue",
      "anchor_phrase": "Do you think I'm mad?",
      "location_percent": 18,
      "scene": "Sassoon's direct question to Rivers",
      "effect": "Creates therapeutic exchange where clinical expertise meets patient vulnerability, establishing the healing dynamic through professional discourse",
      "assigned_section": "exposition",
      "chapter": 2,
      "chapter_range": "1-3",
      "pedagogical_tier": 2
    },
    {
      "name": "Foreshadowing",
      "anchor_phrase": "it's my duty to try to change that",
      "location_percent": 28,
      "scene": "Rivers explaining his role to Sassoon",
      "effect": "Establishes the therapeutic tension between doctor's duty and patient's conviction, previewing the clinical challenge of treating principled dissent",
      "assigned_section": "exposition",
      "chapter": 2,
      "chapter_range": "1-3",
      "pedagogical_tier": 3
    },
    {
      "name": "Juxtaposition",
      "anchor_phrase": "This may come as a shock, Dr Rivers, but I had been rather assuming that we were not.",
      "location_percent": 8,
      "scene": "Prior and Rivers in therapy session discussing their adversarial relationship",
      "effect": "Places doctor-patient therapeutic alliance against Prior's resistance, creating clinical distance that reveals the deeper power dynamics of treatment",
      "assigned_section": "rising_action",
      "chapter": 8,
      "chapter_range": "4-13",
      "pedagogical_tier": 3
    },
    {
      "name": "Symbolism",
      "anchor_phrase": "thin line of khaki was just visible beneath the purple silk",
      "location_percent": 25,
      "scene": "Owen observing Sassoon in his dressing gown during their first meeting",
      "effect": "Military uniform beneath civilian luxury symbolizes the war's inescapable presence even in recovery, enabling objective assessment of trauma's permanence",
      "assigned_section": "rising_action",
      "chapter": 8,
      "chapter_range": "4-13",
      "pedagogical_tier": 3
    },
    {
      "name": "Imagery",
      "anchor_phrase": "skulls in the side. You looked back along and … Like mushrooms.",
      "location_percent": 55,
      "scene": "Owen describing ancient trenches to Sassoon",
      "effect": "Visceral sensory detail creates therapeutic distance through metaphorical transformation of trauma into observable phenomena",
      "assigned_section": "rising_action",
      "chapter": 8,
      "chapter_range": "4-13",
      "pedagogical_tier": 1
    },
    {
      "name": "Foreshadowing",
      "anchor_phrase": "A hundred years from now they'll still be ploughing up skulls.",
      "location_percent": 58,
      "scene": "Sassoon sharing his vision of the war's lasting impact",
      "effect": "Projects trauma's permanence into future perspective, allowing clinical examination of war's enduring psychological effects",
      "assigned_section": "rising_action",
      "chapter": 8,
      "chapter_range": "4-13",
      "pedagogical_tier": 3
    },
    {
      "name": "Third-Person Limited",
      "anchor_phrase": "Anderson, following Sassoon into the bar of the golf club, knew he owed him an apology.",
      "location_percent": 75,
      "scene": "Anderson's internal struggle after his violent outburst on the golf course",
      "effect": "Provides clinical access to Anderson's psychological state while maintaining therapeutic objectivity about his suppressed violence",
      "assigned_section": "rising_action",
      "chapter": 8,
      "chapter_range": "4-13",
      "pedagogical_tier": 5
    },
    {
      "name": "Metaphor",
      "anchor_phrase": "It's like a very deep voice saying, Run along, little man.",
      "location_percent": 53,
      "scene": "Owen describing the ancient, inevitable nature of war",
      "effect": "Transforms overwhelming trauma into analyzable metaphor, creating distance that enables understanding of war's psychological impact",
      "assigned_section": "rising_action",
      "chapter": 8,
      "chapter_range": "4-13",
      "pedagogical_tier": 1
    },
    {
      "name": "Dialogue",
      "anchor_phrase": "I don't write about that. I s-suppose I've always thought of p-poetry as the opposite of all that.",
      "location_percent": 65,
      "scene": "Owen explaining why he doesn't write war poetry to Sassoon",
      "effect": "Reveals character's psychological defense mechanisms through natural speech, allowing clinical observation of trauma avoidance",
      "assigned_section": "rising_action",
      "chapter": 8,
      "chapter_range": "4-13",
      "pedagogical_tier": 2
    },
    {
      "name": "Third-Person Limited",
      "anchor_phrase": "He wasn't surprised, he assumed Orme had come",
      "location_percent": 15,
      "scene": "Sassoon's hallucination of dead soldier Orme in his room",
      "effect": "Creates therapeutic distance by filtering traumatic experience through clinical observation while maintaining access to psychological state",
      "assigned_section": "climax",
      "chapter": 14,
      "chapter_range": "14-15",
      "pedagogical_tier": 5
    },
    {
      "name": "Symbolism",
      "anchor_phrase": "the two bloody bargains on which a civilization",
      "location_percent": 45,
      "scene": "Rivers examining church window depicting crucifixion and Abraham's sacrifice",
      "effect": "Uses religious imagery to clinically analyze societal structures that sacrifice youth, creating objective framework for understanding trauma's origins",
      "assigned_section": "climax",
      "chapter": 14,
      "chapter_range": "14-15",
      "pedagogical_tier": 3
    },
    {
      "name": "Juxtaposition",
      "anchor_phrase": "the inheritors were dying, not one by one",
      "location_percent": 50,
      "scene": "Rivers contrasting dying soldiers with civilians singing hymns",
      "effect": "Places clinical observation of mass death alongside domestic comfort to highlight the gap between trauma and civilian understanding",
      "assigned_section": "climax",
      "chapter": 14,
      "chapter_range": "14-15",
      "pedagogical_tier": 3
    },
    {
      "name": "Flashback",
      "anchor_phrase": "A memory tweaked the edges of his mind",
      "location_percent": 25,
      "scene": "Sassoon remembering childhood mirror and father's departure",
      "effect": "Provides clinical context for current abandonment feelings while maintaining therapeutic distance through structured recall",
      "assigned_section": "climax",
      "chapter": 14,
      "chapter_range": "14-15",
      "pedagogical_tier": 2
    },
    {
      "name": "Imagery",
      "anchor_phrase": "His fingers dug through the fluffiness into surprisingly",
      "location_percent": 70,
      "scene": "Rivers handling chickens with physical discomfort",
      "effect": "Creates visceral sensory details that mirror clinical examination of uncomfortable realities while maintaining objective stance",
      "assigned_section": "climax",
      "chapter": 14,
      "chapter_range": "14-15",
      "pedagogical_tier": 1
    },
    {
      "name": "Metaphor",
      "anchor_phrase": "little Atlases struggling to hold up the world",
      "location_percent": 85,
      "scene": "Rivers remembering chicks hatching by the fire",
      "effect": "Transforms clinical observation into compassionate understanding of vulnerability and struggle, embodying therapeutic empathy",
      "assigned_section": "climax",
      "chapter": 14,
      "chapter_range": "14-15",
      "pedagogical_tier": 1
    },
    {
      "name": "Foreshadowing",
      "anchor_phrase": "he found it difficult to envisage any future",
      "location_percent": 80,
      "scene": "Rivers thinking about writing to David Burns about his future",
      "effect": "Clinical assessment masked as casual observation hints at deeper understanding of trauma's long-term effects",
      "assigned_section": "climax",
      "chapter": 14,
      "chapter_range": "14-15",
      "pedagogical_tier": 3
    },
    {
      "name": "Motif",
      "anchor_phrase": "stammering boys, any age from ten to nineteen",
      "location_percent": 95,
      "scene": "Rivers remembering his father's speech therapy pupils",
      "effect": "Recurring theme of communication breakdown connects personal history to current therapeutic work, maintaining clinical yet empathetic perspective",
      "assigned_section": "climax",
      "chapter": 14,
      "chapter_range": "14-15",
      "pedagogical_tier": 3
    },
    {
      "name": "Third-Person Limited",
      "anchor_phrase": "Rivers thought how misleading it was",
      "location_percent": 45,
      "scene": "Rivers observing Burns during their evening conversation about Suffolk",
      "effect": "Provides medical perspective on Burns's condition while maintaining therapeutic distance through clinical observation of his psychological state",
      "assigned_section": "falling_action",
      "chapter": 16,
      "chapter_range": "16-21",
      "pedagogical_tier": 5
    },
    {
      "name": "Metaphor",
      "anchor_phrase": "a toothless mouth mumbling pebbles",
      "location_percent": 25,
      "scene": "Rivers and Burns walking along the beach at night",
      "effect": "Creates clinical imagery that transforms the natural environment into something that reflects trauma and decay, maintaining objective yet compassionate stance",
      "assigned_section": "falling_action",
      "chapter": 16,
      "chapter_range": "16-21",
      "pedagogical_tier": 1
    },
    {
      "name": "Juxtaposition",
      "anchor_phrase": "prematurely aged man and a fossilized schoolboy",
      "location_percent": 50,
      "scene": "Rivers analyzing Burns's psychological state during their conversation",
      "effect": "Presents clinical assessment of trauma's effects through contrasting elements, enabling deeper understanding through medical perspective",
      "assigned_section": "falling_action",
      "chapter": 16,
      "chapter_range": "16-21",
      "pedagogical_tier": 3
    },
    {
      "name": "Symbolism",
      "anchor_phrase": "tangles of barbed wire that ran",
      "location_percent": 30,
      "scene": "The beach walk where Burns seems oblivious to the war defenses",
      "effect": "War intrudes into peaceful setting while Burns appears not to see it, symbolizing his suppression and creating therapeutic distance for analysis",
      "assigned_section": "falling_action",
      "chapter": 16,
      "chapter_range": "16-21",
      "pedagogical_tier": 3
    },
    {
      "name": "Imagery",
      "anchor_phrase": "bones of Burns's face gleaming",
      "location_percent": 28,
      "scene": "Walking on the beach in moonlight",
      "effect": "Medical imagery emphasizes physical manifestation of trauma while maintaining objective observation that enables compassionate understanding",
      "assigned_section": "falling_action",
      "chapter": 16,
      "chapter_range": "16-21",
      "pedagogical_tier": 1
    },
    {
      "name": "Internal Monologue",
      "anchor_phrase": "Why do I go along with it?",
      "location_percent": 70,
      "scene": "Rivers working on his paper while Burns sits by the fire",
      "effect": "Provides clinical self-examination that combines medical perspective with therapeutic questioning, creating distance that enables deeper understanding",
      "assigned_section": "falling_action",
      "chapter": 16,
      "chapter_range": "16-21",
      "pedagogical_tier": 5
    },
    {
      "name": "Foreshadowing",
      "anchor_phrase": "But then why am I here?",
      "location_percent": 52,
      "scene": "Rivers wondering about the real reason for his invitation",
      "effect": "Medical intuition suggests underlying issues despite surface improvement, maintaining clinical empathy that anticipates deeper therapeutic needs",
      "assigned_section": "falling_action",
      "chapter": 16,
      "chapter_range": "16-21",
      "pedagogical_tier": 3
    },
    {
      "name": "Motif",
      "anchor_phrase": "the nightmare followed",
      "location_percent": 62,
      "scene": "Rivers hearing Burns's disturbed sleep despite daytime improvement",
      "effect": "Recurring trauma pattern observed through medical lens, providing objective evidence that enables compassionate understanding of suppression's limits",
      "assigned_section": "falling_action",
      "chapter": 16,
      "chapter_range": "16-21",
      "pedagogical_tier": 3
    },
    {
      "name": "Metaphor",
      "anchor_phrase": "a grotesque parody of Adam naming created things",
      "location_percent": 25,
      "scene": "Rivers walking on the Heath, haunted by images of Callan's treatment",
      "effect": "Creates clinical distance by intellectualizing the trauma through biblical comparison, enabling therapeutic understanding of the dehumanizing treatment",
      "assigned_section": "resolution",
      "chapter": 22,
      "chapter_range": "22-23",
      "pedagogical_tier": 1
    },
    {
      "name": "Symbolism",
      "anchor_phrase": "An instrument of control",
      "location_percent": 75,
      "scene": "Rivers analyzing his dream about the horse's bit",
      "effect": "The bit symbolizes systematic control mechanisms in therapy, allowing clinical examination of power dynamics while maintaining compassionate distance",
      "assigned_section": "resolution",
      "chapter": 22,
      "chapter_range": "22-23",
      "pedagogical_tier": 3
    },
    {
      "name": "Imagery",
      "anchor_phrase": "the moist, pink interior, the delicately quivering uvula",
      "location_percent": 55,
      "scene": "Rivers' nightmare about forcing an electrode into a patient's mouth",
      "effect": "Visceral medical imagery creates therapeutic distance through clinical precision while revealing the violence beneath treatment",
      "assigned_section": "resolution",
      "chapter": 22,
      "chapter_range": "22-23",
      "pedagogical_tier": 1
    },
    {
      "name": "Juxtaposition",
      "anchor_phrase": "recovery meant the resumption of activities that were not merely self-destructive but positively suicidal",
      "location_percent": 80,
      "scene": "Rivers reflecting on the paradox of psychiatric treatment during wartime",
      "effect": "Contrasts healing with harm to enable clinical analysis of therapeutic contradictions with empathetic understanding",
      "assigned_section": "resolution",
      "chapter": 22,
      "chapter_range": "22-23",
      "pedagogical_tier": 3
    },
    {
      "name": "Dramatic Irony",
      "anchor_phrase": "Perhaps Callan remembered, as Yealland apparently did not, that Mons had been a defeat",
      "location_percent": 15,
      "scene": "Yealland calling Callan 'a hero of Mons' during treatment",
      "effect": "Creates knowing distance between medical observer and practitioner, enabling critical yet compassionate evaluation of treatment methods",
      "assigned_section": "resolution",
      "chapter": 22,
      "chapter_range": "22-23",
      "pedagogical_tier": 4
    },
    {
      "name": "Internal Monologue",
      "anchor_phrase": "There is no distinction",
      "location_percent": 70,
      "scene": "Rivers analyzing his dream and its accusation about his methods",
      "effect": "Enables therapeutic self-examination through clinical introspection, maintaining professional distance while achieving deeper understanding",
      "assigned_section": "resolution",
      "chapter": 22,
      "chapter_range": "22-23",
      "pedagogical_tier": 5
    }
  ]
}