{
  "metadata": {
    "title": " Orbital",
    "author": " Samantha Harvey",
    "edition": " Grove Press, 2023.",
    "creation_date": "2025-12-10T20:17:15.824750",
    "protocol_version": "4.0",
    "kernel_version": "5.0",
    "chapter_aware": true,
    "structure_alignment_protocol": "v1.1",
    "device_density_optimization": true
  },
  "text_structure": {
    "has_chapters": true,
    "total_chapters_estimate": 22,
    "notes": "Chapter breaks identified during kernel creation"
  },
  "structure_detection": {
    "structure_type": "NAME",
    "total_units": 22,
    "special_elements": [],
    "notes": "Named orbital chapters following 24-hour structure: 'Orbit minus 1' through 'Orbit 16' with subdivisions"
  },
  "chapter_alignment": {
    "exposition": {
      "chapter_range": "1-3",
      "chapters": [
        1,
        2,
        3
      ],
      "primary_chapter": 1,
      "percentage": 14
    },
    "rising_action": {
      "chapter_range": "4-12",
      "chapters": [
        4,
        5,
        6,
        7,
        8,
        9,
        10,
        11,
        12
      ],
      "primary_chapter": 8,
      "percentage": 41
    },
    "climax": {
      "chapter_range": "13-14",
      "chapters": [
        13,
        14
      ],
      "primary_chapter": 13,
      "percentage": 9
    },
    "falling_action": {
      "chapter_range": "15-20",
      "chapters": [
        15,
        16,
        17,
        18,
        19,
        20
      ],
      "primary_chapter": 18,
      "percentage": 27
    },
    "resolution": {
      "chapter_range": "21-22",
      "chapters": [
        21,
        22
      ],
      "primary_chapter": 22,
      "percentage": 9
    }
  },
  "chapter_optimization": {
    "exposition": {
      "chapter_range": "1-3",
      "narrative_primary": 1,
      "optimized_primary": 1,
      "device_density_score": 52.709359605911324,
      "improvement_percent": 0.0,
      "optimization_applied": false,
      "chapter_text": "Also by Samantha Harvey Fiction The W ilderness All is Song Dear Thief The W estern W ind Nonfiction The Shapeless Unease: A Y ear of Not Sleeping OceanofPDF .comORBIT AL A NOVEL SAMANTHA HAR VEY Grove Press New Y ork OceanofPDF .comCopyright © 2023 by Samantha Harvey Map designed by Emma Lopes Jacket design and artwork by Kelly W inton All rights reserved. No part of this book may be reproduced in any form or by any electronic or mechanical means, including information storage and retrieval systems, without permission in writing from the publisher , except by a reviewer , who may quote brief passages in a review . Scanning, uploading, and electronic distribution of this book or the facilitation of such without the permission of the publisher is prohibited. Please purchase only authorized electronic editions, and do not participate in or encourage electronic piracy of copyrighted materials. Y our support of the author ’s rights is appreciated. Any member of educational institutions wishing to photocopy part or all of the work for classroom use, or anthology , should send inquiries to Grove Atlantic, 154 W est 14th Street, New Y ork, NY 1001 1 or permissions@groveatlantic.com . First published in 2023 in the United Kingdom by Jonathan Cape, an imprint of Penguin Random House UK. Published simultaneously in Canada This book was set in 1 1.65-pt. Dante by Alpha Design & Composition of Pittsfield, NH. First Grove Atlantic edition: December 2023 Library of Congress Cataloging-in-Publication data is available for this title. ISBN 978-0-8021-6154-3 eISBN 978-0-8021-6155-0 Grove Press an imprint of Grove Atlantic 154 W est 14th Street New Y ork, NY 1001 1 Distributed by Publishers Group W est groveatlantic .com OceanofPDF .com24 Hours of Earth Orbits W ith Daylight in the Northern Hemisphere OceanofPDF .comContents Orbit minus 1 Orbit 1, ascending Orbit 1, into orbit 2 Orbit 3, ascending Orbit 3, descending Orbit 4, ascending Orbit 4, descending Orbit 5, ascending Orbit 5, descending Orbit 6 Orbit 7 Orbit 8, ascending Orbit 8, descending Orbit 9 Orbit 10 Orbit 1 1 Orbit 12 Orbit 13 Orbit 14, ascending Orbit 14, descending Orbit 15 Orbit 16 AcknowledgementsOceanofPDF .comOrbit minus 1 Rotating about the earth in their spacecraft they are so together , and so alone, that even their thoughts, their internal mythologies, at times convene. Sometimes they dream the same dreams – of fractals and blue spheres and familiar faces engulfed in dark, and of the bright energetic black of space that slams their senses. Raw space is a panther , feral and primal; they dream it stalking through their quarters. They hang in their sleeping bags. A hand-span away beyond a skin of metal the universe unfolds in simple eternities. Their sleep begins to thin and some distant earthly morning dawns and their laptops flash the first silent messages of a new day; the wide-awake, always-awake station vibrates with fans and filters. In the galley are the remnants of last night’ s dinner – dirty forks secured to the table by magnets and chopsti cks wedged in a pouch on the wall. Four blue balloons are buoyed on the circulating air, some foil bunting says Happy Birthday , it was nobody’ s birthday but it was a celebration and it was all they had. There’ s a smear of chocolate on a pair of scissors and a small felt moon on a piece of string, tied to the handles of the foldable table. Outside the earth reels away in a mass of moonglow , peeling backward as they forge towards its edgeless edge; the tufts of cloud across the Pacific brighten the nocturnal ocean to cobalt. Now there’ s Santiago on South America’ s approaching coast in a cloud-hazed burn of gold. Unseen through the closed shutters the trade winds blowing across the warm waters of the Western Pacific have worked up a storm, an engine of heat. The winds take the warm th out of the ocean where it gathers as clouds which thicken and curdle and begin to spin in vertical stacks that have formed a typhoon. Asthe typhoon moves west towards southern Asia, their craft tracks east, eastward and down towards Patagonia where the lurch of a far-off aurora domes the horizon in neon. The Milky Way is a smoking trail of gunpowder shot through a satin sky . Onboard the craft it’s Tuesday morning, four fifteen, the beginning of October . Out there it’s Argentin a it’s the South Atlantic it’s Cape Town it’s Zimbabwe. Over its right shoulder the planet whispers morning – a slender molten breach of light. They slip through time zones in silence. They have each at some point been shot into the sky on a kerosene bomb, and then through the atmosphere in a burning capsule with the equivalent weight of two black bears upon them. They have each steeled their ribcages against the force until they felt the bears retreat, one after the other , and the sky become space, and gravity diminish, and their hair stand on end. Six of them in a great H of metal hanging above the earth. They turn head on heel, four astronauts (American, Japanese, British, Italian) and two cosmonauts (Russian, Russian); two women, four men, one space station made up of seventeen connecting modules, seventeen and a half thousand miles an hour. They are the latest six of many , nothing unusual about this any more, routine astronauts in earth’ s backyard. Earth’ s fabulous and improbable backyard. Turning head on heel in the slow drift of their hurtle, head on hip on hand on heel, turning and turning with the days. The days rush. They will each be here for nine months or so, nine months of this weightless drifting, nine months of this swollen head, nine months of this sardine living, nine months of this earthward gaping, then back to the patient planet below . Some alien civilisation might look on and ask: what are they doing here? Why do they go nowhere but round and round? The earth is the answer to every question. The earth is the face of an exulted lover; they watch it sleep and wake and become lost in its habits. The earth is a mother waiting for her child ren to return, full of stories and rapture and longing. Their bones a little less dense, their limbs a little thinner . Eyes filled with sights that are difficult to tell. OceanofPDF .comOrbit 1, ascending Roman wakes early . He sloughs off his sleeping bag and swims in the dark to the lab windo w. Where are we, where are we? Where on earth. It’s night and there’ s land. Into view edges a giant city nebula among reddish-rust- nothing; no, two cities, Johannesbur g and Pretoria locked together like a binary star. Just beyond the hoop of the atmosphere is the sun, and in the next minute it will clear the horizon and flood the earth, and dawn will come and go in a matter of seconds before daylight is everywhere at once. Central and East Africa suddenly bright and hot. Today is his four hundredth and thirty-fourth day in space, a tally arrived at over three different missions. He keeps close count. Of this mission it’s day eighty-eight . In a single nine-month mission there are in total roughly five hundred and forty hours of morning exercise. Five hundred morning and afternoon meetings with the American, European and Russian crews on the ground. Four thousand three hundred and twenty sunrises, four thousand three hundred and twenty sunse ts. Almost one hundred and eight million miles travelled. Thirty-six Tuesdays, for all that, this being one. Five hundred and forty times of having to swallow toothpaste. Thirty-six changes of T-shirt, a hundred and thirty-five changes of underwear (a fresh set of underwear every day is a storage luxury that can’t be afforded), fifty- four clean pairs of socks. Auroras, hurricanes, storms – their numbers unknown but their occurrence certain. Nine full cycles, of course, of the moon, their silver companion moving placidly through its phases while the days go awry . But all the same the moon seen several times a day and sometimes in strange distortion.To his tally kept on a piece of paper in his crew quarters, Roman will add the eighty-eighth line. Not to wish the time away but to try to tether it to something countable. Otherwise – otherwise the centre drifts. Space shreds time to pieces. They were told this in training: keep a tally each day when you wake, tell yourself this is the morning of a new day. Be clear with yourself on this matter . This is the morning of a new day . And so it is, but in this new day they’ll circle the earth sixtee n times. They’ll see sixteen sunrises and sixteen sunsets, sixteen days and sixteen nights. Roman clasps the handrail by the window to steady himself; the southern hemisphere stars are fleeting away . You’re bound to Coordinated Universal Time, ground crews tell them. Be clear with yourself on this matter , always clear . Look often at your watch to anchor your mind, tell yourself when you wake up: this is the morning of a new day . And so it is. But it’s a day of five continents and of autumn and spring, glaciers and deserts, wilderness es and warzones. In their rotations around the earth in accumulations of light and dark in the baffling arithmetic of thrust and attitude and speed and sensors, the whip-crack of morning arrives every ninety minutes. They like these days when the brief bloom of daybreak outside coincides with their own. In this last minu te of darkness the moon is near-full and low to the glow of atmos phere. It’s as if night has no idea it’s about to be obliterated by day. Roman has a sense of himself a few months hence staring from his bedroom window at home, moving aside his wife’ s array of dried – and to him unnameable – flowers, forcing open the condensated and stiff casement, leaning into the Moscow air, and seeing it, the same moon, like a souvenir he’s brought back from a holiday somewhere exotic. But it’s just for a moment and then the sight of this moon from the space station – lying squashed and low beyond the atmosphere, not really above them but across, like an equal – is everything, and that brief comprehension he had of his bedroom, his home, is gone. There was a lesson at school about the painting Las Meninas, when Shaun was fifteen. It was about how the painting disoriented its viewer and left them not knowing what it was they were looking at. It’s a painting inside a painting, his teacher had said – look close ly. Look here. Velázquez , the artist, is in the painting, at his easel, painting apainting, and what he’s painting is the king and queen, but they’re outside of the painting, where we are, looking in, and the only way we know they’re there is because we can see their reflection in a mirror directly in front of us. What the king and queen are looking at is what we’re looking at – their daughter and her ladies -in-waiting, which is what the painting is called – Las Meninas, ‘The Ladies-in-W aiting’. So what is the real subject of this painting – the king and queen (who are being painted and whose white reflected faces, though small, are in the centre background), their daughter (who is the star in the middle, so bright and blonde in the gloom), her ladies- (and dwarves and chaperones and dog) in-waiting, the furtive man mid-stride in the doorway in the background who seems to be bringing a message, Velázquez (whose presence as the painter is declared by the fact of him being in the painting, at his easel painting what is a picture of the king and queen but what also might be Las Meninas itself), or is it us, the viewers, who occupy the same position as the king and",
      "density_breakdown": {
        "Metaphor": 5.9113300492610845,
        "Simile": 3.4482758620689653,
        "Imagery": 19.21182266009852,
        "Symbolism": 6.403940886699507,
        "Dialogue": 0.0,
        "Foreshadowing": 1.9704433497536944,
        "Juxtaposition": 7.881773399014778,
        "Repetition": 7.881773399014778,
        "TOTAL_DENSITY": 52.709359605911324
      }
    },
    "rising_action": {
      "chapter_range": "4-12",
      "narrative_primary": 8,
      "optimized_primary": 10,
      "device_density_score": 60.56129985228951,
      "improvement_percent": 55.69620253164557,
      "optimization_applied": true,
      "chapter_text": "through the static and scratch. Are you there? Are you there, hello? OceanofPDF .comOrbit 5, descending The earth is a place of circular systems: growth and decomposition, rainfall and evap oration, alive with the cycling of air currents that shunt the weather around the continents. You know this of course, but in space you see it. The looping weather . This is what Nell could watch all day. A research meteorologist before she became an astronaut, she has an eye for the weather . How the earth drags at the air. See how the clouds at the equator are dragged up and eastward by the earth’s rotation. All the moist warm air evaporating off the equatorial oceans and pulled in an arc to the poles, cooling, sinking, tugged back down in a westward curve. Ceaseless movement. Although, these words – drag, pull, tug – they describe the force of this movement but not its grace, not its – what? Its synchronicity/fluidity/harmony . None of those is quite the word. It’s not so much that the earth is one thing and the weather another , but that they’re the same. The earth is its air currents, the air currents the earth, just as a face is not separate from the expressions it makes. What expression is this then, that she can see now? This typhoon that’s another ninety minutes bigger , ninety minutes bolder , and closer to land. It’s not anger , as people tend to say. It doesn’ t look from here anything like anger . More like defiance, strength, vivacity , the bulge-eyed tongue-out warrior face worn in the haka. She photographs the typhoon’ s approach. It’s extraordinary how she can see the curving of air that form s the trade winds, their sluicing westwards along the equato r, churning up warmth from the surface of the ocean. The resulting banks of cloud form in columns drawing fuel from the ocean; thewarmer the ocean, the larger the storm. She knows all this but she’s never seen it so animate. It’s really something, this typho on, Pietro says when he come s to join her. They watch it hone in on the Philippines and Taiwan and the coast of Vietnam. Its spiral flings clouds for hundreds of miles around a hole- punched siphoning eye. They seem scarily frail, don’t they, the Philippines, Pietro says. Little scraps of land that are first in line. They look like they could just wash away . Nell nods. I’ve been diving there several times, she says. I went to the Philippines on my honeymoon, he tells her. I went deep-sea diving in the Tubbataha reef, I’ve never seen a more incredible sight in my life, shapes and colours and creatures I could never have imagined. And I dived too off the island of Samar , I made friends with a fisherman, my wife and I had dinner with his family . The people are amazing, Nell says, so warm and open. I went diving at Coron Bay among the wrecks, and at Barracuda Lake, and Malapascua – we went out at dawn one day and saw manta rays and thresher sharks, the sharks are like sickles, like polished steel, they look almost man-made except for their worried little faces, and they move like – like they’re not moving, the water is undisturbed by them. I didn’ t see that but I saw a whale shark, says Pietro – did you see one? No, but I saw something I really wanted to see, a frogfish. Me too, says Pietro, my God, it was crazy, it was fantastic, bright yellow . And the sardine cloud, he says. Yes, Nell says, like a sea monster gliding past you. Just the light, Pietro says, stream ing through the water . Just the depth of the colour blue, Nell agrees. Just the light, the colour , the creatures, the coral, the sounds, just everything. Pietro agrees: just everything. Surprising things: The imagination Jackie Onassis’ s mode of death (lump in groin) The dinosaurs A blue pen with a red lid Green clouds Children in bow tiesWhen Chie heard of her mother ’s death she instantly went to one of the few earthly possessions she has in orbit – a photograph her mother gave her before she left to come here. In the photograph her mother is standing on the beach near their family home. She’s in her youth. Aged twenty-four , before she had Chie, when she moved, freshly married, to the house by the sea. Her mother is on the beach in a thick woollen coat, though it was July and must have been hot. On the back of the photograph it says Moon Landing Day, 1969 in her father ’s hand. Her mother is scowling up at the sky where a gull flies by at what seems like speed. The gull is blurred while her moth er is sharp, still, narrow and small. It isn’t clear whether her scowl is for the bird or the sky itself where she thinks the Apollo spaceship could be. For Chie , as a child, the photograph had a power she neither understood nor questioned. The lure of the absent moon, the absent landing, the great proclaimed day that was happen ing, but happening elsewhere. Mythical in its remove. Moon Landing Day. She’d thought as a child that it must have been what her mother was looking at from the beach, something happening up on the moon, and that her mother could see it with her naked eye. Or as if her mother had been part of the event in some way. And it wasn’ t until her mother gave her the photo before this mission that she remembered those thoughts, and felt their charge and the force of the past and how the past is so stealthy in making the future – because she’s sure looking back that this photo had generated her first thought of space. On the photo’ s reverse now, under Moon Landing Day , 1969, it says, this time in her moth er’s hand, For the next and all moon landing days ever to come. When Chie reads it, it seems so unlike her mother to write such a thing that she wonders if maybe her mother knew something, a presaging of her own death, and thought to smuggle in sentiment before she went. The thought leaves her blank. She misses her mother . She misses her toughness, her straightness, her distance. She expects that her mother was one of a kind. How many others have lain in a cot while an atomic bomb detonates? Not many . How many others lost their mother to that bomb on a terrible August day? Her mother ’s life was quiet and static, not a bit like Chie’ s. Come to think of it, the photo of her on the beach is a perfect emblem of that life, the world blurring past her while she stayed still. But though their lives couldn’ t be more differen t, all of Chie’ s courage she owes to hermother . Her resilience and thickness of skin and preparedness for anything, even the difficult or painful or dangerous. Her daring and delight at the difficult and dangerous. Her test-pilot brain that makes her think flying and breathe flying and dream flying . The sporting rivalry she has with death, which she’s winning and which makes her feel herself invincible, unbruisable. Quietly , unexpectedly reckless. She knows she is not – invincible that is. But she comes from a line that slipped through the crack, the fissure of history , found a way out while the whole thing came down. Her grandfather unwell the day of the bomb and sick from work and left with the baby , while her grandmother went to the market. There were no remains of her grandmother . There were few remains of anyone at the Nagasa ki munitions factory where her grandfather worked and where he would have been if not unwell. Everybody in Japan was unwell by that time, after years of war. Everybody was half-starved or had cholera or dysentery or malaria or any old virus or infection that rattled away in their bodies without hope of treatment – her grandfather had been unwell for a while with one of those viruses, and that was his first day off work. Why that day? If he’d been at work he would have died. If he’d not stayed at home the baby would not have stayed home with him; if the baby – Chie’ s mother – had gone to the market that day, her brief life would have met its end and Chie would not have later existed. Their family shuffled sideways through the crack of fate. Chie looks hard at the photogra ph. They had it displayed on one of the walls at home; she remembers her mother pointing it out. Look, Chie-chan, that’s me the day the men went to the moon. Even now she doesn’t know what she sees in that Moon Landing Day on the beach; she doesn’ t know what to read into the strangeness of the scene, the incongruity of image and title. She examines her mother ’s face, interrogates the scowl for a clue as to what it denotes, but she doesn’ t know . Everything she reads into it is after the fact, superim posed, and a guess at the truth. Why did the photograph end up on the wall when Chie was a child? What was so particular or telling or mean ingful about it? Was it a mother saying to her daughter : and now I will show you what’ s possible in your life, the near-limitlessn ess of what humans, and therefore you, can do? But then why the scowl, why not an expression of possibility or hope? Or was she saying: here are some men reaching the moon – do you see or hear a single woman among them, muchless a non-white, non-America n woman, do you notice that this is a collection of men in the full prime of their masculinity with their rockets and thrusters and payloads and the eyes of the world on them – this is what the world is, a playground for men, a laboratory for men, don’t compete because any attempts at compet ition will end in your feeling dispirited and inferior and crushed, why run a race you can never win, why set yourself up to fail – so pleas e know , my daughter , that you are not inferior and hold that grandly in your heart and live your inconsequential life as well as you can with a dignity of being, will you do that for me? Or was she saying: look at these men going to the moon, be afraid my child at what humans can do, because we know don’t we what it all means, we know the fanfare and glory of the pioneering human spirit and we know the wonder of splitting the atom and we know what these advances can do, your grandmother knew it only too well when she stepped off the pavement to a sound she didn’ t recognise and a flash that seemed both distant and so close it might have happened inside her own head, and in her bewilderment came a kernel of knowledge that this might be it, a knowledge that gave rise instantly to a vision of me, her first and only child, which was the last vision she ever experienced, so I am saying to you Chie, my first and only child, that you might regard in wonder these men walking on the moon but you must never forget the price humanity pays for its momen ts of glory , because humanity doesn’ t know when to stop, it doesn’ t know when to call it a day , so be wary is what I mean though I say nothing, be wary . For all the world it looks to Chie that she took the first of those possible messages and she took it as",
      "density_breakdown": {
        "Metaphor": 4.431314623338257,
        "Simile": 3.4465780403741997,
        "Imagery": 18.217626784835055,
        "Symbolism": 8.862629246676514,
        "Dialogue": 0.0,
        "Foreshadowing": 4.923682914820286,
        "Juxtaposition": 13.786312161496799,
        "Repetition": 6.893156080748399,
        "TOTAL_DENSITY": 60.56129985228951
      }
    },
    "climax": {
      "chapter_range": "13-14",
      "narrative_primary": 13,
      "optimized_primary": 14,
      "device_density_score": 47.267355982274744,
      "improvement_percent": 11.627906976744198,
      "optimization_applied": true,
      "chapter_text": "Pietro once told Roman, and he agreed, that’ s how it is.Just a few week s here leaves you paler and thinner . If humans were to stay long enough in space would they eventually take on the form of something amph ibious, Pietro wonders. He’s been here now almost six months and has three months more. He thinks he’s becoming a tadpole, all head and no body . With the atrophying of the body life doesn’ t tug at him so much. He feels hungry so he eats, and the sinuses are so blocked that the food has no taste; but anyway there’ s no real appetite, not really . He sleeps because he must, but his sleep is mostly tentative, not deep or robust as it is on earth. Everything in his body seems to lack commitment to the cause of its animal life, as if there’ s a cooling of systems, an efficient running-down of superfluous parts. In the slowing and cooling he hears his though ts more, they’re distant bells chiming one at a time in his head. In orbit his sense of life is simpler and gentler and more forgiving, not that his thoughts are different but that his thoughts are fewer and more distinct. They don’t avalanche like they used to. They come and they interest him for as long as they need to and then they go. There were some nights, about a month in, that he thought of his wife with an insane and afflictive longing, he thought of her bony nudity , tan lines, dark underarm hair, rack of ribs, tied wrists, sweat on her breasts in the siesta heat. The thoughts left him momentarily embittered and drunk with longing. A week after that he did his spacewalk with Nell, and the next night she, Nell, appeared in a dream that involved some setting on earth he wasn’ t familiar with, a room in absolute darkness that seemed cramped and was, in his mind, panelled with wood, but in which Nell’ s voice came from far away although her body was up against his. It was so surpri sing to find her there that something ecstati c had gone through his core. There was a party happening out of sight – he could just hear the music but had no real sense of where it was. He held her up against him and kissed her neck and repeated her name in awe. That’ s all he remembers and the next day at breakfast he could barely look at her , so embarrassed he was. The dream hasn’ t repeated, and it felt then that any last note of sexuality in his body quietened. It seemed to understand there was no point, and a switch was flicked of f, and all went blank and calm. OceanofPDF .comOrbit 8, descending When Nell went freediving she would think: maybe this is how it is to be an astronaut. Now up here she sometimes closes her eyes and thinks: this is like diving. The slow suspended way the body moves, calmly carried as if in water . And the way they move around the labyrinth of the spaceship as if around a wreck – the constricted spaces, the hatches that open into narrow tubes that warre n this way and that in near-identical patterns, until it’s hard to know where you started from or where the earth will be when you look out. And when you do look out any claustrophobia becomes agoraphobia in an instant, or you have both at once. She hauls cargo bags from one place to another . Everything burnable, everything not to go back to earth, goes into stowage; bags of food waste, rubbish, used tissues and toilet paper and wipes, trousers, T-shirts, socks, underwear and towels, gym clothes steeped in weeks of sweat, old tubes of toothpaste, every sachet of every meal and drink they’ve had, nail and hair cuttings, all of it to go, eventua lly, into the resupply craft that arrives next week, so that when it undocks in two months the whole lot will combust in the atmo sphere, and any debris left will begin its long life of earth orbit. The task becomes blindly physical, shunting large cargo cubes about in a 3D puzz le. It’s like a caravan here; there’ s too little room, everything is crammed everyw here, you push it down with your feet and strap it fast before it can float away . When she passes Anton in a doorway they turn on their sides and glide front-to-fro nt, her nose brushing the slight bulge of his belly . There was a caravanning holiday she had which couldn’ t have been long before her moth er died. Perhaps she was four or five. Just as she is now, hermother was shoving bags wher ever they would go, in the small kitchen cupboards whos e laminate was peeling off, in the trunks under the table seats, in the tiny bedroom wardrobe, in the overhead cupboards whose magnetic catche s clicked (the sound all day long was click-click -click), her mother quietly industrious as if they were moving in, not on holiday . And they did move around often, and there was a time ‘between homes’ as her father later said (where? she always imagined at some distant relative’ s or a friend’ s), but he didn’ t mention a caravan and if they’d lived in one, for however long, she’d have surely remembered. A low light outside – the late afternoon sobriety of what she knows instantly to be northern Europe, complex with cloud, under which there are numberless shades of brown. The south coast of Ireland – where her husband is – and England portside; they skirt below these coasts before going south through the centre of Europe. There’ s such steady purpose to the way they orbit, the way they seem always to climb toward the pale crest of the earth, never to reach it. But going with such patience and purpose nevertheless. And as they traverse south the colours change, the browns lighter , the palette less sombre , a range of greens from the dark of the mountainsides to the emerald of river plains to the teal of the sea. The rich purplish-green of the vast Nile Delta. Brown becomes peach becomes plum; Africa beneath them in its abstra ct batik. The Nile is a spillage of royal-blue ink. Her husband says that Africa from space looks like a late Turner; those near-formless landscapes of thick impasto shot with light. He’d told her once that if he were ever to be where she is, he’d spend his whole time in tears, helpless in the face of the earth’ s bare beauty . But that he’d never be where she is because he’s a man who disappoints himself with his need of firm ground. He needs stability inside and out, and to simplify his life lest it overwhelm him. There are people like him (so he says) who complicate their inner lives by feeling too much all at once, by living in knots, and who therefore need outer things to be simple. A house, a field, some sheep for example. And there are those who manage somehow , by some miracle of being, to simplify their inner lives so that outer things can be ambitious and limitless. Those people can swap out a house for a spaceship, a field for a universe. And though he’d give his leg to be the latter , it’s not the kind ofthing you can trade a leg for – in any case who’d want his leg if they already had limitlessness? Nobody has limitlessness, she’d said. He asked her then if she’d ever go to Mars , knowing the journey would be at least three years and that she might never come back. Yes, she’d answered without a moment’ s hesitation, and it was hard for her to understand why anyone would choose otherwise. I want to want to, he’d said. I want to be the kind of person who wants to go to Mars, but I’d go mad on the way, I’d be the one who cracked up and threatened the mission, they’d have to euthanise me for the greater good. Come on, she’d said kindly (though in essence she thought he was probably right). The last of the cargo bags to move today she puts in the airlock, with the spacesuits – ghostly floating things, touched with the rawness of space. Will she ever go back out in one of these? That really was like freediving, being outside of the craft. There was a time she went freediving at night through bioluminescence – stars sparking all around. Your lungs packed with air, your body and the water equa lising and becoming continuou s with one another , the mind tranquil and gathered. She and her husband exchange photographs almost daily; sometimes his view of the lough and the mountain and a bloodied sunset, sometimes a close-up of an icicle or sheep ear or flower or gatepost, sometimes the sea or the clouds reflected in the wet sand, once the night sky and a drawn circle where their spacecraft was travelling across – not visible in the photo but a caption: You Are Were Here. By the time you get this, he wrote in his message, you’ll have been round the world another eight or nine times. You’ve got to admit that it’s difficult, he said, having a wife flying above you at seventeen thousand miles an hour. Never knowing where she is or where to find her . In return she sends him picture s of the earth, of the stars and moon, of the sleeping quarters and crew mates and dinners and modules. Of Ireland, which is always at least partly under cloud. Of her on a bike in stark constantly stimulating fluorescent light, amid the clutter of cables, wires, experiment racks, cameras, computers, ducts, vents, bars, hatches, switches, panels. The truth is, he always knows where to find her. Her exact location is a publicly known and closely mapped fact, a set orbit predic table to the millisecond. She could be in any of the seventeen modules, but nowhereelse. Except just that once outside in space – but even then watched by hundreds and closely tethered. She is, it must be said, trapped. It’s his whereabouts that are less known; he could be anywhere. Of the six years of their relationship they’ve been married for five; of those five years she’ s been in astronaut training for four; of those four years they’ve spent only a handful of months together , and not even a third of those have been spent in his family home in Ireland which he inherited and moved into last year with a suitcase of things, because if he was going to be largely alone then better there than their flat in London where he had no garden or space or sense of himself. So now he pursues a life in a country she barely knows, a land as mythical to her as these earth views are to him. A land of reeds and bog cotton and gorse and fuchsia. His land, a photo of him in his fields in a sunset that blazed him to a silhouette, an absence. (A photo taken by whom?) So she asked him, Who is the more unknown? And his reply to that: Both differently but equally unknown. Your mind full of acronyms and mine full of sheep ailments. Both of us equally unknown. OceanofPDF .comOrbit 9 Hello? says Roman into the radio. Zdraste? Hello? Hello? Zdraste, hello. Is that really you? Is that space? Are you an astronaut? A cosmonaut, zdraste, hello. Pardon? How are you? I’m T ony. I’m Roman. I said T ony. I know . I can’ t hear you. I’m Roman. It’s crackly and kind of faint. I’m Roman, a cosmonaut. How are you? I’m well, how are you? I’m T ony. Pressing past the heliosphere in interstellar space are the two contraptions known as",
      "density_breakdown": {
        "Metaphor": 3.4465780403741997,
        "Simile": 2.9542097488921715,
        "Imagery": 14.278680452978827,
        "Symbolism": 5.908419497784343,
        "Dialogue": 0.0,
        "Foreshadowing": 5.416051206302314,
        "Juxtaposition": 12.801575578532743,
        "Repetition": 2.461841457410143,
        "TOTAL_DENSITY": 47.267355982274744
      }
    },
    "falling_action": {
      "chapter_range": "15-20",
      "narrative_primary": 18,
      "optimized_primary": 15,
      "device_density_score": 46.77498769079271,
      "improvement_percent": 63.79310344827586,
      "optimization_applied": true,
      "chapter_text": "Voyager 1 and Voyager 2, great coffee grinders wimbling into wayless dark. High-gain antenna, low-field magnetometer , high-field magnetometer , hydrazine thrusters, cosmic ray, yawing, pitching thirteen billion miles from earth and toward eternity . And on each one’s bus whichhouses the electronics is mounted a golden disc that could be a plaque or a portal but is in fact a phonograph, a vinyl, filled with sounds of earth. One day in the next five hundred billion years, while the probes complete one full circuit of the Milky Way, maybe they’ll stumble upon intelligent life. In forty thousand years or so, when the two probes sail close enough to a planetary system, maybe just maybe one of these planets will be home to some life form which will spy the probe with whatever it has that passes for eyes, stay its telescope, retrieve the derelict fuel-less old probe with whatever it has that passes for curiosity , lower the stylus (supplied) to the record with whatever it has that passes for digits, and set free the dadada- daa of Beethoven’ s Fifth. It’ll roll like thunder through a different frontier . Human music will permeate the Milky Way’s outer reaches. There’ll be Chuck Berry and Bach, there’ll be Stravinsky and Blind Willie Johnson, and the didgeridoo, violin, slide guitar and shakuhachi. Whale song will drift through the constellation of Ursa Minor . Perhaps a being on a planet of the star AC+793888 will hear the 1970s recording of sheep bleat, laughter , footsteps and the soft pluck of a kiss. Perhaps they’ll hear the trundle of a tractor and the voice of a child. When they hear on the phonograph a recording of rapid firecracker drills and bursts, will they know that these sounds denote brainwaves ? Will they ever infer that over forty thousan d years before in a solar system unknown a woman was rigged to an EEG and her thoughts recorded? Could they know to work backwards from the abstract sounds and translate them once more into brainwaves , and could they know from these brainwaves the kinds of thoughts the woman was havin g? Could they see into a human’ s mind? Could they know she was a young woman in love? Could they tell from this dip and rise in the EEG’ s pattern that she was thinking simultaneously of earth and lover as if the two were continuous? Could they see that, though she tried to keep to her mental script, to bring to mind Lincoln and the Ice Age and the hieroglyphs of ancient Egypt and whatever grand things had shaped the earth and which she wished to convey to an alien audience, every thought cascaded into the dark brows and proud nose of her lover , the wonderful articulation of his hands and the way he listened like a bird and how they had touched so often without touching. And then a spike in sound as she thought of that great city Alexandria and of nuclear disarmament and the symp hony of the earth’ s tides and the squareness of his jaw and the wayhe spoke with such bright precision so that everything he said was epiphany and discovery and the way he looked at her as though she were the epiphany he kept on having and the thud of her heart and the flooding of heat about her body when she considered what it was he wanted to do to her and the migratio n of bison acros s a Utah plain and a geisha’ s expressionless face and the knowledge of having found that thing in the world which she ought never to have had the good fortune of finding, of two minds and bodies flung at each other at full dumbfounding force so that her life had skittered sidelong and all her pin-boned plans just gone like that and her self engulfed in a fire of longing and thoughts of sex and destiny , the completeness of love, their astounding earth, his hands, his throat, his bare back. All of these thoughts sound like a pulsar . They’re a rapid breathless beating percussi on. What chance that any such life form will ever discover it, this golden disc, much less have any way of playing it, much less decode what the brainwaves mean? An infinitesimally small chance. Not a chance. But all the same the disc and its recordings will wander , trapped for eternity , around the Milky Way. In five billion years when the earth is long dead, it’ll be a love song that outlives spent suns. The sound signature of a love- flooded brain, passing through the Oort Cloud, through solar systems, past hurtling meteorites, into the gravitational pull of stars that don’ t yet exist. They watched yesterday the lunar rocket go cleanly into the night. They saw the fireball create a corona that lifted like a sudden sun, the ripping of the rocket boosters, a tower of smoke. Then the rocket forcing itself from the pandemonium of its launch and sailing up in ef fortless peace. They’d followed the lunar astronauts each step of the way, they knew how it was for them, partly knew and partly imagined how they would feel. Disorientation for a few second s on waking in their Cape Canaveral beach hut, followed by dawning, and then they’d sit up and swing their legs from the bed. From that moment onwards their thoughts would be clean and lean and they’d take a last shower and eat a last breakfast and go out of the beach hut to look at the sea and say not much. The electric shark of a car had come to pick them up. When they got a first glimpse of their rocket high on its staging, its three boost ers, twenty- seven engines, five million poun ds of thrust, the look on their faces was thebesotted sharp look of a street dog when it catches the scent of meat. Their families would refuse to wish them luck, knowing they were way beyond luck, in the launch-day zone of procedure and protocol, a weather briefing, one pill washed down for space sickness, another for pain relief, suit technicians waiting. Gloves on. 3D-printed helmet on. Retro superhero knee-high boots on. Leak-check the suit. Become flameproof and soundproof and vacuum-proof in a little cutting-edge bubble of simulated earth, should their capsule depressurise – but look a million dollars in a flatteringly tapered tux-like torso while the press take photos. You’re James Bond, a Stormtrooper , you’re Captain Marvel, you’re Batgirl. Go to the launch pad, get in the reclining sculpted seat with its piped-in airflow that arrives at the thigh. Comms checks, hatch-leak checks, test all the relays and all of the loops and all of the hardware. T est them again. At the beach hut they’d been human, a woman, a man, a wife and mother and daughter and a husband and father and son, and they’d crossed themselves, tapped their nails and bitten their lips in unconsciou s angst. But when they’d got to the launch pad they were Hollywood and sci-fi, Space Odyssey and Disney , imagineered, branded and ready . The rocket peaked in a cap of gleaming newness, absolute and spectacular whiteness and newness, and the sky was a glorious and conquerable blue. OceanofPDF .comOrbit 10 Some eighty million miles distant the sun is roaring. It edges now toward its eleven-or -so-year maximum, erupting and flashing, when you look you can see its edges are flayed with violent light and its surface sun-s pot-bruised. Immense solar flares send proton storms earthwards and in their wake are geomagnetic storms triggering light displays three hundred miles high. It’s a radioactive soup out there and if their shields were to fail they’d be cooked and they know it. But a strange effect happens when the sun is so active, whereby its radiation (comparatively meek and resistible) pushes away cosmic radiation (a veritable bag of spitting snakes) and the soup that they swim in is thereby tempered. What their shields don’t deflect the earth’ s magnetic fields do, and the dosimeter in the lab is barely perturbed. The sun’s partic le clouds billow , flares explode and whip earthward in eight minutes flat, energy pulses, explodes, a great ball of fusion and fury. In the sun’s fury they’re somewhat and improbably cocooned, as if the sun were a dragon and they, by stupendous fortune, had found themselves in its domain and protection. And in that leeside shelter here they are; it’s early evening now: Shaun collecting the rubbish bags, Roman cleaning the Russian toilet and Pietro the US, Anton cleaning the air purification system, Chie wiping and disinfecting, Nell vacuuming the air vents, where she finds a pencil, a bolt and a screwdriver , some hair and some nail clippings. Then a rare moment of aimlessness is upon them. Chie floats at the window portside knowing that their orbit is as far away from Japan as it can ever get; it’ll be another four hours or so before they pass it again. My mother is there, she thinks. Everything that’s left of my mother is there, andsoon it will be burned and gone. They’re skimming the very west of Africa, Mauritania, Mali now, soon Nigeria, Gabon, Angola; their second time of seeing these countries today , but this morning it was on the ascending orbit, this time they descend to skirt the coast and loop wide undernea th the Cape of Good Hope like those ships of old. Down over the arrowing peninsu la of Dakar , crossing the equator , and in the closing minutes of day the lights of Brazzaville and Kinshasa on either side of the Congo River tepid in the dusk. Blue becomes mauve becomes indigo becomes black, and night-time downs southern Africa in one. Gone is the paint-s plattered, ink-l eached, crumpled-satin, crumbled-pastel overflowing-fruit-bowl continent of chaotic perfection, the continent of salt pans and red sedimented floodplain and the nerve networks of splaying rivers and mountains that bubble up from the plains green and velvety like mould growth. Gone is a continent and here another sheer widow’ s veil of star-struck night. Roman and Anton are in the Russian module, Roman trying to find a loose screw that floated out of a pair of scissors and is now somewhere about his head; Anton is at the window looking nadir , legs aloft. There are the disappearing lights of Cape Town and storms over the ocean. Wherever you are at night over the earth, there’ s always somewhere the soft erratic pulse of lightnin g. Electric silver -blue silent flower opening and closing. Here, over there, over here. Absently Anton runs his fingers over a lump that’s appeared on his neck the last fortnight and that he tries to obscure by raising the colla r of his polo shirt. The last thing you need is to get sick in space. They’ll worry and send you home and, because you can’t fly back on your own, two others will have to go with you, and to cut short the missions of those two others would be unforgivable. He’ll say nothing to the flight surgeon or to his fellow crew and he’ll hope nobody notices. It’s the size of a cherry in the low hollow of his neck, and perfectly painless. There’ s his wife at home, herself so long unwell, and he’s told their children he’ll let nothing bad happen to any of them ever, as if such a thing were within his gift. He’s the vehicle that carries them all throug h darkness, and the weight of that has borne him along for years and years. But he, too, is preyed on by darkness, as we all are. He never knew how to tell them that. He never knew how to say to his wife what he wanted amicably to say:Zabudem, ladno? Let’s forget it, shall we? Let’s call it a day. We don’t love one another any more, why complicate what’ s simple? When he found the lump those were the words that came",
      "density_breakdown": {
        "Metaphor": 1.4771048744460857,
        "Simile": 1.4771048744460857,
        "Imagery": 14.278680452978827,
        "Symbolism": 7.385524372230428,
        "Dialogue": 0.0,
        "Foreshadowing": 9.847365829640571,
        "Juxtaposition": 9.354997538158543,
        "Repetition": 2.9542097488921715,
        "TOTAL_DENSITY": 46.77498769079271
      }
    },
    "resolution": {
      "chapter_range": "21-22",
      "narrative_primary": 22,
      "optimized_primary": 22,
      "device_density_score": 41.3589364844904,
      "improvement_percent": 0.0,
      "optimization_applied": false,
      "chapter_text": "up-for-sale wilderness, this new black gold, this new domain ripe for the taking. Through their quarter -of-a-million-mile sward of space. Here sleep Anton, Roman, Nell, Chie, Shaun and Pietro in tubular modules that are daily pelted and barraged and pitted with dents. They hang like bats in their quarters. Anton wakes briefly with his fist in his cheek. His first and only thought is of the spacecraft on its way to the moon, accompanied by one piercing feeling of childhood joy which pops like a bubble as he drops back to sleep. On Pietro’ s monitor that’s fastened to the rigging near his head, a message has come up in silence from his wife with a link to a news story about the terrible destruction of the typhoon, which will stay there unread until morning. An unread message on Shaun’ s screen too, a video of a goat jumping on a trampoline, from his daughter , with no caption except ILY! The modules are dark and shuttered. The robotic workstation, the resistance traine r, the computers with their timelines of work for the following day that are being uploaded now from the ground; the cameras and microscopes, the piles of cargo bags, the experiment gloveboxes, the bio-product lab and its module of mice, the pond where their bags of water are stowed, Anton’ s cabbages and pea shoots, the suits in the airlock, nodding crudely human puppets giving of f the burnt smell of space.It’s almost five in the morning and Roman knows in this light band of pre-alarm sleep that they’ll be circling now somewhere near Turkmenistan, Uzbekistan, which means that south-western Russia will be distant portside, that outlying hook between the Black and Caspian Seas. Overnight the cities have been laid down in the season’ s first fine snow – Samara and Tolyatti on the gorged banks of the Volga, a black snake hulking through white. It’s as if each orbit is encoded into him. He’s been up here almo st half a year now and he knows the paths they take over the earth, the procession of orbits, their repeating patterns. Even in sleep he’s remotely aware of the sun glinting off the gold domes of Tolyatti’ s cathedral – a flash of light that seems to appear from nothing. A little way south the triangular shape of Volgograd, which they see from above when they fly from Star City to Kazakhstan for their launch; when you see Volgograd from the plane you know you’re near the Kazakhsta n border and leaving Russia and everything and everyone behind. The crack that’s appeared outside gives a millimetre or two. It sends out fissures that broadly echo an aerial map of the confluencing Volga River . It’s not so far from Roman’ s head, this crack, on the other side of the thin alloy shell, and no patching with epoxy and Kapton tape is going to hold it. The pressure in the Russian module drops just a fraction, barely noticeable, not enough to sound any alarm, and the clocks count themselves round towards waking time and the onset of another blitzed and man-made day . When you’ve moved along the length of the spaceship to its aft, through hatches that get ever smaller and modules that get ever older , and you’ve come here to the decrepit Sovie t bunker right at the end where Anton and Roman sleep, then you see the table still littered from dinner (a bad habit of this crew to leave their clearing up to the next day) – there are some spoons fastened with Velcro, and fasten ed next to them two empty vacuum-packed sachets of olives, the sachets now stuffed with napkins that are splattered with borsch, there are four idly spinning crumbs of honeycomb that have been caught for now in an equilibrium of forces between the module’ s air vents which push them one way and the spacecraft’ s air vents that pull them the other, and below where they float there are some unopened packets of bread cubes pegged to the wall.A foot or so beyond those four suspended crumbs is the photo graph of Roman’ s hero, Sergei Krikalev – thin, neat and inscrutable, small-eared, blue-eyed, sligh t melancholia about the face, a touch of the Mona Lisa smile. It was he, Krikalev , who was one of the first two human s up here in this craft and it was he who first turned on the lights which ebbed through windows into the bare dark. He seems to know that something is ending, that all good things must go this way, towards fracture and fallout. So many astronauts and cosmonauts have passed through here, this orbiting laboratory , this science experiment in the carefully controlled nurtu ring of peace. It’s going to end. And it will end through the restless spirit of endeavour that made it possible in the first place. Striking out, further and deeper . The moon, the moon . Mars, the moon. Further yet. A human being was not made to stand still. Maybe we’re the new dinosaurs and need to watch out. But then maybe against all the odds we’ll migrate to Mars where we’ll start a colony of gentle preservers, people who’ ll want to keep the red planet red, we’ll devise a planeta ry flag because that’s a thing we lacked on earth and we’ve come to wonder if that’ s why it all fell apart, and we’ll look back at the faint dot of blue that is our old convalescing earth and we’ll say, Do you remember? Have you heard the tales? Maybe there’ s another parent-planet – earth was our mother and Mars, or somewhere, will be our father . We are not such orphans-in-waiting after all. Krikalev seems to look out now from the photograph as a god looks on its creation, with a patient forbearance. Humankind is a band of sailors, he’s thinking, a brotherhood of sailo rs out on the oceans. Humankin d is not this nation or that, it is all together , always together come what may. He sits in timeless stillnes s amid the module’ s perpetual eighty-decibel machine vibration while around him the green Velcroed flammable walls close in airlessly . And each day and week the crack on its hull widens and Krikalev’ s smile seems more and more vaunted and more and more godly . Let ther e be light, he seems quietly to say . Forty or fifty bodies are sheltered behind the altar of a chapel which squats low among trees. Floodwater reaches to its roof. The mile of coconut plantation between here and the coast is submer ged completely by the tidal surge, but the buf fering of the trees has saved the chapel; by design it has nowindows along its east elevation which is toward the ocean and those elsewhere are so far spared. The chapel door strains but holds under the burden of water . The concrete walls crack, but they hold too. Hunks of plaster fall from the ceiling under the stooping timbers. A dead shark tumbles past the front window . The wind is ebbing. The people inside no longer hear it slamming against the roof. If the building can withstand the flood for anothe r few hours until the water recedes they’ll make it. They pray. It’s the Santo Niño that’s saving them, they’re inclined to believe. Even the non- or less religious think it now. Gathered around this little embroidered effigy of the child Jesus, praying and praying, praying for hours, turning away from the ocean that leans on the windows, whispering and muttering and clutching each other , they suppose they must be witnessing a miracle. They don’t know how else the building could stand. It isn’t possible. Far bigger and more robust buildings will have collapsed in the rampage of this typhoon. But if the Santo Niño remains in its glass casing intact then they’ll remain intact too. They’ve taken it from its ledge and huddled around and they daren’ t move; somehow a few of their children who’d been wailing in fear are now sound asleep. The fisherman’ s wife has one child in her cross-legged lap and another propped against her. The other two children are curled asleep with their heads in the fisherman’ s lap, his right hand laid quietly on one forehead, left on the other . His wife has a gash across her shoulder from a sheet of metal as they were fleeing, which she bears without complaint. An unearthly watery light fills the chapel, a smell of brine and wet wood. The children are safe. The sea has stopped surging, it rests exhausted. The wind is ebbing. From space the Philippines and Indonesia are shrouded now in fine arrangements of cloud in multiple vortices and eddies that soon will push westward. The typhoon has smashed itself to pieces against the land. The islands are smaller than they were several hours ago, misshapen by flood. The worst is gone. From the east shunts a bright front of unfor giving heat rolling in off the Pacific, which, from the last descent of this sixteenth orbit, is a glorious coppering of disbanded light. It isn’t water , it isn’t earth, it’s only photonsand it can’t be grasped and it can’t remain. It starts to unpick as night falls steep across the tranche of the Southern Pacific. One day a few years hence, at this very spot in the Pacific that it’s passing now, this craft will bow graciously out of orbit and plummet through the atmosphere into the ocean. Submarines will go down to explore its wreckage. But that’s another thirty-five thousand orbits away . This orbit reaches its deepest edge where auroras flicker across Antarctica and the moon rises huge as a buckled bicycle wheel. It’s 5.30 a.m. Wednesday morning; moon-landing day . The stars explode. Out there, electromagnetic vibrations ripple through the vacuum as bodies in space give out light. If these vibrations are translated into sounds then the planets each have their own music, the sound of their light. The sound of their magnetic fields and ionospheres, their solar winds, the radio waves trapped between the planet and its atmosphere. Neptune’ s sound is liquid and rushing, a tide crashing onto a shore in a howling storm; Saturn’ s is that of the sonic boom of a jet, a sound that resonates up through your feet and between the bones; Saturn ’s rings are different still, a gale siphoning through a derelict building but in slowed and warping tempo. Uranus a frantic zapping screech. Jupiter ’s moon, Io, makes the metallic pulsing hum of a tuning fork. And the earth, a complex orchestra of sounds, an out-of-tune band practice of saws and woodwind, a spacey full-throttle distortion of engines, a speed- of-light battle between galactic tribes, a ricochet of trills from a damp rainforest morning, the opening bars of electronic trance, and behind it all a ringing sound, a sound gathered in a hollow throat. A fumbled harmony taking shape. The soun d of very far-off voices coming together in a choral mass, an angelic sustained note that expands through the static. You think it’ll burst into song, the way the choral sound emer ges full of intent, and this polished-bead planet sounds briefly so sweet. Its light is a choir . Its light is an ensemble of a trillion things which rally and unify for a few short moments before falling back into the rin-tin-tin and jumbled tumbling of static galactic wood wind rainforest trance of a wild and lilting world. OceanofPDF .comAcknowledgements With gratitude to NASA and ESA for the wealth of inform ation made available. And for the various gifts of support: the Society of Authors, the Santa Maddalena Foundation, Yaro Savelyeva, Paul Lynch, Max Porter , Nathan Filer, Al Halcrow , Seren Adams, Dana Friis, Rick Hewes, Anna Webber , Elisabeth Schmitz, Lilly Sandber g, Zeljka Marosevic, David Milner , Emma Lopes, Michal Shavit, and Dan Franklin (for getting me this far) – thank you, so much. OceanofPDF .comOceanofPDF .com",
      "density_breakdown": {
        "Metaphor": 2.9542097488921715,
        "Simile": 1.9694731659281144,
        "Imagery": 19.202363367799116,
        "Symbolism": 5.416051206302314,
        "Dialogue": 0.0,
        "Foreshadowing": 4.431314623338257,
        "Juxtaposition": 4.923682914820286,
        "Repetition": 2.461841457410143,
        "TOTAL_DENSITY": 41.3589364844904
      }
    }
  },
  "narrative_position_mapping": {
    "exposition": {
      "chapter_range": "1-3",
      "narrative_primary": 1,
      "optimized_primary": 1,
      "device_density_score": 52.709359605911324,
      "optimization_applied": false,
      "pages": ""
    },
    "rising_action": {
      "chapter_range": "4-12",
      "narrative_primary": 8,
      "optimized_primary": 10,
      "device_density_score": 60.56129985228951,
      "optimization_applied": true,
      "pages": ""
    },
    "climax": {
      "chapter_range": "13-14",
      "narrative_primary": 13,
      "optimized_primary": 14,
      "device_density_score": 47.267355982274744,
      "optimization_applied": true,
      "pages": ""
    },
    "falling_action": {
      "chapter_range": "15-20",
      "narrative_primary": 18,
      "optimized_primary": 15,
      "device_density_score": 46.77498769079271,
      "optimization_applied": true,
      "pages": ""
    },
    "resolution": {
      "chapter_range": "21-22",
      "narrative_primary": 22,
      "optimized_primary": 22,
      "device_density_score": 41.3589364844904,
      "optimization_applied": false,
      "pages": ""
    }
  },
  "macro_variables": {
    "narrative": {
      "voice": {
        "pov": "TPO",
        "pov_description": "Omniscient access to multiple characters' thoughts, dreams, and internal experiences across astronauts",
        "focalization": "ZERO",
        "focalization_description": "Unlimited access to all characters' consciousness and external cosmic perspective",
        "reliability": "REL",
        "temporal_distance": "IMM",
        "mode_dominance": "DIE",
        "free_indirect": "HEAVY",
        "stream_consciousness": "SOME",
        "character_revelation": "IND",
        "narrative_intrusion": "SOME",
        "voice_consistency": "CONS"
      },
      "structure": {
        "chronology": "LIN",
        "framing": "NONE",
        "plot_architecture": "MONO",
        "plot_architecture_description": "Single orbital journey structured around 16 earth orbits over 24 hours",
        "pacing": "SLOW",
        "temporal_span": "BRIEF",
        "beginning_type": "AB_OVO",
        "ending_type": "CIRCULAR",
        "scene_summary_ratio": "SUM",
        "chapter_structure": "FRAG",
        "causation": "THEME"
      }
    },
    "rhetoric": {
      "voice": {
        "tone": "Contemplative, meditative, philosophical with undertones of cosmic wonder and human vulnerability",
        "register": "POET",
        "stance": "OBJ",
        "ethos": "STRONG",
        "pathos": "MOD",
        "logos": "MOD",
        "irony": "SIT",
        "figurative_density": "HIGH"
      },
      "structure": {
        "alignment_type": "TRANS",
        "narrative_rhetoric_relationship": "TIGHT",
        "primary_mechanism": "THEME",
        "device_density": "HIGH",
        "device_distribution": "EVEN",
        "mediation_strategy": "ACCUMULATION"
      }
    },
    "device_mediation": {
      "summary": "Literary devices accumulate to create a contemplative orbital consciousness, using scientific imagery and cosmic metaphors to transform human perspective through the repetitive, meditative rhythm of orbital cycles, gradually building toward philosophical revelation about Earth's fragility and human connection"
    }
  },
  "alignment_pattern": {
    "pattern_name": "Cosmic Contemplation",
    "core_dynamic": "Omniscient access to multiple consciousness flows combines with objective philosophical stance to create meditative observation of human experience against cosmic scale.",
    "reader_effect": "Readers experience simultaneous intimacy with individual human thoughts and vast detachment of cosmic perspective, creating contemplative distance that elevates mundane experience to universal significance.",
    "device_priorities": [
      "Imagery",
      "Juxtaposition",
      "Symbolism",
      "Repetition",
      "Metaphor",
      "Foreshadowing",
      "Motif",
      "Stream of Consciousness"
    ]
  },
  "micro_devices": [
    {
      "name": "Third-Person Omniscient",
      "anchor_phrase": "even their thoughts, their internal mythologies, at times convene",
      "location_percent": 5,
      "scene": "Opening description of astronauts in orbit",
      "effect": "Establishes omniscient access to multiple consciousness flows, enabling meditation on collective human experience in space",
      "assigned_section": "exposition",
      "chapter": 1,
      "chapter_range": "1-3",
      "pedagogical_tier": 5
    },
    {
      "name": "Metaphor",
      "anchor_phrase": "Raw space is a panther, feral and primal",
      "location_percent": 8,
      "scene": "Astronauts dreaming in their sleeping bags",
      "effect": "Transforms abstract cosmic void into visceral, primal force that emphasizes human vulnerability against cosmic scale",
      "assigned_section": "exposition",
      "chapter": 1,
      "chapter_range": "1-3",
      "pedagogical_tier": 1
    },
    {
      "name": "Juxtaposition",
      "anchor_phrase": "A hand-span away beyond a skin of metal the universe unfolds",
      "location_percent": 10,
      "scene": "Astronauts sleeping with universe beyond station wall",
      "effect": "Contrasts human fragility with infinite cosmos, creating meditative awareness of scale and human position",
      "assigned_section": "exposition",
      "chapter": 1,
      "chapter_range": "1-3",
      "pedagogical_tier": 3
    },
    {
      "name": "Imagery",
      "anchor_phrase": "The Milky Way is a smoking trail of gunpowder",
      "location_percent": 25,
      "scene": "View of galaxy from space station",
      "effect": "Creates vivid sensory experience of cosmic phenomena, facilitating contemplative observation of universal beauty",
      "assigned_section": "exposition",
      "chapter": 1,
      "chapter_range": "1-3",
      "pedagogical_tier": 1
    },
    {
      "name": "Repetition",
      "anchor_phrase": "turning and turning with the days",
      "location_percent": 35,
      "scene": "Description of astronauts' orbital motion",
      "effect": "Emphasizes cyclical nature of orbital existence, creating meditative rhythm that mirrors cosmic repetition",
      "assigned_section": "exposition",
      "chapter": 1,
      "chapter_range": "1-3",
      "pedagogical_tier": 2
    },
    {
      "name": "Symbolism",
      "anchor_phrase": "The earth is the face of an exulted lover",
      "location_percent": 40,
      "scene": "Philosophical reflection on Earth's meaning to astronauts",
      "effect": "Transforms planet into symbol of intimate human connection, enabling contemplation of humanity's cosmic relationship",
      "assigned_section": "exposition",
      "chapter": 1,
      "chapter_range": "1-3",
      "pedagogical_tier": 3
    },
    {
      "name": "Personification",
      "anchor_phrase": "The earth is a mother waiting for her children",
      "location_percent": 41,
      "scene": "Continued reflection on Earth's significance",
      "effect": "Humanizes planet to create emotional bridge between cosmic scale and human experience in meditative observation",
      "assigned_section": "exposition",
      "chapter": 1,
      "chapter_range": "1-3",
      "pedagogical_tier": 1
    },
    {
      "name": "Paradox",
      "anchor_phrase": "so together, and so alone",
      "location_percent": 3,
      "scene": "Opening description of astronauts' shared isolation",
      "effect": "Captures contradictory nature of human connection in cosmic isolation, enabling philosophical contemplation of existence",
      "assigned_section": "exposition",
      "chapter": 1,
      "chapter_range": "1-3",
      "pedagogical_tier": 3
    },
    {
      "name": "Metaphor",
      "anchor_phrase": "just as a face is not separate from the expressions it makes",
      "location_percent": 15,
      "scene": "Nell observing Earth's weather systems from orbit",
      "effect": "Creates unity between Earth and its atmospheric movements, dissolving the boundary between observer and observed in cosmic contemplation",
      "assigned_section": "rising_action",
      "chapter": 10,
      "chapter_range": "4-12",
      "pedagogical_tier": 1
    },
    {
      "name": "Personification",
      "anchor_phrase": "More like defiance, strength, vivacity, the bulge-eyed tongue-out warrior face",
      "location_percent": 20,
      "scene": "Nell viewing the typhoon approaching land",
      "effect": "Transforms destructive weather into animate expression, enabling meditative observation of natural forces as cosmic performance rather than mere meteorology",
      "assigned_section": "rising_action",
      "chapter": 10,
      "chapter_range": "4-12",
      "pedagogical_tier": 1
    },
    {
      "name": "Juxtaposition",
      "anchor_phrase": "They seem scarily frail, don't they, the Philippines",
      "location_percent": 30,
      "scene": "Pietro and Nell watching typhoon approach inhabited islands",
      "effect": "Contrasts human vulnerability with cosmic forces, heightening awareness of scale while maintaining objective philosophical stance",
      "assigned_section": "rising_action",
      "chapter": 10,
      "chapter_range": "4-12",
      "pedagogical_tier": 3
    },
    {
      "name": "Symbolism",
      "anchor_phrase": "Moon Landing Day, 1969 in her father's hand",
      "location_percent": 50,
      "scene": "Chie examining her mother's photograph after learning of her death",
      "effect": "The photograph becomes symbol of human ambition and cosmic connection across generations, linking personal grief to universal exploration",
      "assigned_section": "rising_action",
      "chapter": 10,
      "chapter_range": "4-12",
      "pedagogical_tier": 3
    },
    {
      "name": "Flashback",
      "anchor_phrase": "Her grandfather unwell the day of the bomb",
      "location_percent": 75,
      "scene": "Chie recalling her family's survival of Nagasaki bombing",
      "effect": "Reveals how historical catastrophe shaped present consciousness, demonstrating how individual lives intersect with cosmic-scale events",
      "assigned_section": "rising_action",
      "chapter": 10,
      "chapter_range": "4-12",
      "pedagogical_tier": 2
    },
    {
      "name": "Repetition",
      "anchor_phrase": "Just the light, Pietro says, streaming through the water",
      "location_percent": 40,
      "scene": "Pietro and Nell sharing memories of diving in Philippines",
      "effect": "Creates meditative rhythm that mirrors the cyclical patterns they observe from space, reinforcing cosmic contemplation through shared human experience",
      "assigned_section": "rising_action",
      "chapter": 10,
      "chapter_range": "4-12",
      "pedagogical_tier": 2
    },
    {
      "name": "Stream of Consciousness",
      "anchor_phrase": "Or was she saying: look at these men going to the moon",
      "location_percent": 85,
      "scene": "Chie interpreting her mother's possible meanings in the photograph",
      "effect": "Allows omniscient access to layered consciousness interpreting cosmic achievement through personal and cultural lens",
      "assigned_section": "rising_action",
      "chapter": 10,
      "chapter_range": "4-12",
      "pedagogical_tier": 5
    },
    {
      "name": "Imagery",
      "anchor_phrase": "the sharks are like sickles, like polished steel",
      "location_percent": 35,
      "scene": "Nell describing underwater creatures she encountered diving",
      "effect": "Creates vivid sensory bridge between Earth's depths and orbital perspective, maintaining connection to planetary life while in cosmic observation",
      "assigned_section": "rising_action",
      "chapter": 10,
      "chapter_range": "4-12",
      "pedagogical_tier": 1
    },
    {
      "name": "Metaphor",
      "anchor_phrase": "He thinks he's becoming a tadpole, all head and no body",
      "location_percent": 15,
      "scene": "Pietro reflecting on his physical transformation in space",
      "effect": "Creates meditative observation of human adaptation to cosmic environment, embodying the pattern's contemplation of human experience against cosmic scale",
      "assigned_section": "climax",
      "chapter": 14,
      "chapter_range": "13-14",
      "pedagogical_tier": 1
    },
    {
      "name": "Simile",
      "anchor_phrase": "this is like diving. The slow suspended way the body moves",
      "location_percent": 45,
      "scene": "Nell comparing spacewalking to freediving",
      "effect": "Juxtaposes terrestrial and cosmic experiences, facilitating philosophical contemplation of human movement across different realms of existence",
      "assigned_section": "climax",
      "chapter": 14,
      "chapter_range": "13-14",
      "pedagogical_tier": 1
    },
    {
      "name": "Imagery",
      "anchor_phrase": "Africa beneath them in its abstract batik. The Nile is a spillage",
      "location_percent": 65,
      "scene": "Viewing Earth from orbit during passage over Africa",
      "effect": "Transforms earthly geography into artistic abstraction, enabling omniscient meditative observation of human world from cosmic perspective",
      "assigned_section": "climax",
      "chapter": 14,
      "chapter_range": "13-14",
      "pedagogical_tier": 1
    },
    {
      "name": "Symbolism",
      "anchor_phrase": "Everything burnable, everything not to go back to earth",
      "location_percent": 40,
      "scene": "Nell organizing waste for disposal",
      "effect": "Physical waste disposal becomes symbol of human impermanence, supporting cosmic contemplation of what endures versus what burns away",
      "assigned_section": "climax",
      "chapter": 14,
      "chapter_range": "13-14",
      "pedagogical_tier": 3
    },
    {
      "name": "Juxtaposition",
      "anchor_phrase": "any claustrophobia becomes agoraphobia in an instant, or you have both",
      "location_percent": 42,
      "scene": "Description of moving through spacecraft then looking out at space",
      "effect": "Contrasts confined and limitless spaces simultaneously, creating philosophical tension that embodies cosmic scale against human experience",
      "assigned_section": "climax",
      "chapter": 14,
      "chapter_range": "13-14",
      "pedagogical_tier": 3
    },
    {
      "name": "Free Indirect Discourse",
      "anchor_phrase": "In the slowing and cooling he hears his thoughts more",
      "location_percent": 20,
      "scene": "Pietro's internal contemplation of his mental state in space",
      "effect": "Provides omniscient access to consciousness flows while maintaining objective stance, enabling meditative observation of human psychological adaptation",
      "assigned_section": "climax",
      "chapter": 14,
      "chapter_range": "13-14",
      "pedagogical_tier": 5
    },
    {
      "name": "Repetition",
      "anchor_phrase": "Hello? Hello? Zdraste, hello",
      "location_percent": 95,
      "scene": "Radio communication between Roman and Tony",
      "effect": "Creates rhythmic, almost prayer-like quality that transforms simple dialogue into cosmic connection ritual, supporting meditative contemplation pattern",
      "assigned_section": "climax",
      "chapter": 14,
      "chapter_range": "13-14",
      "pedagogical_tier": 2
    },
    {
      "name": "Third-Person Omniscient",
      "anchor_phrase": "Pietro once told Roman, and he agreed, that's how it is",
      "location_percent": 5,
      "scene": "Opening reflection on space's effects on human body",
      "effect": "Establishes omniscient access to multiple consciousness flows while maintaining philosophical distance, core to the cosmic contemplation pattern",
      "assigned_section": "climax",
      "chapter": 14,
      "chapter_range": "13-14",
      "pedagogical_tier": 5
    },
    {
      "name": "Imagery",
      "anchor_phrase": "great coffee grinders wimbling into wayless dark",
      "location_percent": 5,
      "scene": "Description of Voyager probes traveling through space",
      "effect": "Creates vivid sensory picture that domesticates cosmic technology, establishing the meditative tone for contemplating human artifacts in infinite space",
      "assigned_section": "falling_action",
      "chapter": 15,
      "chapter_range": "15-20",
      "pedagogical_tier": 1
    },
    {
      "name": "Juxtaposition",
      "anchor_phrase": "thinking simultaneously of earth and lover as if the two were continuous",
      "location_percent": 25,
      "scene": "Analysis of the woman's recorded brainwaves on the Golden Record",
      "effect": "Contrasts intimate human love with cosmic communication, embodying the pattern's core dynamic of personal consciousness against universal scale",
      "assigned_section": "falling_action",
      "chapter": 15,
      "chapter_range": "15-20",
      "pedagogical_tier": 3
    },
    {
      "name": "Metaphor",
      "anchor_phrase": "All of these thoughts sound like a pulsar",
      "location_percent": 30,
      "scene": "Description of love-flooded thoughts as cosmic phenomena",
      "effect": "Transforms human emotion into astronomical metaphor, creating the meditative bridge between individual experience and cosmic reality",
      "assigned_section": "falling_action",
      "chapter": 15,
      "chapter_range": "15-20",
      "pedagogical_tier": 1
    },
    {
      "name": "Symbolism",
      "anchor_phrase": "golden disc that could be a plaque or a portal",
      "location_percent": 8,
      "scene": "Description of the Voyager Golden Record",
      "effect": "The disc symbolizes humanity's attempt to transcend mortality through art and love, serving the pattern's philosophical stance on human meaning in cosmic time",
      "assigned_section": "falling_action",
      "chapter": 15,
      "chapter_range": "15-20",
      "pedagogical_tier": 3
    },
    {
      "name": "Third-Person Omniscient",
      "anchor_phrase": "They watched yesterday the lunar rocket go cleanly into the night",
      "location_percent": 45,
      "scene": "Transition to astronauts watching rocket launch",
      "effect": "Provides unlimited access to multiple consciousness flows, enabling the pattern's meditative observation across different human experiences simultaneously",
      "assigned_section": "falling_action",
      "chapter": 15,
      "chapter_range": "15-20",
      "pedagogical_tier": 5
    },
    {
      "name": "Repetition",
      "anchor_phrase": "his hands, his throat, his bare back",
      "location_percent": 35,
      "scene": "Cascade of the woman's thoughts about her lover",
      "effect": "Creates rhythmic emphasis that mirrors the pulsing brainwaves, reinforcing the pattern's contemplation of love as both intimate and cosmically significant",
      "assigned_section": "falling_action",
      "chapter": 15,
      "chapter_range": "15-20",
      "pedagogical_tier": 2
    },
    {
      "name": "Personification",
      "anchor_phrase": "the sun is roaring",
      "location_percent": 55,
      "scene": "Description of solar activity",
      "effect": "Animates cosmic forces with human characteristics, supporting the pattern's meditative stance on humanity's relationship with vast natural phenomena",
      "assigned_section": "falling_action",
      "chapter": 15,
      "chapter_range": "15-20",
      "pedagogical_tier": 1
    },
    {
      "name": "Stream of Consciousness",
      "anchor_phrase": "every thought cascaded into the dark brows and proud nose of her lover",
      "location_percent": 28,
      "scene": "Flow of the recorded woman's thoughts",
      "effect": "Captures unfiltered consciousness flow, demonstrating the pattern's access to interior experience while maintaining philosophical distance about human nature",
      "assigned_section": "falling_action",
      "chapter": 15,
      "chapter_range": "15-20",
      "pedagogical_tier": 5
    },
    {
      "name": "Foreshadowing",
      "anchor_phrase": "One day a few years hence, at this very spot in the Pacific that it's passing now, this craft will bow graciously out of orbit and plummet through the atmosphere into the ocean",
      "location_percent": 85,
      "scene": "Narrator contemplating the station's future destruction while observing the Pacific below",
      "effect": "Creates cosmic perspective on impermanence, reinforcing the meditative observation of endings and cycles that define human endeavors against eternal time",
      "assigned_section": "resolution",
      "chapter": 22,
      "chapter_range": "21-22",
      "pedagogical_tier": 3
    },
    {
      "name": "Juxtaposition",
      "anchor_phrase": "They hang like bats in their quarters. Anton wakes briefly with his fist in his cheek. His first and only thought is of the spacecraft on its way to the moon",
      "location_percent": 10,
      "scene": "Sleeping astronauts in their modules while momentarily awakening to cosmic wonder",
      "effect": "Contrasts vulnerable human physicality with transcendent aspirations, embodying the pattern's meditation on human experience against cosmic scale",
      "assigned_section": "resolution",
      "chapter": 22,
      "chapter_range": "21-22",
      "pedagogical_tier": 3
    },
    {
      "name": "Symbolism",
      "anchor_phrase": "The crack that's appeared outside gives a millimetre or two. It sends out fissures that broadly echo an aerial map of the confluencing Volga River",
      "location_percent": 35,
      "scene": "Description of the hull crack spreading in patterns resembling earthly geography",
      "effect": "The crack symbolizes the fragility of human constructs while its river-like pattern connects earthly and cosmic scales, reinforcing contemplation of impermanence",
      "assigned_section": "resolution",
      "chapter": 22,
      "chapter_range": "21-22",
      "pedagogical_tier": 3
    },
    {
      "name": "Metaphor",
      "anchor_phrase": "Its light is a choir. Its light is an ensemble of a trillion things",
      "location_percent": 95,
      "scene": "The Earth's electromagnetic vibrations translated into musical harmony",
      "effect": "Transforms scientific phenomena into transcendent metaphor, creating the meditative synthesis of objective observation with philosophical meaning central to the pattern",
      "assigned_section": "resolution",
      "chapter": 22,
      "chapter_range": "21-22",
      "pedagogical_tier": 1
    },
    {
      "name": "Imagery",
      "anchor_phrase": "four idly spinning crumbs of honeycomb that have been caught for now in an equilibrium of forces",
      "location_percent": 45,
      "scene": "Detailed observation of floating crumbs in the station's dining area",
      "effect": "Creates precise sensory detail that becomes contemplative focus, demonstrating how ordinary moments gain significance under omniscient philosophical observation",
      "assigned_section": "resolution",
      "chapter": 22,
      "chapter_range": "21-22",
      "pedagogical_tier": 1
    },
    {
      "name": "Third-Person Omniscient",
      "anchor_phrase": "Roman knows in this light band of pre-alarm sleep that they'll be circling now somewhere near Turkmenistan",
      "location_percent": 25,
      "scene": "Narrator accessing Roman's semiconscious geographical awareness while sleeping",
      "effect": "Demonstrates the omniscient access to multiple consciousness flows that enables the pattern's meditative observation of human experience across scales",
      "assigned_section": "resolution",
      "chapter": 22,
      "chapter_range": "21-22",
      "pedagogical_tier": 5
    },
    {
      "name": "Personification",
      "anchor_phrase": "this craft will bow graciously out of orbit",
      "location_percent": 85,
      "scene": "Description of the space station's future deorbiting and destruction",
      "effect": "Gives human dignity to technological endings, supporting the pattern's philosophical stance that finds meaning in impermanence and cosmic cycles",
      "assigned_section": "resolution",
      "chapter": 22,
      "chapter_range": "21-22",
      "pedagogical_tier": 1
    },
    {
      "name": "Repetition",
      "anchor_phrase": "The moon, the moon. Mars, the moon. Further yet",
      "location_percent": 60,
      "scene": "Contemplation of humanity's future space exploration ambitions",
      "effect": "Creates rhythmic emphasis on cosmic destinations, reinforcing the meditative quality while highlighting humanity's relentless drive toward transcendence",
      "assigned_section": "resolution",
      "chapter": 22,
      "chapter_range": "21-22",
      "pedagogical_tier": 2
    }
  ]
}