{
  "metadata": {
    "title": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "edition": "Harper Perennial Modern Classics, 2006",
    "creation_date": "2025-12-10T22:15:14.616167",
    "protocol_version": "4.0",
    "kernel_version": "5.1",
    "chapter_aware": true,
    "structure_alignment_protocol": "v1.1",
    "device_density_optimization": true
  },
  "text_structure": {
    "has_chapters": true,
    "total_chapters_estimate": 31,
    "notes": "Chapter breaks identified during kernel creation"
  },
  "structure_detection": {
    "structure_type": "NEST",
    "total_units": 31,
    "special_elements": [],
    "notes": "Two-part structure: Part One (Chapters 1-11) and Part Two (Chapters 12-31)"
  },
  "chapter_alignment": {
    "exposition": {
      "chapter_range": "1-4",
      "chapters": [
        1,
        2,
        3,
        4
      ],
      "primary_chapter": 1,
      "percentage": 13
    },
    "rising_action": {
      "chapter_range": "5-20",
      "chapters": [
        5,
        6,
        7,
        8,
        9,
        10,
        11,
        12,
        13,
        14,
        15,
        16,
        17,
        18,
        19,
        20
      ],
      "primary_chapter": 15,
      "percentage": 52
    },
    "climax": {
      "chapter_range": "21",
      "chapters": [
        21
      ],
      "primary_chapter": 21,
      "percentage": 3
    },
    "falling_action": {
      "chapter_range": "22-28",
      "chapters": [
        22,
        23,
        24,
        25,
        26,
        27,
        28
      ],
      "primary_chapter": 25,
      "percentage": 23
    },
    "resolution": {
      "chapter_range": "29-31",
      "chapters": [
        29,
        30,
        31
      ],
      "primary_chapter": 31,
      "percentage": 10
    }
  },
  "chapter_optimization": {
    "exposition": {
      "chapter_range": "1-4",
      "narrative_primary": 1,
      "optimized_primary": 3,
      "device_density_score": 49.428483163422925,
      "improvement_percent": 5.960264900662252,
      "optimization_applied": true,
      "chapter_text": "Scout.” I turned around and saw most of the town people and the entire bus delegation looking at me. Miss Caroline and I had conferred twice already, and they were looking at me in the innocent assurance that familiarity breeds understanding. I rose graciously on Walter’s behalf: “Ah—Miss Caroline?” “What is it, Jean Louise?” “Miss Caroline, he’s a Cunningham.” I sat back down. “What, Jean Louise?” I thought I had made things sufficiently clear. It was clear enough to the rest of us: Walter Cunningham was sitting there lying his head off. He didn’t forget his lunch, he didn’t have any. He had none today nor would he have any tomorrow or the next day. He had probably never seen three quarters together at the same time in his life. I tried again: “Walter’s one of the Cunninghams, Miss Caroline.” “I beg your pardon, Jean Louise?”“That’s okay, ma’am, you’ll get to know all the country folks after a while. The Cunninghams never took anything they can’t pay back—no church baskets, and no scrip stamps. They never took anything off of anybody, they get along on what they have. They don’t have much, but they get along on it.” My special knowledge of the Cunningham tribe—one branch, that is—was gained from events of last winter. Walter’s father was one of Atticus’s clients. After a dreary conversation in our livingroom one night about his entailment, before Mr. Cunningham left he said, “Mr. Finch, I don’t know when I’ll ever be able to pay you.” “Let that be the least of your worries, Walter,” Atticus said. When I asked Jem what entailment was, and Jem described it as a condition of having your tail in a crack, I asked Atticus if Mr. Cunningham would ever pay us. “Not in money,” Atticus said, “but before the year’s out I’ll have been paid. You watch.” We watched. One morning Jem and I found a load of stovewood in the back yard. Later, a sack of hickory nuts appeared on the back steps. With Christmas came a crate of smilax and holly. That spring when we found a croker-sack full of turnip greens, Atticus said Mr. Cunningham had more than paid him. “Why does he pay you like that?” I asked. “Because that’s the only way he can pay me. He has no money.” “Are we poor, Atticus?” Atticus nodded. “We are indeed.” Jem’s nose wrinkled. “Are we as poor as the Cunninghams?” “Not exactly. The Cunninghams are country folks, farmers, and the crash hit them hardest.” Atticus said professional people were poor because the farmers were poor. As Maycomb County was farm country, nickels and dimes were hard to come by for doctors and dentists and lawyers. Entailment was only a part of Mr. Cunningham’s vexations. The acres not entailed were mortgaged to the hilt, and the little cash he made went to interest. If he held his mouth right, Mr. Cunningham could get a WPA job, but his land would go to ruin if he left it, and he was willing to go hungry to keep his land and vote as he pleased. Mr. Cunningham, said Atticus, came from a set breed of men. As the Cunninghams had no money to pay a lawyer, they simply paid us with what they had. “Did you know,” said Atticus, “that Dr. Reynolds works the same way? He charges some folks a bushel of potatoes for delivery of a baby. Miss Scout, if you give me your attention I’ll tell you what entailment is. Jem’s definitions are very nearly accurate sometimes.” If I could have explained these things to Miss Caroline, I would have saved myself some inconvenience and Miss Caroline subsequent mortification, butit was beyond my ability to explain things as well as Atticus, so I said, “You’re shamin’ him, Miss Caroline. Walter hasn’t got a quarter at home to bring you, and you can’t use any stovewood.” Miss Caroline stood stock still, then grabbed me by the collar and hauled me back to her desk. “Jean Louise, I’ve had about enough of you this morning,” she said. “You’re starting off on the wrong foot in every way, my dear. Hold out your hand.” I thought she was going to spit in it, which was the only reason anybody in Maycomb held out his hand: it was a time-honored method of sealing oral contracts. Wondering what bargain we had made, I turned to the class for an answer, but the class looked back at me in puzzlement. Miss Caroline picked up her ruler, gave me half a dozen quick little pats, then told me to stand in the corner. A storm of laughter broke loose when it finally occurred to the class that Miss Caroline had whipped me. When Miss Caroline threatened it with a similar fate the first grade exploded again, becoming cold sober only when the shadow of Miss Blount fell over them. Miss Blount, a native Maycombian as yet uninitiated in the mysteries of the Decimal System, appeared at the door hands on hips and announced: “If I hear another sound from this room I’ll burn up everybody in it. Miss Caroline, the sixth grade cannot concentrate on the pyramids for all this racket!” My sojourn in the corner was a short one. Saved by the bell, Miss Caroline watched the class file out for lunch. As I was the last to leave, I saw her sink down into her chair and bury her head in her arms. Had her conduct been more friendly toward me, I would have felt sorry for her. She was a pretty little thing.3 Catching Walter Cunningham in the schoolyard gave me some pleasure, but when I was rubbing his nose in the dirt Jem came by and told me to stop. “You’re bigger’n he is,” he said. “He’s as old as you, nearly,” I said. “He made me start off on the wrong foot.” “Let him go, Scout. Why?” “He didn’t have any lunch,” I said, and explained my involvement in Walter’s dietary affairs. Walter had picked himself up and was standing quietly listening to Jem and me. His fists were half cocked, as if expecting an onslaught from both of us. I stomped at him to chase him away, but Jem put out his hand and stopped me. He examined Walter with an air of speculation. “Your daddy Mr. Walter Cunningham from Old Sarum?” he asked, and Walter nodded. Walter looked as if he had been raised on fish food: his eyes, as blue as Dill Harris’s, were red-rimmed and watery. There was no color in his face except at the tip of his nose, which was moistly pink. He fingered the straps of his overalls, nervously picking at the metal hooks. Jem suddenly grinned at him. “Come on home to dinner with us, Walter,” he said. “We’d be glad to have you.” Walter’s face brightened, then darkened. Jem said, “Our daddy’s a friend of your daddy’s. Scout here, she’s crazy— she won’t fight you any more.” “I wouldn’t be too certain of that,” I said. Jem’s free dispensation of my pledge irked me, but precious noontime minutes were ticking away. “Yeah Walter, I won’t jump on you again. Don’t you like butterbeans? Our Cal’s a real good cook.” Walter stood where he was, biting his lip. Jem and I gave up, and we were nearly to the Radley Place when Walter called, “Hey, I’m comin’!” When Walter caught up with us, Jem made pleasant conversation with him. “A hain’t lives there,” he said cordially, pointing to the Radley house. “Ever hear about him, Walter?” “Reckon I have,” said Walter. “Almost died first year I come to school andet them pecans—folks say he pizened ’em and put ’em over on the school side of the fence.” Jem seemed to have little fear of Boo Radley now that Walter and I walked beside him. Indeed, Jem grew boastful: “I went all the way up to the house once,” he said to Walter. “Anybody who went up to the house once oughta not to still run every time he passes it,” I said to the clouds above. “And who’s runnin’, Miss Priss?” “You are, when ain’t anybody with you.” By the time we reached our front steps Walter had forgotten he was a Cunningham. Jem ran to the kitchen and asked Calpurnia to set an extra plate, we had company. Atticus greeted Walter and began a discussion about crops neither Jem nor I could follow. “Reason I can’t pass the first grade, Mr. Finch, is I’ve had to stay out ever’ spring an’ help Papa with the choppin’, but there’s another’n at the house now that’s field size.” “Did you pay a bushel of potatoes for him?” I asked, but Atticus shook his head at me. While Walter piled food on his plate, he and Atticus talked together like two men, to the wonderment of Jem and me. Atticus was expounding upon farm problems when Walter interrupted to ask if there was any molasses in the house. Atticus summoned Calpurnia, who returned bearing the syrup pitcher. She stood waiting for Walter to help himself. Walter poured syrup on his vegetables and meat with a generous hand. He would probably have poured it into his milk glass had I not asked what the sam hill he was doing. The silver saucer clattered when he replaced the pitcher, and he quickly put his hands in his lap. Then he ducked his head. Atticus shook his head at me again. “But he’s gone and drowned his dinner in syrup,” I protested. “He’s poured it all over—” It was then that Calpurnia requested my presence in the kitchen. She was furious, and when she was furious Calpurnia’s grammar became erratic. When in tranquility, her grammar was as good as anybody’s in Maycomb. Atticus said Calpurnia had more education than most colored folks. When she squinted down at me the tiny lines around her eyes deepened. “There’s some folks who don’t eat like us,” she whispered fiercely, “but you ain’t called on to contradict ’em at the table when they don’t. That boy’s yo’ comp’ny and if he wants to eat up the table cloth you let him, you hear?” “He ain’t company, Cal, he’s just a Cunningham—” “Hush your mouth! Don’t matter who they are, anybody sets foot in this house’s yo’ comp’ny, and don’t you let me catch you remarkin’ on their ways like you was so high and mighty! Yo’ folks might be better’n theCunninghams but it don’t count for nothin’ the way you’re disgracin’ ’em—if you can’t act fit to eat at the table you can just set here and eat in the kitchen!” Calpurnia sent me through the swinging door to the diningroom with a stinging smack. I retrieved my plate and finished dinner in the kitchen, thankful, though, that I was spared the humiliation of facing them again. I told Calpurnia to just wait, I’d fix her: one of these days when she wasn’t looking I’d go off and drown myself in Barker’s Eddy and then she’d be sorry. Besides, I added, she’d already gotten me in trouble once today: she had taught me to write and it was all her fault. “Hush you fussin’,” she said. Jem and Walter returned to school ahead of me: staying behind to advise Atticus of Calpurnia’s iniquities was worth a solitary sprint past the Radley Place. “She likes Jem better’n she likes me, anyway,” I concluded, and suggested that Atticus lose no time in packing her off. “Have you ever considered that Jem doesn’t worry her half as much?” Atticus’s voice was flinty. “I’ve no intention of getting rid of her, now or ever. We couldn’t operate a single day without Cal, have you ever thought of that? You think about how much Cal does for you, and you mind her, you hear?” I returned to school and hated Calpurnia steadily until a sudden shriek shattered my resentments. I looked up to see Miss Caroline standing in the middle of the room, sheer horror flooding her face. Apparently she had revived enough to persevere in her profession. “It’s alive!” she screamed. The male population of the class rushed as one to her assistance. Lord, I thought, she’s scared of a mouse. Little Chuck Little, whose patience with all living things was phenomenal, said, “Which way did he go, Miss Caroline? Tell us where he went, quick! D.C.—” he turned to a boy behind him—“D.C., shut the door and we’ll catch him. Quick, ma’am, where’d he go?” Miss Caroline pointed a shaking finger not at the floor nor at a desk, but to a hulking individual unknown to me. Little Chuck’s face contracted and he said gently, “You mean him, ma’am? Yessum, he’s alive. Did he scare you some way?” Miss Caroline said desperately, “I was just walking by when it crawled out of his hair . . . just crawled out of his hair—” Little Chuck grinned broadly. “There ain’t no need to fear a cootie, ma’am. Ain’t you ever seen one? Now don’t you be afraid, you just go back to your desk and teach us some more.” Little Chuck Little was another member of the population who didn’t know where his next meal was coming from, but he was a born gentleman. He put his hand under her elbow and led Miss Caroline to the front of the room. “Now don’t you fret, ma’am,” he said. “There ain’t no need to fear a cootie. I’ll just fetch you some cool water.” The cootie’s host showed not the faintest interest in the furor he hadwrought. He searched the scalp above his forehead, located his guest and pinched it between his thumb and forefinger. Miss Caroline watched the process in horrid fascination. Little Chuck brought water in a paper cup, and she drank it gratefully. Finally she found her voice. “What is your name, son?” she asked softly. The boy blinked. “Who, me?” Miss Caroline nodded. “Burris Ewell.” Miss Caroline inspected her roll-book. “I have a Ewell here, but I don’t have a first name . . . would you spell your first name for me?” “Don’t know how. They call me Burris’t home.” “Well, Burris,” said Miss Caroline, “I think we’d better excuse you for the rest of the afternoon. I want you to go home and wash your hair.” From her desk she produced a thick volume, leafed through its pages and read for a moment. “A good home remedy for—Burris, I want you to go home and wash your hair with lye soap. When you’ve done that, treat your scalp with kerosene.” “What fer, missus?” “To get rid of the—er, cooties. You see, Burris, the other children might catch them, and you wouldn’t want that, would you?” The boy stood up. He was the filthiest human I had ever seen. His neck was dark gray, the backs of his hands were rusty, and his fingernails were black deep into the quick. He peered at Miss Caroline from a fist-sized clean space on his face. No one had noticed him, probably, because Miss Caroline and I had entertained the class most of the morning. “And Burris,” said Miss Caroline, “please bathe yourself before you come back tomorrow.” The boy laughed rudely. “You ain’t sendin’ me home, missus. I was on the verge of leavin’—I done done my time for this year.” Miss Caroline looked puzzled. “What do you mean by that?” The boy did not answer. He gave a short contemptuous snort. One of the elderly members of the class answered her: “He’s one of the Ewells, ma’am,” and I wondered if this explanation would be as unsuccessful as my attempt. But Miss Caroline seemed willing to listen. “Whole school’s full of ’em. They come first day every year and then leave. The truant lady gets ’em here ’cause she threatens ’em with the sheriff, but she’s give up tryin’ to hold ’em. She reckons she’s carried out the law just gettin’ their names on the roll and runnin’ ’em here the first day. You’re supposed to mark ’em absent the rest of the year . . .” “But what about their parents?” asked Miss Caroline, in genuine concern. “Ain’t got no mother,” was the answer, “and their paw’s right contentious.” Burris Ewell was flattered by the recital. “Been comin’ to the first day o’ the first grade fer three year now,” he said expansively. “Reckon if I’m smartthis year they’ll promote me to the second. . . .” Miss Caroline said, “Sit back down, please, Burris,” and the moment she said it I knew she had made a serious mistake. The boy’s condescension flashed to anger. “You try and make me, missus.” Little Chuck Little got to his feet. “Let him go, ma’am,” he said. “He’s a mean one, a hard-down mean one. He’s liable to start somethin’, and there’s some little folks here.” He was among the most diminutive of men, but when Burris Ewell turned toward him, Little Chuck’s right hand went to his pocket. “Watch your step, Burris,” he said. “I’d soon’s kill you as look at you. Now go home.” Burris seemed to be afraid of a child half his height, and Miss Caroline took advantage of his indecision: “Burris, go home. If you don’t I’ll call the principal,” she said. “I’ll have to report this, anyway.” The boy snorted and slouched leisurely to the door. Safely out of range, he turned and shouted: “Report and be damned to ye! Ain’t no snot-nosed slut of a schoolteacher ever born c’n make me do nothin’! You ain’t makin’ me go nowhere, missus. You just remember that, you ain’t makin’ me go nowhere!” He waited until he was sure she was crying, then he shuffled out of the building. Soon we were clustered around her desk, trying in our various ways to comfort her. He was a real mean one . . . below the belt . . . you ain’t called on to teach folks like that . . . them ain’t Maycomb’s ways, Miss Caroline, not really . . . now don’t you fret, ma’am. Miss Caroline, why don’t you read us a story? That cat thing was real fine this mornin’. . . . Miss Caroline smiled, blew her nose, said, “Thank you, darlings,” dispersed us, opened a book and mystified the first grade with a long narrative about a toadfrog that lived in a hall. When I passed the Radley Place for the fourth time that day—twice at a full gallop—my gloom had deepened to match the house. If the remainder of the school year were as fraught with drama as the first day, perhaps it would be mildly entertaining, but the prospect of spending nine months refraining from reading and writing made me think of running away. By late afternoon most of my traveling plans were complete; when Jem and I raced each other up the sidewalk to meet Atticus coming home from work, I didn’t give him much of a race. It was our habit to run meet Atticus the moment we saw him round the post office corner in the distance. Atticus seemed to have forgotten my noontime fall from grace; he was full of questions about school. My replies were monosyllabic and he did not press me. Perhaps Calpurnia sensed that my day had",
      "density_breakdown": {
        "Metaphor": 1.8535681186283597,
        "Simile": 1.8535681186283597,
        "Imagery": 11.739264751312943,
        "Symbolism": 12.357120790855731,
        "Dialogue": 0.0,
        "Foreshadowing": 5.560704355885079,
        "Juxtaposition": 9.267840593141797,
        "Repetition": 6.796416434970652,
        "TOTAL_DENSITY": 49.428483163422925
      }
    },
    "rising_action": {
      "chapter_range": "5-20",
      "narrative_primary": 15,
      "optimized_primary": 18,
      "device_density_score": 51.89990732159407,
      "improvement_percent": 3.7037037037037033,
      "optimization_applied": true,
      "chapter_text": "of a mob last night, but he was still a man. Every mob in every little Southern town is always made up of people you know—doesn’t say much for them, does it?” “I’ll say not,” said Jem. “So it took an eight-year-old child to bring ’em to their senses, didn’t it?” said Atticus. “That proves something—that a gang of wild animals can be stopped, simply because they’re still human. Hmp, maybe we need a police force of children . . . you children last night made Walter Cunningham stand in my shoes for a minute. That was enough.” Well, I hoped Jem would understand folks a little better when he was older; I wouldn’t. “First day Walter comes back to school’ll be his last,” I affirmed. “You will not touch him,” Atticus said flatly. “I don’t want either of you bearing a grudge about this thing, no matter what happens.” “You see, don’t you,” said Aunt Alexandra, “what comes of things like this.Don’t say I haven’t told you.” Atticus said he’d never say that, pushed out his chair and got up. “There’s a day ahead, so excuse me. Jem, I don’t want you and Scout downtown today, please.” As Atticus departed, Dill came bounding down the hall into the diningroom. “It’s all over town this morning,” he announced, “all about how we held off a hundred folks with our bare hands. . . .” Aunt Alexandra stared him to silence. “It was not a hundred folks,” she said, “and nobody held anybody off. It was just a nest of those Cunninghams, drunk and disorderly.” “Aw, Aunty, that’s just Dill’s way,” said Jem. He signaled us to follow him. “You all stay in the yard today,” she said, as we made our way to the front porch. It was like Saturday. People from the south end of the county passed our house in a leisurely but steady stream. Mr. Dolphus Raymond lurched by on his thoroughbred. “Don’t see how he stays in the saddle,” murmured Jem. “How c’n you stand to get drunk ’fore eight in the morning?” A wagonload of ladies rattled past us. They wore cotton sunbonnets and dresses with long sleeves. A bearded man in a wool hat drove them. “Yonder’s some Mennonites,” Jem said to Dill. “They don’t have buttons.” They lived deep in the woods, did most of their trading across the river, and rarely came to Maycomb. Dill was interested. “They’ve all got blue eyes,” Jem explained, “and the men can’t shave after they marry. Their wives like for ’em to tickle ’em with their beards.” Mr. X Billups rode by on a mule and waved to us. “He’s a funny man,” said Jem. “X’s his name, not his initial. He was in court one time and they asked him his name. He said X Billups. Clerk asked him to spell it and he said X. Asked him again and he said X. They kept at it till he wrote X on a sheet of paper and held it up for everybody to see. They asked him where he got his name and he said that’s the way his folks signed him up when he was born.” As the county went by us, Jem gave Dill the histories and general attitudes of the more prominent figures: Mr. Tensaw Jones voted the straight Prohibition ticket; Miss Emily Davis dipped snuff in private; Mr. Byron Waller could play the violin; Mr. Jake Slade was cutting his third set of teeth. A wagonload of unusually stern-faced citizens appeared. When they pointed to Miss Maudie Atkinson’s yard, ablaze with summer flowers, Miss Maudie herself came out on the porch. There was an odd thing about Miss Maudie—on her porch she was too far away for us to see her features clearly, but we could always catch her mood by the way she stood. She was now standing arms akimbo, her shoulders dropping a little, her head cocked to one side, her glasses winking in the sunlight. We knew she wore a grin of theuttermost wickedness. The driver of the wagon slowed down his mules, and a shrill-voiced woman called out: “He that cometh in vanity departeth in darkness!” Miss Maudie answered: “A merry heart maketh a cheerful countenance!” I guessed that the foot-washers thought that the Devil was quoting Scripture for his own purposes, as the driver speeded his mules. Why they objected to Miss Maudie’s yard was a mystery, heightened in my mind because for someone who spent all the daylight hours outdoors, Miss Maudie’s command of Scripture was formidable. “You goin’ to court this morning?” asked Jem. We had strolled over. “I am not,” she said. “I have no business with the court this morning.” “Aren’t you goin’ down to watch?” asked Dill. “I am not. ’t’s morbid, watching a poor devil on trial for his life. Look at all those folks, it’s like a Roman carnival.” “They hafta try him in public, Miss Maudie,” I said. “Wouldn’t be right if they didn’t.” “I’m quite aware of that,” she said. “Just because it’s public, I don’t have to go, do I?” Miss Stephanie Crawford came by. She wore a hat and gloves. “Um, um, um,” she said. “Look at all those folks—you’d think William Jennings Bryan was speakin’.” “And where are you going, Stephanie?” inquired Miss Maudie. “To the Jitney Jungle.” Miss Maudie said she’d never seen Miss Stephanie go to the Jitney Jungle in a hat in her life. “Well,” said Miss Stephanie, “I thought I might just look in at the courthouse, to see what Atticus’s up to.” “Better be careful he doesn’t hand you a subpoena.” We asked Miss Maudie to elucidate: she said Miss Stephanie seemed to know so much about the case she might as well be called on to testify. We held off until noon, when Atticus came home to dinner and said they’d spent the morning picking the jury. After dinner, we stopped by for Dill and went to town. It was a gala occasion. There was no room at the public hitching rail for another animal, mules and wagons were parked under every available tree. The courthouse square was covered with picnic parties sitting on newspapers, washing down biscuit and syrup with warm milk from fruit jars. Some people were gnawing on cold chicken and cold fried pork chops. The more affluent chased their food with drugstore Coca-Cola in bulb-shaped soda glasses. Greasy-faced children popped-the-whip through the crowd, and babies lunched at their mothers’ breasts. In a far corner of the square, the Negroes sat quietly in the sun, dining onsardines, crackers, and the more vivid flavors of Nehi Cola. Mr. Dolphus Raymond sat with them. “Jem,” said Dill, “he’s drinkin’ out of a sack.” Mr. Dolphus Raymond seemed to be so doing: two yellow drugstore straws ran from his mouth to the depths of a brown paper bag. “Ain’t ever seen anybody do that,” murmured Dill. “How does he keep what’s in it in it?” Jem giggled. “He’s got a Co-Cola bottle full of whiskey in there. That’s so’s not to upset the ladies. You’ll see him sip it all afternoon, he’ll step out for a while and fill it back up.” “Why’s he sittin’ with the colored folks?” “Always does. He likes ’em better’n he likes us, I reckon. Lives by himself way down near the county line. He’s got a colored woman and all sorts of mixed chillun. Show you some of ’em if we see ’em.” “He doesn’t look like trash,” said Dill. “He’s not, he owns all one side of the riverbank down there, and he’s from a real old family to boot.” “Then why does he do like that?” “That’s just his way,” said Jem. “They say he never got over his weddin’. He was supposed to marry one of the—the Spender ladies, I think. They were gonna have a huge weddin’, but they didn’t—after the rehearsal the bride went upstairs and blew her head off. Shotgun. She pulled the trigger with her toes.” “Did they ever know why?” “No,” said Jem, “nobody ever knew quite why but Mr. Dolphus. They said it was because she found out about his colored woman, he reckoned he could keep her and get married too. He’s been sorta drunk ever since. You know, though, he’s real good to those chillun—” “Jem,” I asked, “what’s a mixed child?” “Half white, half colored. You’ve seen ’em, Scout. You know that red- kinky-headed one that delivers for the drugstore. He’s half white. They’re real sad.” “Sad, how come?” “They don’t belong anywhere. Colored folks won’t have ’em because they’re half white; white folks won’t have ’em ’cause they’re colored, so they’re just in-betweens, don’t belong anywhere. But Mr. Dolphus, now, they say he’s shipped two of his up north. They don’t mind ’em up north. Yonder’s one of ’em.” A small boy clutching a Negro woman’s hand walked toward us. He looked all Negro to me; he was rich chocolate with flaring nostrils and beautiful teeth. Sometimes he would skip happily, and the Negro woman tugged his hand to make him stop.Jem waited until they passed us. “That’s one of the little ones,” he said. “How can you tell?” asked Dill. “He looked black to me.” “You can’t sometimes, not unless you know who they are. But he’s half Raymond, all right.” “But how can you tell? ” I asked. “I told you, Scout, you just hafta know who they are.” “Well how do you know we ain’t Negroes?” “Uncle Jack Finch says we really don’t know. He says as far as he can trace back the Finches we ain’t, but for all he knows we mighta come straight out of Ethiopia durin’ the Old Testament.” “Well if we came out durin’ the Old Testament it’s too long ago to matter.” “That’s what I thought,” said Jem, “but around here once you have a drop of Negro blood, that makes you all black. Hey, look—” Some invisible signal had made the lunchers on the square rise and scatter bits of newspaper, cellophane, and wrapping paper. Children came to mothers, babies were cradled on hips as men in sweat-stained hats collected their families and herded them through the courthouse doors. In the far corner of the square the Negroes and Mr. Dolphus Raymond stood up and dusted their breeches. There were few women and children among them, which seemed to dispel the holiday mood. They waited patiently at the doors behind the white families. “Let’s go in,” said Dill. “Naw, we better wait till they get in, Atticus might not like it if he sees us,” said Jem. The Maycomb County courthouse was faintly reminiscent of Arlington in one respect: the concrete pillars supporting its south roof were too heavy for their light burden. The pillars were all that remained standing when the original courthouse burned in 1856. Another courthouse was built around them. It is better to say, built in spite of them. But for the south porch, the Maycomb County courthouse was early Victorian, presenting an unoffensive vista when seen from the north. From the other side, however, Greek revival columns clashed with a big nineteenth-century clock tower housing a rusty unreliable instrument, a view indicating a people determined to preserve every physical scrap of the past. To reach the courtroom, on the second floor, one passed sundry sunless county cubbyholes: the tax assessor, the tax collector, the county clerk, the county solicitor, the circuit clerk, the judge of probate lived in cool dim hutches that smelled of decaying record books mingled with old damp cement and stale urine. It was necessary to turn on the lights in the daytime; there was always a film of dust on the rough floorboards. The inhabitants of these offices were creatures of their environment: little gray-faced men, they seemed untouched by wind or sun.We knew there was a crowd, but we had not bargained for the multitudes in the first-floor hallway. I got separated from Jem and Dill, but made my way toward the wall by the stairwell, knowing Jem would come for me eventually. I found myself in the middle of the Idlers’ Club and made myself as unobtrusive as possible. This was a group of white-shirted, khaki-trousered, suspendered old men who had spent their lives doing nothing and passed their twilight days doing same on pine benches under the live oaks on the square. Attentive critics of courthouse business, Atticus said they knew as much law as the Chief Justice, from long years of observation. Normally, they were the court’s only spectators, and today they seemed resentful of the interruption of their comfortable routine. When they spoke, their voices sounded casually important. The conversation was about my father. “. . . thinks he knows what he’s doing,” one said. “Oh-h now, I wouldn’t say that,” said another. “Atticus Finch’s a deep reader, a mighty deep reader.” “He reads all right, that’s all he does.” The club snickered. “Lemme tell you somethin’ now, Billy,” a third said, “you know the court appointed him to defend this nigger.” “Yeah, but Atticus aims to defend him. That’s what I don’t like about it.” This was news, news that put a different light on things: Atticus had to, whether he wanted to or not. I thought it odd that he hadn’t said anything to us about it—we could have used it many times in defending him and ourselves. He had to, that’s why he was doing it, equaled fewer fights and less fussing. But did that explain the town’s attitude? The court appointed Atticus to defend him. Atticus aimed to defend him. That’s what they didn’t like about it. It was confusing. The Negroes, having waited for the white people to go upstairs, began to come in. “Whoa now, just a minute,” said a club member, holding up his walking stick. “Just don’t start up them there stairs yet awhile.” The club began its stiff-jointed climb and ran into Dill and Jem on their way down looking for me. They squeezed past and Jem called, “Scout, come on, there ain’t a seat left. We’ll hafta stand up.” “Looka there, now,” he said irritably, as the black people surged upstairs. The old men ahead of them would take most of the standing room. We were out of luck and it was all my fault, Jem informed me. We stood miserably by the wall. “Can’t you all get in?” Reverend Sykes was looking down at us, black hat in hand. “Hey, Reverend,” said Jem. “Naw, Scout here messed us up.” “Well, let’s see what we can do.” Reverend Sykes edged his way upstairs. In a few moments he was back. “There’s not a seat downstairs. Do you all reckon it’ll be all right if you allcame to the balcony with me?” “Gosh yes,” said Jem. Happily, we sped ahead of Reverend Sykes to the courtroom floor. There, we went up a covered staircase and waited at the door. Reverend Sykes came puffing behind us, and steered us gently through the black people in the balcony. Four Negroes rose and gave us their front- row seats. The Colored balcony ran along three walls of the courtroom like a second- story veranda, and from it we could see everything. The jury sat to the left, under long windows. Sunburned, lanky, they seemed to be all farmers, but this was natural: townsfolk rarely sat on juries, they were either struck or excused. One or two of the jury looked vaguely like dressed-up Cunninghams. At this stage they sat straight and alert. The circuit solicitor and another man, Atticus and Tom Robinson sat at tables with their backs to us. There was a brown book and some yellow tablets on the solicitor’s table; Atticus’s was bare. Just inside the railing that divided the spectators from the court, the witnesses sat on cowhide-bottomed chairs. Their backs were to us. Judge Taylor was on the bench, looking like a sleepy old shark, his pilot fish writing rapidly below in front of him. Judge Taylor looked like most judges I had ever seen: amiable, white-haired, slightly ruddy-faced, he was a man who ran his court with an alarming informality—he sometimes propped his feet up, he often cleaned his fingernails with his pocket knife. In long equity hearings, especially after dinner, he gave the impression of dozing, an impression dispelled forever when a lawyer once deliberately pushed a pile of books to the floor in a desperate effort to wake him up. Without opening his eyes, Judge Taylor murmured, “Mr. Whitley, do that again and it’ll cost you one hundred dollars.” He was a man learned in the law, and although he seemed to take his job casually, in reality he kept a firm grip on any proceedings that came before him. Only once was Judge Taylor ever seen at a dead standstill in open court, and the Cunninghams stopped him. Old Sarum, their stamping grounds, was populated by two families separate and apart in the beginning, but unfortunately bearing the same name. The Cunninghams married the Coninghams until the spelling of the names was academic—academic until a Cunningham disputed a Coningham over land titles and took to the law. During a controversy of this character, Jeems Cunningham testified that his mother spelled it Cunningham on deeds and things, but she was really a Coningham, she was an uncertain speller, a seldom reader, and was given to looking far away sometimes when she sat on the front gallery in the evening. After nine hours of listening to the eccentricities of Old Sarum’s inhabitants, Judge Taylor threw the case out of court. When asked upon what grounds, Judge Taylor said, “Champertous connivance,” and declared he hoped to Godthe litigants were satisfied by each having had their public say. They were. That was all they had wanted in the first place. Judge Taylor had one interesting habit. He permitted smoking in his courtroom but did not himself indulge: sometimes, if one was lucky, one had the privilege of watching him put a long dry cigar into his mouth and munch it slowly up. Bit by bit the dead cigar would disappear, to reappear some hours later as a flat slick mess, its essence extracted and mingling with Judge Taylor’s digestive juices. I once asked Atticus how Mrs. Taylor stood to kiss him, but Atticus said they didn’t kiss much. The witness stand was to the right of Judge Taylor, and when we got to our seats Mr. Heck Tate was already on it.17 “Jem,” I said, “are those the Ewells sittin’ down yonder?” “Hush,” said Jem, “Mr. Heck Tate’s testifyin’.” Mr. Tate had dressed for the occasion. He wore an ordinary business suit, which made him look somehow like every other man: gone were his high boots, lumber jacket, and bullet-studded belt. From that moment he ceased to terrify me. He was sitting forward in the witness chair, his hands clasped between his knees, listening attentively to the circuit solicitor. The solicitor, a Mr. Gilmer, was not well known to us. He was from Abbottsville; we saw him only when court convened, and that rarely, for court was of no special interest to Jem and me. A balding, smooth-faced man, he could have been anywhere between forty and sixty. Although his back was to us, we knew he had a slight cast",
      "density_breakdown": {
        "Metaphor": 3.7071362372567194,
        "Simile": 3.398208217485326,
        "Imagery": 12.974976830398516,
        "Symbolism": 11.430336731541551,
        "Dialogue": 0.0,
        "Foreshadowing": 3.7071362372567194,
        "Juxtaposition": 10.50355267222737,
        "Repetition": 6.178560395427866,
        "TOTAL_DENSITY": 51.89990732159407
      }
    },
    "climax": {
      "chapter_range": "21",
      "narrative_primary": 21,
      "optimized_primary": 21,
      "device_density_score": 48.501699104108745,
      "improvement_percent": 0.0,
      "optimization_applied": false,
      "chapter_text": "I said.” “Do you remember him beating you about the face?” The witness hesitated. “You seem sure enough that he choked you. All this time you were fighting back, remember? You ‘kicked and hollered as loud as you could.’ Do you remember him beating you about the face?” Mayella was silent. She seemed to be trying to get something clear to herself. I thought for a moment she was doing Mr. Heck Tate’s and my trick of pretending there was a person in front of us. She glanced at Mr. Gilmer. “It’s an easy question, Miss Mayella, so I’ll try again. Do you remember him beating you about the face?” Atticus’s voice had lost its comfortableness; he was speaking in his arid, detached professional voice. “Do you remember him beating you about the face?” “No, I don’t recollect if he hit me. I mean yes I do, he hit me.” “Was your last sentence your answer?” “Huh? Yes, he hit—I just don’t remember, I just don’t remember . . . it all happened so quick.” Judge Taylor looked sternly at Mayella. “Don’t you cry, young woman—” he began, but Atticus said, “Let her cry if she wants to, Judge. We’ve got all the time in the world.” Mayella sniffed wrathfully and looked at Atticus. “I’ll answer any question you got—get me up here an’ mock me, will you? I’ll answer any question you got—” “That’s fine,” said Atticus. “There’re only a few more. Miss Mayella, not to be tedious, you’ve testified that the defendant hit you, grabbed you around the neck, choked you, and took advantage of you. I want you to be sure you have the right man. Will you identify the man who raped you?” “I will, that’s him right yonder.” Atticus turned to the defendant. “Tom, stand up. Let Miss Mayella have a good long look at you. Is this the man, Miss Mayella?”Tom Robinson’s powerful shoulders rippled under his thin shirt. He rose to his feet and stood with his right hand on the back of his chair. He looked oddly off balance, but it was not from the way he was standing. His left arm was fully twelve inches shorter than his right, and hung dead at his side. It ended in a small shriveled hand, and from as far away as the balcony I could see that it was no use to him. “Scout,” breathed Jem. “Scout, look! Reverend, he’s crippled!” Reverend Sykes leaned across me and whispered to Jem. “He got it caught in a cotton gin, caught it in Mr. Dolphus Raymond’s cotton gin when he was a boy . . . like to bled to death . . . tore all the muscles loose from his bones—” Atticus said, “Is this the man who raped you?” “It most certainly is.” Atticus’s next question was one word long. “How?” Mayella was raging. “I don’t know how he done it, but he done it—I said it all happened so fast I—” “Now let’s consider this calmly—” began Atticus, but Mr. Gilmer interrupted with an objection: he was not irrelevant or immaterial, but Atticus was browbeating the witness. Judge Taylor laughed outright. “Oh sit down, Horace, he’s doing nothing of the sort. If anything, the witness’s browbeating Atticus.” Judge Taylor was the only person in the courtroom who laughed. Even the babies were still, and I suddenly wondered if they had been smothered at their mothers’ breasts. “Now,” said Atticus, “Miss Mayella, you’ve testified that the defendant choked and beat you—you didn’t say that he sneaked up behind you and knocked you cold, but you turned around and there he was—” Atticus was back behind his table, and he emphasized his words by tapping his knuckles on it. “—do you wish to reconsider any of your testimony?” “You want me to say something that didn’t happen?” “No ma’am, I want you to say something that did happen. Tell us once more, please, what happened?” “I told’ja what happened.” “You testified that you turned around and there he was. He choked you then?” “Yes.” “Then he released your throat and hit you?” “I said he did.” “He blacked your left eye with his right fist?” “I ducked and it—it glanced, that’s what it did. I ducked and it glanced off.” Mayella had finally seen the light. “You’re becoming suddenly clear on this point. A while ago you couldn’t remember too well, could you?”“I said he hit me.” “All right. He choked you, he hit you, then he raped you, that right?” “It most certainly is.” “You’re a strong girl, what were you doing all the time, just standing there?” “I told’ja I hollered’n’kicked’n’fought—” Atticus reached up and took off his glasses, turned his good right eye to the witness, and rained questions on her. Judge Taylor said, “One question at a time, Atticus. Give the witness a chance to answer.” “All right, why didn’t you run?” “I tried to . . .” “Tried to? What kept you from it?” “I—he slung me down. That’s what he did, he slung me down’n got on top of me.” “You were screaming all this time?” “I certainly was.” “Then why didn’t the other children hear you? Where were they? At the dump?” No answer. “Where were they?” “Why didn’t your screams make them come running? The dump’s closer than the woods, isn’t it?” No answer. “Or didn’t you scream until you saw your father in the window? You didn’t think to scream until then, did you?” No answer. “Did you scream first at your father instead of at Tom Robinson? Was that it?” No answer. “Who beat you up? Tom Robinson or your father?” No answer. “What did your father see in the window, the crime of rape or the best defense to it? Why don’t you tell the truth, child, didn’t Bob Ewell beat you up?” When Atticus turned away from Mayella he looked like his stomach hurt, but Mayella’s face was a mixture of terror and fury. Atticus sat down wearily and polished his glasses with his handkerchief. Suddenly Mayella became articulate. “I got somethin’ to say,” she said. Atticus raised his head. “Do you want to tell us what happened?” But she did not hear the compassion in his invitation. “I got somethin’ to say an’ then I ain’t gonna say no more. That nigger yonder took advantage of me an’ if you fine fancy gentlemen don’t wanta do nothin’ about it thenyou’re all yellow stinkin’ cowards, stinkin’ cowards, the lot of you. Your fancy airs don’t come to nothin’— your ma’amin’ and Miss Mayellerin’ don’t come to nothin’, Mr. Finch—” Then she burst into real tears. Her shoulders shook with angry sobs. She was as good as her word. She answered no more questions, even when Mr. Gilmer tried to get her back on the track. I guess if she hadn’t been so poor and ignorant, Judge Taylor would have put her under the jail for the contempt she had shown everybody in the courtroom. Somehow, Atticus had hit her hard in a way that was not clear to me, but it gave him no pleasure to do so. He sat with his head down, and I never saw anybody glare at anyone with the hatred Mayella showed when she left the stand and walked by Atticus’s table. When Mr. Gilmer told Judge Taylor that the state rested, Judge Taylor said, “It’s time we all did. We’ll take ten minutes.” Atticus and Mr. Gilmer met in front of the bench and whispered, then they left the courtroom by a door behind the witness stand, which was a signal for us all to stretch. I discovered that I had been sitting on the edge of the long bench, and I was somewhat numb. Jem got up and yawned, Dill did likewise, and Reverend Sykes wiped his face on his hat. The temperature was an easy ninety, he said. Mr. Braxton Underwood, who had been sitting quietly in a chair reserved for the Press, soaking up testimony with his sponge of a brain, allowed his bitter eyes to rove over the Colored balcony, and they met mine. He gave a snort and looked away. “Jem,” I said, “Mr. Underwood’s seen us.” “That’s okay. He won’t tell Atticus, he’ll just put it on the social side of the Tribune. ” Jem turned back to Dill, explaining, I suppose, the finer points of the trial to him, but I wondered what they were. There had been no lengthy debates between Atticus and Mr. Gilmer on any points; Mr. Gilmer seemed to be prosecuting almost reluctantly; witnesses had been led by the nose as asses are, with few objections. But Atticus had once told us that in Judge Taylor’s court any lawyer who was a strict constructionist on evidence usually wound up receiving strict instructions from the bench. He distilled this for me to mean that Judge Taylor might look lazy and operate in his sleep, but he was seldom reversed, and that was the proof of the pudding. Atticus said he was a good judge. Presently Judge Taylor returned and climbed into his swivel chair. He took a cigar from his vest pocket and examined it thoughtfully. I punched Dill. Having passed the judge’s inspection, the cigar suffered a vicious bite. “We come down sometimes to watch him,” I explained. “It’s gonna take him the rest of the afternoon, now. You watch.” Unaware of public scrutiny from above, Judge Taylor disposed of the severed end by propelling it expertly to his lips and saying, “Fhluck!” He hit a spittoon so squarely we could hear itslosh. “Bet he was hell with a spitball,” murmured Dill. As a rule, a recess meant a general exodus, but today people weren’t moving. Even the Idlers who had failed to shame younger men from their seats had remained standing along the walls. I guess Mr. Heck Tate had reserved the county toilet for court officials. Atticus and Mr. Gilmer returned, and Judge Taylor looked at his watch. “It’s gettin’ on to four,” he said, which was intriguing, as the courthouse clock must have struck the hour at least twice. I had not heard it or felt its vibrations. “Shall we try to wind up this afternoon?” asked Judge Taylor. “How ’bout it, Atticus?” “I think we can,” said Atticus. “How many witnesses you got?” “One.” “Well, call him.”19 Thomas Robinson reached around, ran his fingers under his left arm and lifted it. He guided his arm to the Bible and his rubber-like left hand sought contact with the black binding. As he raised his right hand, the useless one slipped off the Bible and hit the clerk’s table. He was trying again when Judge Taylor growled, “That’ll do, Tom.” Tom took the oath and stepped into the witness chair. Atticus very quickly induced him to tell us: Tom was twenty-five years of age; he was married with three children; he had been in trouble with the law before: he once received thirty days for disorderly conduct. “It must have been disorderly,” said Atticus. “What did it consist of?” “Got in a fight with another man, he tried to cut me.” “Did he succeed?” “Yes suh, a little, not enough to hurt. You see, I—” Tom moved his left shoulder. “Yes,” said Atticus. “You were both convicted?” “Yes suh, I had to serve ’cause I couldn’t pay the fine. Other fellow paid his’n.” Dill learned across me and asked Jem what Atticus was doing. Jem said Atticus was showing the jury that Tom had nothing to hide. “Were you acquainted with Mayella Violet Ewell?” asked Atticus. “Yes suh, I had to pass her place goin’ to and from the field every day.” “Whose field?” “I picks for Mr. Link Deas.” “Were you picking cotton in November?” “No suh, I works in his yard fall an’ wintertime. I works pretty steady for him all year round, he’s got a lot of pecan trees’n things.” “You say you had to pass the Ewell place to get to and from work. Is there any other way to go?” “No suh, none’s I know of.” “Tom, did she ever speak to you?” “Why, yes suh, I’d tip m’hat when I’d go by, and one day she asked me to come inside the fence and bust up a chiffarobe for her.”“When did she ask you to chop up the—the chiffarobe?” “Mr. Finch, it was way last spring. I remember it because it was choppin’ time and I had my hoe with me. I said I didn’t have nothin’ but this hoe, but she said she had a hatchet. She give me the hatchet and I broke up the chiffarobe. She said, ‘I reckon I’ll hafta give you a nickel, won’t I?’ I said, ‘No ma’am, there ain’t no charge.’ Then I went home. Mr. Finch, that was way last spring, way over a year ago.” “Did you ever go on the place again?” “Yes suh.” “When?” “Well, I went lots of times.” Judge Taylor instinctively reached for his gavel, but let his hand fall. The murmur below us died without his help. “Under what circumstances?” “Please, suh?” “Why did you go inside the fence lots of times?” Tom Robinson’s forehead relaxed. “She’d call me in, suh. Seemed like every time I passed by yonder she’d have some little somethin’ for me to do —choppin’ kindlin’, totin’ water for her. She watered them red flowers every day—” “Were you paid for your services?” “No suh, not after she offered me a nickel the first time. I was glad to do it, Mr. Ewell didn’t seem to help her none, and neither did the chillun, and I knowed she didn’t have no nickels to spare.” “Where were the other children?” “They was always around, all over the place. They’d watch me work, some of ’em, some of ’em’d set in the window.” “Would Miss Mayella talk to you?” “Yes suh, she talked to me.” As Tom Robinson gave his testimony, it came to me that Mayella Ewell must have been the loneliest person in the world. She was even lonelier than Boo Radley, who had not been out of the house in twenty-five years. When Atticus asked had she any friends, she seemed not to know what he meant, then she thought he was making fun of her. She was as sad, I thought, as what Jem called a mixed child: white people wouldn’t have anything to do with her because she lived among pigs; Negroes wouldn’t have anything to do with her because she was white. She couldn’t live like Mr. Dolphus Raymond, who preferred the company of Negroes, because she didn’t own a riverbank and she wasn’t from a fine old family. Nobody said, “That’s just their way,” about the Ewells. Maycomb gave them Christmas baskets, welfare money, and the back of its hand. Tom Robinson was probably the only person who was ever decent to her. But she said he took advantage of her, and when she stood upshe looked at him as if he were dirt beneath her feet. “Did you ever,” Atticus interrupted my meditations, “at any time, go on the Ewell property—did you ever set foot on the Ewell property without an express invitation from one of them?” “No suh, Mr. Finch, I never did. I wouldn’t do that, suh.” Atticus sometimes said that one way to tell whether a witness was lying or telling the truth was to listen rather than watch: I applied his test—Tom denied it three times in one breath, but quietly, with no hint of whining in his voice, and I found myself believing him in spite of his protesting too much. He seemed to be a respectable Negro, and a respectable Negro would never go up into somebody’s yard of his own volition. “Tom, what happened to you on the evening of November twenty-first of last year?” Below us, the spectators drew a collective breath and leaned forward. Behind us, the Negroes did the same. Tom was a black-velvet Negro, not shiny, but soft black velvet. The whites of his eyes shone in his face, and when he spoke we saw flashes of his teeth. If he had been whole, he would have been a fine specimen of a man. “Mr. Finch,” he said, “I was goin’ home as usual that evenin’, an’ when I passed the Ewell place Miss Mayella were on the porch, like she said she were. It seemed real quiet like, an’ I didn’t quite know why. I was studyin’ why, just passin’ by, when she says for me to come there and help her a minute. Well, I went inside the fence an’ looked around for some kindlin’ to work on, but I didn’t see none, and she says, ‘Naw, I got somethin’ for you to do in the house. Th’ old door’s off its hinges an’ fall’s comin’ on pretty fast.’ I said you got a screwdriver, Miss Mayella? She said she sho’ had. Well, I went up the steps an’ she motioned me to come inside, and I went in the front room an’ looked at the door. I said Miss Mayella, this door look all right. I pulled it back’n forth and those hinges was all right. Then she shet the door in my face. Mr. Finch, I was wonderin’ why it was so quiet like, an’ it come to me that there weren’t a chile on the place, not a one of ’em, and I said Miss Mayella, where the chillun?” Tom’s black velvet skin had begun to shine, and he ran his hand over his face. “I say where the chillun?” he continued, “an’ she says—she was laughin’, sort of—she says they all gone to town to get ice creams. She says, ‘Took me a slap year to save seb’m nickels, but I done it. They all gone to town.’ ” Tom’s discomfort was not from the humidity. “What did you say then, Tom?” asked Atticus. “I said somethin’ like, why Miss Mayella, that’s right smart o’you to treat ’em. An’ she said, ‘You think so?’ I don’t think she understood what I was thinkin’—I meant it was smart of her to save like that, an’ nice of her to treat’em.” “I understand you, Tom. Go on,” said Atticus. “Well, I said I best be goin’, I couldn’t do nothin’ for her, an’ she says oh yes I could, an’ I ask her what, and she says to just step on that chair yonder an’ git that box down from on top of the chiffarobe.” “Not the same chiffarobe you busted up?” asked Atticus. The witness smiled. “Naw suh, another one. Most as tall as the room. So I done what she told me, an’ I was just reachin’ when the next thing I knows she—she’d grabbed me round the legs, grabbed me round th’ legs, Mr. Finch. She scared me so bad I hopped down an’ turned the chair over—that was the only thing, only furniture, ’sturbed in that room, Mr. Finch, when I left it. I swear ’fore God.” “What happened after you turned the chair over?” Tom Robinson had come to a dead stop. He glanced at Atticus, then at the jury, then at Mr. Underwood sitting across the room. “Tom, you’re sworn to tell the whole truth. Will you tell it?” Tom",
      "density_breakdown": {
        "Metaphor": 2.4714241581711462,
        "Simile": 1.5446400988569664,
        "Imagery": 8.958912573370405,
        "Symbolism": 12.666048810627125,
        "Dialogue": 0.0,
        "Foreshadowing": 3.7071362372567194,
        "Juxtaposition": 8.032128514056224,
        "Repetition": 11.121408711770158,
        "TOTAL_DENSITY": 48.501699104108745
      }
    },
    "falling_action": {
      "chapter_range": "22-28",
      "narrative_primary": 25,
      "optimized_primary": 28,
      "device_density_score": 55.589870290302656,
      "improvement_percent": 11.801242236024839,
      "optimization_applied": true,
      "chapter_text": "Stephanie Crawford. I heard her say it’s time somebody taught ’em a lesson, they were gettin’ way above themselves, an’ the next thing they think they can do is marry us. Jem, how can you hate Hitler so bad an’ then turn around and be ugly about folks right at home—” Jem was suddenly furious. He leaped off the bed, grabbed me by the collar and shook me. “I never wanta hear about that courthouse again, ever, ever, you hear me? You hear me? Don’t you ever say one word to me about it again, you hear? Now go on!” I was too surprised to cry. I crept from Jem’s room and shut the door softly, lest undue noise set him off again. Suddenly tired, I wanted Atticus. He was in the livingroom, and I went to him and tried to get in his lap. Atticus smiled. “You’re getting so big now, I’ll just have to hold a part of you.” He held me close. “Scout,” he said softly, “don’t let Jem get you down. He’s having a rough time these days. I heard you back there.” Atticus said that Jem was trying hard to forget something, but what he was really doing was storing it away for a while, until enough time passed. Then he would be able to think about it and sort things out. When he was able to think about it, Jem would be himself again.27 Things did settle down, after a fashion, as Atticus said they would. By the middle of October, only two small things out of the ordinary happened to two Maycomb citizens. No, there were three things, and they did not directly concern us—the Finches—but in a way they did. The first thing was that Mr. Bob Ewell acquired and lost a job in a matter of days and probably made himself unique in the annals of the nineteen-thirties: he was the only man I ever heard of who was fired from the WPA for laziness. I suppose his brief burst of fame brought on a briefer burst of industry, but his job lasted only as long as his notoriety: Mr. Ewell found himself as forgotten as Tom Robinson. Thereafter, he resumed his regular weekly appearances at the welfare office for his check, and received it with no grace amid obscure mutterings that the bastards who thought they ran this town wouldn’t permit an honest man to make a living. Ruth Jones, the welfare lady, said Mr. Ewell openly accused Atticus of getting his job. She was upset enough to walk down to Atticus’s office and tell him about it. Atticus told Miss Ruth not to fret, that if Bob Ewell wanted to discuss Atticus’s “getting” his job, he knew the way to the office. The second thing happened to Judge Taylor. Judge Taylor was not a Sunday-night churchgoer; Mrs. Taylor was. Judge Taylor savored his Sunday night hour alone in his big house, and churchtime found him holed up in his study reading the writings of Bob Taylor (no kin, but the judge would have been proud to claim it). One Sunday night, lost in fruity metaphors and florid diction, Judge Taylor’s attention was wrenched from the page by an irritating scratching noise. “Hush,” he said to Ann Taylor, his fat nondescript dog. Then he realized he was speaking to an empty room; the scratching noise was coming from the rear of the house. Judge Taylor clumped to the back porch to let Ann out and found the screen door swinging open. A shadow on the corner of the house caught his eye, and that was all he saw of his visitor. Mrs. Taylor came home from church to find her husband in his chair, lost in the writings of Bob Taylor, with a shotgun across his lap. The third thing happened to Helen Robinson, Tom’s widow. If Mr. Ewell was as forgotten as Tom Robinson, Tom Robinson was as forgotten as BooRadley. But Tom was not forgotten by his employer, Mr. Link Deas. Mr. Link Deas made a job for Helen. He didn’t really need her, but he said he felt right bad about the way things turned out. I never knew who took care of her children while Helen was away. Calpurnia said it was hard on Helen, because she had to walk nearly a mile out of her way to avoid the Ewells, who, according to Helen, “chunked at her” the first time she tried to use the public road. Mr. Link Deas eventually received the impression that Helen was coming to work each morning from the wrong direction, and dragged the reason out of her. “Just let it be, Mr. Link, please suh,” Helen begged. “The hell I will,” said Mr. Link. He told her to come by his store that afternoon before she left. She did, and Mr. Link closed his store, put his hat firmly on his head, and walked Helen home. He walked her the short way, by the Ewells’. On his way back, Mr. Link stopped at the crazy gate. “Ewell?” he called. “I say Ewell!” The windows, normally packed with children, were empty. “I know every last one of you’s in there a-layin’ on the floor! Now hear me, Bob Ewell: if I hear one more peep outa my girl Helen about not bein’ able to walk this road I’ll have you in jail before sundown!” Mr. Link spat in the dust and walked home. Helen went to work next morning and used the public road. Nobody chunked at her, but when she was a few yards beyond the Ewell house, she looked around and saw Mr. Ewell walking behind her. She turned and walked on, and Mr. Ewell kept the same distance behind her until she reached Mr. Link Deas’s house. All the way to the house, Helen said, she heard a soft voice behind her, crooning foul words. Thoroughly frightened, she telephoned Mr. Link at his store, which was not too far from his house. As Mr. Link came out of his store he saw Mr. Ewell leaning on the fence. Mr. Ewell said, “Don’t you look at me, Link Deas, like I was dirt. I ain’t jumped your—” “First thing you can do, Ewell, is get your stinkin’ carcass off my property. You’re leanin’ on it an’ I can’t afford fresh paint for it. Second thing you can do is stay away from my cook or I’ll have you up for assault—” “I ain’t touched her, Link Deas, and ain’t about to go with no nigger!” “You don’t have to touch her, all you have to do is make her afraid, an’ if assault ain’t enough to keep you locked up a while, I’ll get you in on the Ladies’ Law, so get outa my sight! If you don’t think I mean it, just bother that girl again!” Mr. Ewell evidently thought he meant it, for Helen reported no further trouble. “I don’t like it, Atticus, I don’t like it at all,” was Aunt Alexandra’s assessment of these events. “That man seems to have a permanent running grudge against everybody connected with that case. I know how that kind are about paying off grudges, but I don’t understand why he should harbor one—he had his way in court, didn’t he?” “I think I understand,” said Atticus. “It might be because he knows in his heart that very few people in Maycomb really believed his and Mayella’s yarns. He thought he’d be a hero, but all he got for his pain was . . . was, okay, we’ll convict this Negro but get back to your dump. He’s had his fling with about everybody now, so he ought to be satisfied. He’ll settle down when the weather changes.” “But why should he try to burgle John Taylor’s house? He obviously didn’t know John was home or he wouldn’t have tried. Only lights John shows on Sunday nights are on the front porch and back in his den . . .” “You don’t know if Bob Ewell cut that screen, you don’t know who did it,” said Atticus. “But I can guess. I proved him a liar but John made him look like a fool. All the time Ewell was on the stand I couldn’t dare look at John and keep a straight face. John looked at him as if he were a three-legged chicken or a square egg. Don’t tell me judges don’t try to prejudice juries,” Atticus chuckled. By the end of October, our lives had become the familiar routine of school, play, study. Jem seemed to have put out of his mind whatever it was he wanted to forget, and our classmates mercifully let us forget our father’s eccentricities. Cecil Jacobs asked me one time if Atticus was a Radical. When I asked Atticus, Atticus was so amused I was rather annoyed, but he said he wasn’t laughing at me. He said, “You tell Cecil I’m about as radical as Cotton Tom Heflin.” Aunt Alexandra was thriving. Miss Maudie must have silenced the whole missionary society at one blow, for Aunty again ruled that roost. Her refreshments grew even more delicious. I learned more about the poor Mrunas’ social life from listening to Mrs. Merriweather: they had so little sense of family that the whole tribe was one big family. A child had as many fathers as there were men in the community, as many mothers as there were women. J. Grimes Everett was doing his utmost to change this state of affairs, and desperately needed our prayers. Maycomb was itself again. Precisely the same as last year and the year before that, with only two minor changes. Firstly, people had removed from their store windows and automobiles the stickers that said NRA—WE DO OUR PART. I asked Atticus why, and he said it was because the National Recovery Act was dead. I asked who killed it; he said nine old men. The second change in Maycomb since last year was not one of national significance. Until then, Halloween in Maycomb was a completely unorganized affair. Each child did what he wanted to do, with assistance from other children if there was anything to be moved, such as placing a light buggy on top of the livery stable. But parents thought things went too far last year, when the peace of Miss Tutti and Miss Frutti was shattered.Misses Tutti and Frutti Barber were maiden ladies, sisters, who lived together in the only Maycomb residence boasting a cellar. The Barber ladies were rumored to be Republicans, having migrated from Clanton, Alabama, in 1911. Their ways were strange to us, and why they wanted a cellar nobody knew, but they wanted one, and they dug one, and they spent the rest of their lives chasing generations of children out of it. Misses Tutti and Frutti (their names were Sarah and Frances), aside from their Yankee ways, were both deaf. Miss Tutti denied it and lived in a world of silence, but Miss Frutti, not about to miss anything, employed an ear trumpet so enormous that Jem declared it was a loud-speaker from one of those dog Victrolas. With these facts in mind and Halloween at hand, some wicked children had waited until the Misses Barber were thoroughly asleep, slipped into their livingroom (nobody but the Radleys locked up at night), stealthily made away with every stick of furniture therein, and hid it in the cellar. I deny having taken part in such a thing. “I heard ’em!” was the cry that awoke the Misses Barber’s neighbors at dawn next morning. “Heard ’em drive a truck up to the door! Stomped around like horses. They’re in New Orleans by now!” Miss Tutti was sure those traveling fur sellers who came through town two days ago had purloined their furniture. “Da-rk they were,” she said. “Syrians.” Mr. Heck Tate was summoned. He surveyed the area and said he thought it was a local job. Miss Frutti said she’d know a Maycomb voice anywhere, and there were no Maycomb voices in that parlor last night—rolling their r’s all over her premises, they were. Nothing less than the bloodhounds must be used to locate their furniture, Miss Tutti insisted, so Mr. Tate was obliged to go ten miles out the road, round up the county hounds, and put them on the trail. Mr. Tate started them off at the Misses Barber’s front steps, but all they did was run around to the back of the house and howl at the cellar door. When Mr. Tate set them in motion three times, he finally guessed the truth. By noontime that day, there was not a barefooted child to be seen in Maycomb, and nobody took off his shoes until the hounds were returned. So the Maycomb ladies said things would be different this year. The high- school auditorium would be open, there would be a pageant for the grown- ups; apple-bobbing, taffy-pulling, pinning the tail on the donkey for the children. There would also be a prize of twenty-five cents for the best Halloween costume, created by the wearer. Jem and I both groaned. Not that we’d ever done anything, it was the principle of the thing. Jem considered himself too old for Halloween anyway; he said he wouldn’t be caught anywhere near the high school at something like that. Oh well, I thought, Atticus would take me.I soon learned, however, that my services would be required on stage that evening. Mrs. Grace Merriweather had composed an original pageant entitled Maycomb County: Ad Astra Per Aspera, and I was to be a ham. She thought it would be adorable if some of the children were costumed to represent the county’s agricultural products: Cecil Jacobs would be dressed up to look like a cow; Agnes Boone would make a lovely butterbean, another child would be a peanut, and on down the line until Mrs. Merriweather’s imagination and the supply of children were exhausted. Our only duties, as far as I could gather from our two rehearsals, were to enter from stage left as Mrs. Merriweather (not only the author, but the narrator) identified us. When she called out, “Pork,” that was my cue. Then the assembled company would sing, “Maycomb County, Maycomb County, we will aye be true to thee,” as the grand finale, and Mrs. Merriweather would mount the stage with the state flag. My costume was not much of a problem. Mrs. Crenshaw, the local seamstress, had as much imagination as Mrs. Merriweather. Mrs. Crenshaw took some chicken wire and bent it into the shape of a cured ham. This she covered with brown cloth, and painted it to resemble the original. I could duck under and someone would pull the contraption down over my head. It came almost to my knees. Mrs. Crenshaw thoughtfully left two peepholes for me. She did a fine job; Jem said I looked exactly like a ham with legs. There were several discomforts, though: it was hot, it was a close fit; if my nose itched I couldn’t scratch, and once inside I could not get out of it alone. When Halloween came, I assumed that the whole family would be present to watch me perform, but I was disappointed. Atticus said as tactfully as he could that he just didn’t think he could stand a pageant tonight, he was all in. He had been in Montgomery for a week and had come home late that afternoon. He thought Jem might escort me if I asked him. Aunt Alexandra said she just had to get to bed early, she’d been decorating the stage all afternoon and was worn out—she stopped short in the middle of her sentence. She closed her mouth, then opened it to say something, but no words came. “’s matter, Aunty?” I asked. “Oh nothing, nothing,” she said, “somebody just walked over my grave.” She put away from her whatever it was that gave her a pinprick of apprehension, and suggested that I give the family a preview in the livingroom. So Jem squeezed me into my costume, stood at the livingroom door, called out “Po-ork,” exactly as Mrs. Merriweather would have done, and I marched in. Atticus and Aunt Alexandra were delighted. I repeated my part for Calpurnia in the kitchen and she said I was wonderful. I wanted to go across the street to show Miss Maudie, but Jem said she’d probably be at the pageant anyway.After that, it didn’t matter whether they went or not. Jem said he would take me. Thus began our longest journey together.28 The weather was unusually warm for the last day of October. We didn’t even need jackets. The wind was growing stronger, and Jem said it might be raining before we got home. There was no moon. The street light on the corner cast sharp shadows on the Radley house. I heard Jem laugh softly. “Bet nobody bothers them tonight,” he said. Jem was carrying my ham costume, rather awkwardly, as it was hard to hold. I thought it gallant of him to do so. “It is a scary place though, ain’t it?” I said. “Boo doesn’t mean anybody any harm, but I’m right glad you’re along.” “You know Atticus wouldn’t let you go to the schoolhouse by yourself,” Jem said. “Don’t see why, it’s just around the corner and across the yard.” “That yard’s a mighty long place for little girls to cross at night,” Jem teased. “Ain’t you scared of haints?” We laughed. Haints, Hot Steams, incantations, secret signs, had vanished with our years as mist with sunrise. “What was that old thing,” Jem said, “Angel bright, life-in-death; get off the road, don’t suck my breath.” “Cut it out, now,” I said. We were in front of the Radley Place. Jem said, “Boo must not be at home. Listen.” High above us in the darkness a solitary mocker poured out his repertoire in blissful unawareness of whose tree he sat in, plunging from the shrill kee, kee of the sunflower bird to the irascible qua-ack of a bluejay, to the sad lament of Poor Will, Poor Will, Poor Will. We turned the corner and I tripped on a root growing in the road. Jem tried to help me, but all he did was drop my costume in the dust. I didn’t fall, though, and soon we were on our way again. We turned off the road and entered the schoolyard. It was pitch black. “How do you know where we’re at, Jem?” I asked, when we had gone a few steps. “I can tell we’re under the big oak because we’re passin’ through a cool spot. Careful now, and don’t fall again.” We had slowed to a cautious gait, and were feeling our way forward so asnot to bump into the tree. The tree was a single and ancient oak; two children could not reach around its trunk and touch hands. It was far away from teachers, their spies, and curious neighbors: it was near the Radley lot, but the Radleys were not curious. A small patch of earth beneath its branches was packed hard from many fights and furtive crap games. The lights in the high school auditorium were blazing in the distance, but they blinded us, if anything. “Don’t look ahead, Scout,” Jem said. “Look at the ground and you",
      "density_breakdown": {
        "Metaphor": 2.4706609017912293,
        "Simile": 2.1618282890673255,
        "Imagery": 9.882643607164917,
        "Symbolism": 13.897467572575664,
        "Dialogue": 0.0,
        "Foreshadowing": 9.882643607164917,
        "Juxtaposition": 13.897467572575664,
        "Repetition": 3.3971587399629404,
        "TOTAL_DENSITY": 55.589870290302656
      }
    },
    "resolution": {
      "chapter_range": "29-31",
      "narrative_primary": 31,
      "optimized_primary": 29,
      "device_density_score": 50.6641952425085,
      "improvement_percent": 1.8948224815170864,
      "optimization_applied": true,
      "chapter_text": "won’t fall.” “You should have brought the flashlight, Jem.” “Didn’t know it was this dark. Didn’t look like it’d be this dark earlier in the evening. So cloudy, that’s why. It’ll hold off a while, though.” Someone leaped at us. “God amighty!” Jem yelled. A circle of light burst in our faces, and Cecil Jacobs jumped in glee behind it. “Ha-a-a, gotcha!” he shrieked. “Thought you’d be comin’ along this way!” “What are you doin’ way out here by yourself, boy? Ain’t you scared of Boo Radley?” Cecil had ridden safely to the auditorium with his parents, hadn’t seen us, then had ventured down this far because he knew good and well we’d be coming along. He thought Mr. Finch’d be with us, though. “Shucks, ain’t much but around the corner,” said Jem. “Who’s scared to go around the corner?” We had to admit that Cecil was pretty good, though. He had given us a fright, and he could tell it all over the schoolhouse, that was his privilege. “Say,” I said, “ain’t you a cow tonight? Where’s your costume?” “It’s up behind the stage,” he said. “Mrs. Merriweather says the pageant ain’t comin’ on for a while. You can put yours back of the stage by mine, Scout, and we can go with the rest of ’em.” This was an excellent idea, Jem thought. He also thought it a good thing that Cecil and I would be together. This way, Jem would be left to go with people his own age. When we reached the auditorium, the whole town was there except Atticus and the ladies worn out from decorating, and the usual outcasts and shut-ins. Most of the county, it seemed, was there: the hall was teeming with slicked-up country people. The high school building had a wide downstairs hallway; people milled around booths that had been installed along each side. “Oh Jem, I forgot my money,” I sighed, when I saw them. “Atticus didn’t,” Jem said. “Here’s thirty cents, you can do six things. See you later on.” “Okay,” I said, quite content with thirty cents and Cecil. I went with Cecil down to the front of the auditorium, through a door on one side, and backstage. I got rid of my ham costume and departed in a hurry, for Mrs.Merriweather was standing at a lectern in front of the first row of seats making last-minute, frenzied changes in the script. “How much money you got?” I asked Cecil. Cecil had thirty cents, too, which made us even. We squandered our first nickels on the House of Horrors, which scared us not at all; we entered the black seventh-grade room and were led around by the temporary ghoul in residence and were made to touch several objects alleged to be the component parts of a human being. “Here’s his eyes,” we were told when we touched two peeled grapes on a saucer. “Here’s his heart,” which felt like raw liver. “These are his innards,” and our hands were thrust into a plate of cold spaghetti. Cecil and I visited several booths. We each bought a sack of Mrs. Judge Taylor’s homemade divinity. I wanted to bob for apples, but Cecil said it wasn’t sanitary. His mother said he might catch something from everybody’s heads having been in the same tub. “Ain’t anything around town now to catch,” I protested. But Cecil said his mother said it was unsanitary to eat after folks. I later asked Aunt Alexandra about this, and she said people who held such views were usually climbers. We were about to purchase a blob of taffy when Mrs. Merriweather’s runners appeared and told us to go backstage, it was time to get ready. The auditorium was filling with people; the Maycomb County High School band had assembled in front below the stage; the stage footlights were on and the red velvet curtain rippled and billowed from the scurrying going on behind it. Backstage, Cecil and I found the narrow hallway teeming with people: adults in homemade three-corner hats, Confederate caps, Spanish-American War hats, and World War helmets. Children dressed as various agricultural enterprises crowded around the one small window. “Somebody’s mashed my costume,” I wailed in dismay. Mrs. Merriweather galloped to me, reshaped the chicken wire, and thrust me inside. “You all right in there, Scout?” asked Cecil. “You sound so far off, like you was on the other side of a hill.” “You don’t sound any nearer,” I said. The band played the national anthem, and we heard the audience rise. Then the bass drum sounded. Mrs. Merriweather, stationed behind her lectern beside the band, said: “Maycomb County: Ad Astra Per Aspera.” The bass drum boomed again. “That means,” said Mrs. Merriweather, translating for the rustic elements, “from the mud to the stars.” She added, unnecessarily it seemed to me, “A pageant.” “Reckon they wouldn’t know what it was if she didn’t tell ’em,” whispered Cecil, who was immediately shushed. “The whole town knows it,” I breathed. “But the country folks’ve come in,” Cecil said. “Be quiet back there,” a man’s voice ordered, and we were silent.The bass drum went boom with every sentence Mrs. Merriweather uttered. She chanted mournfully about Maycomb County being older than the state, that it was part of the Mississippi and Alabama Territories, that the first white man to set foot in the virgin forests was the Probate Judge’s great-grandfather five times removed, who was never heard of again. Then came the fearless Colonel Maycomb, for whom the county was named. Andrew Jackson appointed him to a position of authority and Colonel Maycomb’s misplaced self-confidence and slender sense of direction brought disaster to all who rode with him in the Creek Indian Wars. Colonel Maycomb persevered in his efforts to make the region safe for democracy, but his first campaign was his last. His orders, relayed to him by a friendly Indian runner, were to move south. After consulting a tree to ascertain from its lichen which way was south, and taking no lip from the subordinates who ventured to correct him, Colonel Maycomb set out on a purposeful journey to rout the enemy and entangled his troops so far northwest in the forest primeval that they were eventually rescued by settlers moving inland. Mrs. Merriweather gave a thirty-minute description of Colonel Maycomb’s exploits. I discovered that if I bent my knees I could tuck them under my costume and more or less sit. I sat down, listened to Mrs. Merriweather’s drone and the bass drum’s boom and was soon fast asleep. They said later that Mrs. Merriweather was putting her all into the grand finale, that she had crooned, “Po-ork,” with a confidence born of pine trees and butterbeans entering on cue. She waited a few seconds, then called, “Po- ork?” When nothing materialized, she yelled, “Pork!” I must have heard her in my sleep, or the band playing Dixie woke me, but it was when Mrs. Merriweather triumphantly mounted the stage with the state flag that I chose to make my entrance. Chose is incorrect: I thought I’d better catch up with the rest of them. They told me later that Judge Taylor went out behind the auditorium and stood there slapping his knees so hard Mrs. Taylor brought him a glass of water and one of his pills. Mrs. Merriweather seemed to have a hit, everybody was cheering so, but she caught me backstage and told me I had ruined her pageant. She made me feel awful, but when Jem came to fetch me he was sympathetic. He said he couldn’t see my costume much from where he was sitting. How he could tell I was feeling bad under my costume I don’t know, but he said I did all right, I just came in a little late, that was all. Jem was becoming almost as good as Atticus at making you feel right when things went wrong. Almost—not even Jem could make me go through that crowd, and he consented to wait backstage with me until the audience left. “You wanta take it off, Scout?” he asked. “Naw, I’ll just keep it on,” I said. I could hide my mortification under it.“You all want a ride home?” someone said. “No sir, thank you,” I heard Jem say. “It’s just a little walk.” “Be careful of haints,” the voice said. “Better still, tell the haints to be careful of Scout.” “There aren’t many folks left now,” Jem told me. “Let’s go.” We went through the auditorium to the hallway, then down the steps. It was still black dark. The remaining cars were parked on the other side of the building, and their headlights were little help. “If some of ’em were goin’ in our direction we could see better,” said Jem. “Here Scout, let me hold onto your—hock. You might lose your balance.” “I can see all right.” “Yeah, but you might lose your balance.” I felt a slight pressure on my head, and assumed that Jem had grabbed that end of the ham. “You got me?” “Uh huh.” We began crossing the black schoolyard, straining to see our feet. “Jem,” I said, “I forgot my shoes, they’re back behind the stage.” “Well let’s go get ’em.” But as we turned around, the auditorium lights went off. “You can get ’em tomorrow,” he said. “But tomorrow’s Sunday,” I protested, as Jem turned me homeward. “You can get the janitor to let you in . . . Scout?” “Hm?” “Nothing.” Jem hadn’t started like that in a long time. I wondered what he was thinking. He’d tell me when he wanted to, probably when we got home. I felt his fingers press the top of my costume, too hard, it seemed. I shook my head. “Jem, you don’t hafta—” “Hush a minute, Scout,” he said, pinching me. We walked along silently. “Minute’s up,” I said. “Whatcha thinkin’ about?” I turned to look at him, but his outline was barely visible. “Thought I heard something,” he said. “Stop a minute.” We stopped. “Hear anything?” he asked. “No.” We had not gone five paces before he made me stop again. “Jem, are you tryin’ to scare me? You know I’m too old—” “Be quiet,” he said, and I knew he was not joking. The night was still. I could hear his breath coming easily beside me. Occasionally there was a sudden breeze that hit my bare legs, but it was all that remained of a promised windy night. This was the stillness before a thunderstorm. We listened. “Heard an old dog just then,” I said. “It’s not that,” Jem answered. “I hear it when we’re walkin’ along, butwhen we stop I don’t hear it.” “You hear my costume rustlin’. Aw, it’s just Halloween got you. . . .” I said it more to convince myself than Jem, for sure enough, as we began walking, I heard what he was talking about. It was not my costume. “It’s just old Cecil,” said Jem presently. “He won’t get us again. Let’s don’t let him think we’re hurrying.” We slowed to a crawl. I asked Jem how Cecil could follow us in this dark, looked to me like he’d bump into us from behind. “I can see you, Scout,” Jem said. “How? I can’t see you.” “Your fat streaks are showin’. Mrs. Crewnshaw painted ’em with some of that shiny stuff so they’d show up under the footlights. I can see you pretty well, an’ I expect Cecil can see you well enough to keep his distance.” I would show Cecil that we knew he was behind us and we were ready for him. “Cecil Jacobs is a big wet he-en!” I yelled suddenly, turning around. We stopped. There was no acknowledgment save he-en bouncing off the distant schoolhouse wall. “I’ll get him,” said Jem. “He-y!” Hay-e-hay-e-hay-e, answered the schoolhouse wall. It was unlike Cecil to hold out for so long; once he pulled a joke he’d repeat it time and again. We should have been leapt at already. Jem signaled for me to stop again. He said softly, “Scout, can you take that thing off?” “I think so, but I ain’t got anything on under it much.” “I’ve got your dress here.” “I can’t get it on in the dark.” “Okay,” he said, “never mind.” “Jem, are you afraid?” “No. Think we’re almost to the tree now. Few yards from that, an’ we’ll be to the road. We can see the street light then.” Jem was talking in an unhurried, flat toneless voice. I wondered how long he would try to keep the Cecil myth going. “You reckon we oughta sing, Jem?” “No. Be real quiet again, Scout.” We had not increased our pace. Jem knew as well as I that it was difficult to walk fast without stumping a toe, tripping on stones, and other inconveniences, and I was barefooted. Maybe it was the wind rustling the trees. But there wasn’t any wind and there weren’t any trees except the big oak. Our company shuffled and dragged his feet, as if wearing heavy shoes. Whoever it was wore thick cotton pants; what I thought were trees rustling was the soft swish of cotton on cotton, wheek, wheek, with every step.I felt the sand go cold under my feet and I knew we were near the big oak. Jem pressed my head. We stopped and listened. Shuffle-foot had not stopped with us this time. His trousers swished softly and steadily. Then they stopped. He was running, running toward us with no child’s steps. “Run, Scout! Run! Run!” Jem screamed. I took one giant step and found myself reeling: my arms useless, in the dark, I could not keep my balance. “Jem, Jem, help me, Jem!” Something crushed the chicken wire around me. Metal ripped on metal and I fell to the ground and rolled as far as I could, floundering to escape my wire prison. From somewhere near by came scuffling, kicking sounds, sounds of shoes and flesh scraping dirt and roots. Someone rolled against me and I felt Jem. He was up like lightning and pulling me with him but, though my head and shoulders were free, I was so entangled we didn’t get very far. We were nearly to the road when I felt Jem’s hand leave me, felt him jerk backwards to the ground. More scuffling, and there came a dull crunching sound and Jem screamed. I ran in the direction of Jem’s scream and sank into a flabby male stomach. Its owner said, “Uff!” and tried to catch my arms, but they were tightly pinioned. His stomach was soft but his arms were like steel. He slowly squeezed the breath out of me. I could not move. Suddenly he was jerked backwards and flung on the ground, almost carrying me with him. I thought, Jem’s up. One’s mind works very slowly at times. Stunned, I stood there dumbly. The scuffling noises were dying; someone wheezed and the night was still again. Still but for a man breathing heavily, breathing heavily and staggering. I thought he went to the tree and leaned against it. He coughed violently, a sobbing, bone-shaking cough. “Jem?” There was no answer but the man’s heavy breathing. “Jem?” Jem didn’t answer. The man began moving around, as if searching for something. I heard him groan and pull something heavy along the ground. It was slowly coming to me that there were now four people under the tree. “Atticus . . . ?” The man was walking heavily and unsteadily toward the road. I went to where I thought he had been and felt frantically along the ground, reaching out with my toes. Presently I touched someone. “Jem?” My toes touched trousers, a belt buckle, buttons, something I could notidentify, a collar, and a face. A prickly stubble on the face told me it was not Jem’s. I smelled stale whiskey. I made my way along in what I thought was the direction of the road. I was not sure, because I had been turned around so many times. But I found it and looked down to the street light. A man was passing under it. The man was walking with the staccato steps of someone carrying a load too heavy for him. He was going around the corner. He was carrying Jem. Jem’s arm was dangling crazily in front of him. By the time I reached the corner the man was crossing our front yard. Light from our front door framed Atticus for an instant; he ran down the steps, and together, he and the man took Jem inside. I was at the front door when they were going down the hall. Aunt Alexandra was running to meet me. “Call Dr. Reynolds!” Atticus’s voice came sharply from Jem’s room. “Where’s Scout?” “Here she is,” Aunt Alexandra called, pulling me along with her to the telephone. She tugged at me anxiously. “I’m all right, Aunty,” I said, “you better call.” She pulled the receiver from the hook and said, “Eula May, get Dr. Reynolds, quick!” “Agnes, is your father home? Oh God, where is he? Please tell him to come over here as soon as he comes in. Please, it’s urgent!” There was no need for Aunt Alexandra to identify herself; people in Maycomb knew each other’s voices. Atticus came out of Jem’s room. The moment Aunt Alexandra broke the connection, Atticus took the receiver from her. He rattled the hook, then said, “Eula May, get me the sheriff, please.” “Heck? Atticus Finch. Someone’s been after my children. Jem’s hurt. Between here and the schoolhouse. I can’t leave my boy. Run out there for me, please, and see if he’s still around. Doubt if you’ll find him now, but I’d like to see him if you do. Got to go now. Thanks, Heck.” “Atticus, is Jem dead?” “No, Scout. Look after her, sister,” he called, as he went down the hall. Aunt Alexandra’s fingers trembled as she unwound the crushed fabric and wire from around me. “Are you all right, darling?” she asked over and over as she worked me free. It was a relief to be out. My arms were beginning to tingle, and they were red with small hexagonal marks. I rubbed them, and they felt better. “Aunty, is Jem dead?” “No—no, darling, he’s unconscious. We won’t know how badly he’s hurt until Dr. Reynolds gets here. Jean Louise, what happened?” “I don’t know.” She left it at that. She brought me something to put on, and had I thoughtabout it then, I would have never let her forget it: in her distraction, Aunty brought me my overalls. “Put these on, darling,” she said, handing me the garments she most despised. She rushed back to Jem’s room, then came to me in the hall. She patted me vaguely, and went back to Jem’s room. A car stopped in front of the house. I knew Dr. Reynold’s step almost as well as my father’s. He had brought Jem and me into the world, had led us through every childhood disease known to man including the time Jem fell out of the treehouse, and he had never lost our friendship. Dr. Reynolds said if we had been boil-prone things would have been different, but we doubted it. He came in the door and said, “Good Lord.” He walked toward me, said,",
      "density_breakdown": {
        "Metaphor": 0.6178560395427866,
        "Simile": 0.3089280197713933,
        "Imagery": 15.137472968798269,
        "Symbolism": 10.194624652455978,
        "Dialogue": 0.0,
        "Foreshadowing": 4.324992276799506,
        "Juxtaposition": 13.901760889712696,
        "Repetition": 6.178560395427866,
        "TOTAL_DENSITY": 50.6641952425085
      }
    }
  },
  "narrative_position_mapping": {
    "exposition": {
      "chapter_range": "1-4",
      "narrative_primary": 1,
      "optimized_primary": 3,
      "device_density_score": 49.428483163422925,
      "optimization_applied": true,
      "pages": ""
    },
    "rising_action": {
      "chapter_range": "5-20",
      "narrative_primary": 15,
      "optimized_primary": 18,
      "device_density_score": 51.89990732159407,
      "optimization_applied": true,
      "pages": ""
    },
    "climax": {
      "chapter_range": "21",
      "narrative_primary": 21,
      "optimized_primary": 21,
      "device_density_score": 48.501699104108745,
      "optimization_applied": false,
      "pages": ""
    },
    "falling_action": {
      "chapter_range": "22-28",
      "narrative_primary": 25,
      "optimized_primary": 28,
      "device_density_score": 55.589870290302656,
      "optimization_applied": true,
      "pages": ""
    },
    "resolution": {
      "chapter_range": "29-31",
      "narrative_primary": 31,
      "optimized_primary": 29,
      "device_density_score": 50.6641952425085,
      "optimization_applied": true,
      "pages": ""
    }
  },
  "macro_variables": {
    "narrative": {
      "voice": {
        "pov": "FP",
        "pov_description": "First person narration from Scout's perspective throughout",
        "focalization": "INT",
        "focalization_description": "Limited to Scout's child perspective and understanding",
        "reliability": "REL",
        "temporal_distance": "RETRO",
        "mode_dominance": "BAL",
        "free_indirect": "NONE",
        "stream_consciousness": "NONE",
        "character_revelation": "MIX",
        "narrative_intrusion": "SOME",
        "voice_consistency": "CONS"
      },
      "structure": {
        "chronology": "LIN",
        "framing": "NONE",
        "plot_architecture": "MONO",
        "plot_architecture_description": "Single main plot following Scout's coming-of-age through the trial",
        "pacing": "VAR",
        "temporal_span": "EXTENDED",
        "beginning_type": "AB_OVO",
        "ending_type": "CLOSED",
        "scene_summary_ratio": "SCENE",
        "chapter_structure": "TRAD",
        "causation": "STRONG"
      }
    },
    "rhetoric": {
      "voice": {
        "tone": "Innocent yet morally serious, combining childlike wonder with adult retrospective wisdom",
        "register": "COLL",
        "stance": "SUBJ",
        "ethos": "STRONG",
        "pathos": "STRONG",
        "logos": "MOD",
        "irony": "DRAM",
        "figurative_density": "MOD"
      },
      "structure": {
        "alignment_type": "TRANS",
        "narrative_rhetoric_relationship": "TIGHT",
        "primary_mechanism": "CHAR",
        "device_density": "MOD",
        "device_distribution": "EVEN",
        "mediation_strategy": "ACCUMULATION"
      }
    },
    "device_mediation": {
      "summary": "Devices mediate alignment through Scout's evolving moral consciousness, using her innocent perspective to expose adult prejudices while building toward transformative understanding of justice and empathy"
    }
  },
  "alignment_pattern": {
    "pattern_name": "Innocent Revelation",
    "core_dynamic": "First-person child narrator with retrospective distance creates dramatic irony where adult understanding illuminates moral truths through innocent observation.",
    "reader_effect": "Readers experience dual consciousness - seeing through child's eyes while grasping adult implications, creating powerful moral awakening through accumulated understanding.",
    "device_priorities": [
      "Symbolism",
      "Imagery",
      "Juxtaposition",
      "Dramatic Irony",
      "Repetition",
      "Foreshadowing",
      "Characterization",
      "Metaphor"
    ]
  },
  "micro_devices": [
    {
      "name": "Dramatic Irony",
      "anchor_phrase": "I thought I had made things sufficiently clear",
      "location_percent": 5,
      "scene": "Scout explains Walter Cunningham's situation to Miss Caroline",
      "effect": "Adult reader understands Scout's innocent assumption that everyone shares her insider knowledge of local families, while Scout cannot comprehend Miss Caroline's outsider perspective",
      "assigned_section": "exposition",
      "chapter": 3,
      "chapter_range": "1-4",
      "pedagogical_tier": 4
    },
    {
      "name": "Flashback",
      "anchor_phrase": "My special knowledge of the Cunningham tribe—one branch, that is—was gained from events of last winter",
      "location_percent": 15,
      "scene": "Scout recalls Atticus's payment arrangement with Walter's father",
      "effect": "Retrospective narration provides adult context for childhood understanding, revealing moral principles through innocent observation of adult transactions",
      "assigned_section": "exposition",
      "chapter": 3,
      "chapter_range": "1-4",
      "pedagogical_tier": 2
    },
    {
      "name": "Symbolism",
      "anchor_phrase": "One morning Jem and I found a load of stovewood in the back yard",
      "location_percent": 20,
      "scene": "Description of how Mr. Cunningham pays Atticus with goods instead of money",
      "effect": "Physical objects represent dignity and self-respect, which child narrator observes without fully grasping the moral significance adults understand",
      "assigned_section": "exposition",
      "chapter": 3,
      "chapter_range": "1-4",
      "pedagogical_tier": 3
    },
    {
      "name": "Juxtaposition",
      "anchor_phrase": "Are we as poor as the Cunninghams?",
      "location_percent": 25,
      "scene": "Scout questions Atticus about their family's economic status",
      "effect": "Contrasts different types of poverty and social class, with child's innocent inquiry revealing complex social hierarchies that adult perspective illuminates",
      "assigned_section": "exposition",
      "chapter": 3,
      "chapter_range": "1-4",
      "pedagogical_tier": 3
    },
    {
      "name": "Dialogue",
      "anchor_phrase": "There's some folks who don't eat like us",
      "location_percent": 75,
      "scene": "Calpurnia scolds Scout for criticizing Walter's table manners",
      "effect": "Direct speech reveals moral lessons about respect and dignity, with child receiving adult wisdom through innocent social mistake",
      "assigned_section": "exposition",
      "chapter": 3,
      "chapter_range": "1-4",
      "pedagogical_tier": 2
    },
    {
      "name": "First-Person Narration",
      "anchor_phrase": "I returned to school and hated Calpurnia steadily",
      "location_percent": 85,
      "scene": "Scout's reaction after being disciplined by Calpurnia",
      "effect": "Child narrator's honest admission of petty resentment creates dramatic irony as adult reader recognizes the immaturity Scout cannot yet see in herself",
      "assigned_section": "exposition",
      "chapter": 3,
      "chapter_range": "1-4",
      "pedagogical_tier": 5
    },
    {
      "name": "Imagery",
      "anchor_phrase": "He was the filthiest human I had ever seen",
      "location_percent": 90,
      "scene": "Description of Burris Ewell's physical appearance",
      "effect": "Vivid sensory details create stark contrast between social classes through innocent observation, with adult understanding recognizing deeper implications of neglect",
      "assigned_section": "exposition",
      "chapter": 3,
      "chapter_range": "1-4",
      "pedagogical_tier": 1
    },
    {
      "name": "Situational Irony",
      "anchor_phrase": "Little Chuck Little was another member of the population who didn't know where his next meal was coming from, but he was a born gentleman",
      "location_percent": 95,
      "scene": "Little Chuck helps Miss Caroline deal with Burris Ewell",
      "effect": "Contradicts expectations about poverty and character, with child narrator innocently observing moral truth that dignity transcends economic circumstances",
      "assigned_section": "exposition",
      "chapter": 3,
      "chapter_range": "1-4",
      "pedagogical_tier": 4
    },
    {
      "name": "Dramatic Irony",
      "anchor_phrase": "Atticus had to, whether he wanted to",
      "location_percent": 75,
      "scene": "Scout overhears men discussing Atticus's court appointment",
      "effect": "Adult retrospective narrator reveals Scout's innocent misunderstanding of moral complexity - the town's hatred isn't because Atticus was forced to defend Tom, but because he intends to do it well",
      "assigned_section": "rising_action",
      "chapter": 18,
      "chapter_range": "5-20",
      "pedagogical_tier": 4
    },
    {
      "name": "Symbolism",
      "anchor_phrase": "It's like a Roman carnival",
      "location_percent": 45,
      "scene": "Miss Maudie refuses to attend the trial",
      "effect": "The trial as spectacle symbolizes the community's moral decay, with innocent Scout not yet understanding the entertainment value of injustice",
      "assigned_section": "rising_action",
      "chapter": 18,
      "chapter_range": "5-20",
      "pedagogical_tier": 3
    },
    {
      "name": "Juxtaposition",
      "anchor_phrase": "the Negroes sat quietly in the sun",
      "location_percent": 60,
      "scene": "Courthouse square picnic scene before trial",
      "effect": "Contrasts segregated seating arrangements with festive atmosphere, highlighting racial divisions through Scout's matter-of-fact observation",
      "assigned_section": "rising_action",
      "chapter": 18,
      "chapter_range": "5-20",
      "pedagogical_tier": 3
    },
    {
      "name": "First-Person Narration",
      "anchor_phrase": "Well, I hoped Jem would understand",
      "location_percent": 15,
      "scene": "Scout reflects on Walter Cunningham after mob incident",
      "effect": "Child narrator's innocent certainty about her own understanding versus Jem's future growth creates ironic distance for adult retrospective voice",
      "assigned_section": "rising_action",
      "chapter": 18,
      "chapter_range": "5-20",
      "pedagogical_tier": 5
    },
    {
      "name": "Imagery",
      "anchor_phrase": "ablaze with summer flowers",
      "location_percent": 35,
      "scene": "Miss Maudie's garden confronted by foot-washers",
      "effect": "Vivid sensory detail of natural beauty contrasts with religious condemnation, showing Scout's innocent appreciation of life's simple pleasures",
      "assigned_section": "rising_action",
      "chapter": 18,
      "chapter_range": "5-20",
      "pedagogical_tier": 1
    },
    {
      "name": "Foreshadowing",
      "anchor_phrase": "Four Negroes rose and gave us",
      "location_percent": 95,
      "scene": "Children given seats in colored balcony",
      "effect": "Positioning in segregated section hints at upcoming trial dynamics while Scout innocently accepts the kindness without understanding its significance",
      "assigned_section": "rising_action",
      "chapter": 18,
      "chapter_range": "5-20",
      "pedagogical_tier": 3
    },
    {
      "name": "Dialogue",
      "anchor_phrase": "They don't belong anywhere",
      "location_percent": 70,
      "scene": "Jem explains mixed-race children to Scout",
      "effect": "Child's clinical explanation of racial categories reveals learned prejudices while Scout's innocent questions expose the arbitrariness of racial classification",
      "assigned_section": "rising_action",
      "chapter": 18,
      "chapter_range": "5-20",
      "pedagogical_tier": 2
    },
    {
      "name": "Motif",
      "anchor_phrase": "maybe we need a police force",
      "location_percent": 10,
      "scene": "Atticus discusses children stopping the mob",
      "effect": "Recurring theme of children's moral clarity versus adult corruption, with Scout not yet grasping her role as moral catalyst",
      "assigned_section": "rising_action",
      "chapter": 18,
      "chapter_range": "5-20",
      "pedagogical_tier": 3
    },
    {
      "name": "Symbolism",
      "anchor_phrase": "His left arm was fully twelve inches shorter",
      "location_percent": 25,
      "scene": "Tom Robinson stands to be identified by Mayella",
      "effect": "The physical disability symbolizes Tom's powerlessness against false accusations, creating dramatic irony as the child narrator witnesses obvious injustice that adults ignore",
      "assigned_section": "climax",
      "chapter": 21,
      "chapter_range": "21",
      "pedagogical_tier": 3
    },
    {
      "name": "Dramatic Irony",
      "anchor_phrase": "Scout, look! Reverend, he's crippled!",
      "location_percent": 30,
      "scene": "Jem realizes Tom's physical impossibility of committing the alleged crime",
      "effect": "The children immediately grasp what adults refuse to acknowledge, highlighting how innocence can perceive moral truth more clearly than corrupted adult reasoning",
      "assigned_section": "climax",
      "chapter": 21,
      "chapter_range": "21",
      "pedagogical_tier": 4
    },
    {
      "name": "Juxtaposition",
      "anchor_phrase": "Tom Robinson's powerful shoulders rippled under his thin shirt",
      "location_percent": 25,
      "scene": "Description of Tom's physical appearance contrasting strength with disability",
      "effect": "Contrasts Tom's apparent physical power with his actual vulnerability, emphasizing the gap between perception and reality that the innocent narrator observes",
      "assigned_section": "climax",
      "chapter": 21,
      "chapter_range": "21",
      "pedagogical_tier": 3
    },
    {
      "name": "First-Person Narration",
      "anchor_phrase": "As Tom Robinson gave his testimony, it came to me",
      "location_percent": 75,
      "scene": "Scout reflects on Mayella's loneliness during Tom's testimony",
      "effect": "The child narrator's innocent perspective reveals moral complexities about isolation and prejudice that adult characters cannot or will not see",
      "assigned_section": "climax",
      "chapter": 21,
      "chapter_range": "21",
      "pedagogical_tier": 5
    },
    {
      "name": "Imagery",
      "anchor_phrase": "Tom was a black-velvet Negro, not shiny, but soft black velvet",
      "location_percent": 80,
      "scene": "Description of Tom Robinson as he testifies",
      "effect": "Creates vivid sensory detail that humanizes Tom while the innocent narrator observes his dignity despite the dehumanizing trial proceedings",
      "assigned_section": "climax",
      "chapter": 21,
      "chapter_range": "21",
      "pedagogical_tier": 1
    },
    {
      "name": "Repetition",
      "anchor_phrase": "Do you remember him beating you about the face?",
      "location_percent": 10,
      "scene": "Atticus repeatedly questions Mayella about specific details",
      "effect": "The repetitive questioning exposes inconsistencies in testimony, creating mounting tension as the child narrator witnesses the unraveling of false accusations",
      "assigned_section": "climax",
      "chapter": 21,
      "chapter_range": "21",
      "pedagogical_tier": 2
    },
    {
      "name": "Dialogue",
      "anchor_phrase": "How?",
      "location_percent": 35,
      "scene": "Atticus's single-word question to Mayella about Tom's alleged assault",
      "effect": "The stark simplicity of the question crystallizes the logical impossibility, allowing the innocent narrator to witness truth emerging through direct confrontation",
      "assigned_section": "climax",
      "chapter": 21,
      "chapter_range": "21",
      "pedagogical_tier": 2
    },
    {
      "name": "Suspense",
      "anchor_phrase": "Tom Robinson had come to a dead stop",
      "location_percent": 95,
      "scene": "Tom hesitates before revealing the most damaging part of his testimony",
      "effect": "Creates anticipation about Tom's revelation, building climactic tension as the child narrator approaches the moment of ultimate moral truth",
      "assigned_section": "climax",
      "chapter": 21,
      "chapter_range": "21",
      "pedagogical_tier": 4
    },
    {
      "name": "Dramatic Irony",
      "anchor_phrase": "somebody just walked over my grave",
      "location_percent": 85,
      "scene": "Aunt Alexandra feels apprehension before Scout's pageant",
      "effect": "Adult narrator's retrospective knowledge creates tension as innocent child misses the ominous warning of danger to come",
      "assigned_section": "falling_action",
      "chapter": 28,
      "chapter_range": "22-28",
      "pedagogical_tier": 4
    },
    {
      "name": "Symbolism",
      "anchor_phrase": "There was no moon",
      "location_percent": 90,
      "scene": "Scout and Jem walk to the school pageant",
      "effect": "Darkness symbolizes the moral blindness and danger lurking in Maycomb, while child narrator innocently notes weather details",
      "assigned_section": "falling_action",
      "chapter": 28,
      "chapter_range": "22-28",
      "pedagogical_tier": 3
    },
    {
      "name": "Foreshadowing",
      "anchor_phrase": "it might be raining before we got home",
      "location_percent": 92,
      "scene": "Jem comments on the weather as they head to pageant",
      "effect": "Innocent weather observation foreshadows the storm of violence approaching, creating dramatic irony through child's unknowing prophecy",
      "assigned_section": "falling_action",
      "chapter": 28,
      "chapter_range": "22-28",
      "pedagogical_tier": 3
    },
    {
      "name": "Juxtaposition",
      "anchor_phrase": "Boo doesn't mean anybody any harm",
      "location_percent": 95,
      "scene": "Scout expresses comfort about Boo Radley's presence",
      "effect": "Child's innocent trust in the misunderstood Boo contrasts with the real danger from Bob Ewell, revealing moral truth through naive perspective",
      "assigned_section": "falling_action",
      "chapter": 28,
      "chapter_range": "22-28",
      "pedagogical_tier": 3
    },
    {
      "name": "Imagery",
      "anchor_phrase": "sharp shadows on the Radley house",
      "location_percent": 93,
      "scene": "Street light creates shadows as children pass Radley house",
      "effect": "Visual imagery creates atmospheric tension while innocent narrator focuses on simple observational details rather than deeper meaning",
      "assigned_section": "falling_action",
      "chapter": 28,
      "chapter_range": "22-28",
      "pedagogical_tier": 1
    },
    {
      "name": "First-Person Narration",
      "anchor_phrase": "I thought it gallant of him",
      "location_percent": 94,
      "scene": "Scout appreciates Jem carrying her costume",
      "effect": "Child narrator's innocent admiration for her brother's small kindness contrasts with the approaching violence, highlighting moral values through simple observation",
      "assigned_section": "falling_action",
      "chapter": 28,
      "chapter_range": "22-28",
      "pedagogical_tier": 5
    },
    {
      "name": "Motif",
      "anchor_phrase": "Haints, Hot Steams, incantations, secret signs",
      "location_percent": 96,
      "scene": "Children dismiss childhood superstitions as they walk",
      "effect": "Recurring motif of supernatural fears being outgrown ironically precedes encounter with real human evil, showing innocent revelation through maturation",
      "assigned_section": "falling_action",
      "chapter": 28,
      "chapter_range": "22-28",
      "pedagogical_tier": 3
    },
    {
      "name": "Dramatic Irony",
      "anchor_phrase": "Better still, tell the haints to be careful of Scout",
      "location_percent": 15,
      "scene": "Someone offers a ride home and jokes about haints",
      "effect": "Adult retrospective narrator knows this playful warning about ghosts will prove prophetic about real danger, creating irony between innocent moment and coming violence",
      "assigned_section": "resolution",
      "chapter": 29,
      "chapter_range": "29-31",
      "pedagogical_tier": 4
    },
    {
      "name": "Symbolism",
      "anchor_phrase": "from the mud to the stars",
      "location_percent": 25,
      "scene": "Mrs. Merriweather explains the pageant's Latin motto",
      "effect": "The pageant's theme of rising from lowly origins mirrors Scout's moral journey from innocent child to deeper understanding through this traumatic night",
      "assigned_section": "resolution",
      "chapter": 29,
      "chapter_range": "29-31",
      "pedagogical_tier": 3
    },
    {
      "name": "First-Person Narration",
      "anchor_phrase": "I discovered that if I bent my knees",
      "location_percent": 30,
      "scene": "Scout finds a way to sit in her ham costume",
      "effect": "Child narrator's practical focus on physical comfort contrasts with adult understanding of the evening's larger significance, maintaining innocent perspective",
      "assigned_section": "resolution",
      "chapter": 29,
      "chapter_range": "29-31",
      "pedagogical_tier": 5
    },
    {
      "name": "Situational Irony",
      "anchor_phrase": "I chose to make my entrance",
      "location_percent": 35,
      "scene": "Scout arrives late to the pageant finale",
      "effect": "Scout's embarrassing mistake at the pageant becomes trivial compared to the life-threatening attack that follows, revealing how perspective shifts with experience",
      "assigned_section": "resolution",
      "chapter": 29,
      "chapter_range": "29-31",
      "pedagogical_tier": 4
    },
    {
      "name": "Suspense",
      "anchor_phrase": "I hear it when we're walkin' along",
      "location_percent": 65,
      "scene": "Jem realizes they're being followed on the dark walk home",
      "effect": "Building tension through mysterious sounds creates dramatic anticipation while child narrator doesn't fully grasp the mortal danger approaching",
      "assigned_section": "resolution",
      "chapter": 29,
      "chapter_range": "29-31",
      "pedagogical_tier": 4
    },
    {
      "name": "Imagery",
      "anchor_phrase": "wheek, wheek, with every step",
      "location_percent": 75,
      "scene": "Scout describes the sound of their pursuer's clothing",
      "effect": "Sensory detail creates vivid menace while child narrator focuses on concrete sounds rather than comprehending the threat's true nature",
      "assigned_section": "resolution",
      "chapter": 29,
      "chapter_range": "29-31",
      "pedagogical_tier": 1
    },
    {
      "name": "Juxtaposition",
      "anchor_phrase": "A prickly stubble on the face told me",
      "location_percent": 85,
      "scene": "Scout touches the unconscious attacker in the dark",
      "effect": "Child's innocent tactile exploration contrasts sharply with the violence just ended, highlighting her inability to fully process the attack's meaning",
      "assigned_section": "resolution",
      "chapter": 29,
      "chapter_range": "29-31",
      "pedagogical_tier": 3
    },
    {
      "name": "Understatement",
      "anchor_phrase": "I'm all right, Aunty",
      "location_percent": 95,
      "scene": "Scout reassures Aunt Alexandra after the attack",
      "effect": "Child narrator's calm response to trauma demonstrates innocent inability to grasp the full severity of what occurred, while adult retrospective voice understands the profound impact",
      "assigned_section": "resolution",
      "chapter": 29,
      "chapter_range": "29-31",
      "pedagogical_tier": 3
    }
  ]
}